{
    "kategori": "Kitab Berburu",
  "hadits": [
    {
        "number": 1384,
        "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا الْحَجَّاجُ عَنْ مَكْحُولٍ عَنْ أَبِي ثَعْلَبَةَ ح وَالْحَجَّاجُ عَنْ الْوَلِيدِ بْنِ أَبِي مَالِكٍ عَنْ عَائِذِ اللَّهِ بْنِ عَبْدِ اللَّهِ أَنَّهُ سَمِعَ أَبَا ثَعْلَبَةَ الْخُشَنِيَّ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا أَهْلُ صَيْدٍ قَالَ إِذَا أَرْسَلْتَ كَلْبَكَ وَذَكَرْتَ اسْمَ اللَّهِ عَلَيْهِ فَأَمْسَكَ عَلَيْكَ فَكُلْ قُلْتُ وَإِنْ قَتَلَ قَالَ وَإِنْ قَتَلَ قُلْتُ إِنَّا أَهْلُ رَمْيٍ قَالَ مَا رَدَّتْ عَلَيْكَ قَوْسُكَ فَكُلْ قَالَ قُلْتُ إِنَّا أَهْلُ سَفَرٍ نَمُرُّ بِالْيَهُودِ وَالنَّصَارَى وَالْمَجُوسِ فَلَا نَجِدُ غَيْرَ آنِيَتِهِمْ قَالَ فَإِنْ لَمْ تَجِدُوا غَيْرَهَا فَاغْسِلُوهَا بِالْمَاءِ ثُمَّ كُلُوا فِيهَا وَاشْرَبُواقَالَ وَفِي الْبَاب عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَعَائِذُ اللَّهِ بْنُ عَبْدِ اللَّهِ هُوَ أَبُو إِدْرِيسَ الْخَوْلَانِيُّ وَاسْمُ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ جُرْثُومٌ وَيُقَالُ جُرْثُمُ بْنُ نَاشِبٍ وَيُقَالُ ابْنُ قَيْسٍ",
        "id": "Telah menceritakan kepada kami [Ahmad bin Mani'], telah menceritakan kepada kami [Yazid bin Harun], telah menceritakan kepada kami [Al Hajjaj] dari [Makhul] dari [Abu Tsa'labah], hadits diriwayatkan juga dengan jalur [Al Hajjaj] dari [Al Walid bin Abu Malik] dari [A'idzillah bin Abdullah] bahwa ia mendengar [Abu Tsa'labah Al Khusyani] berkata; Aku berkata; Wahai Rasulullah, kami adalah pemburu. Beliau bersabda: \"Jika engkau mengutus (berburu dengan) anjingmu dan engkau menyebut nama Allah saat melepaskannya, lalu ia menangkap mangsa untukmu maka makanlah hasil buruannya itu.\" Aku bertanya; Jika ia telah mati. Beliau menjawab: \"Walaupun telah mati.\" Aku bertanya lagi; Sesungguhnya kami adalah ahli memanah. Beliau bersabda: \"Apa yang terkena oleh panahmu (hewan buruan yang terkena panah), maka makanlah.\" Ia melanjutkan; Aku bertanya; Sesungguhnya kami penduduk Safar, kami melewati orang-orang yahudi, nashrani dan majusi, kami tidak mendapati selain bejana-bejana mereka. Beliau menjawab: \"Jika kalian tidak mendapati selain bejana itu, maka cucilah dengan air kemudian makanlah dan minumlah menggunakan bejana itu.\" Ia mengatakan; Dalam hal ini ada hadits serupa dari 'Adi bin Hatim. Abu Isa berkata; Hadits ini hasan shahih, A`idzullah bin Abdullah adalah Abu Idris Al Khaulani dan nama Abu Tsa'labah Al Khusyani adalah Jurtsum, terkadang dipanggil Jurtsum bin Nasyib dan terkadang dipanggil Ibnu Qais."
    },
    {
        "number": 1385,
        "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا قَبِيصَةُ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ هَمَّامِ بْنِ الْحَارِثِ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا نُرْسِلُ كِلَابًا لَنَا مُعَلَّمَةً قَالَ كُلْ مَا أَمْسَكْنَ عَلَيْكَ قُلْتُ يَا رَسُولَ اللَّهِ وَإِنْ قَتَلْنَ قَالَ وَإِنْ قَتَلْنَ مَا لَمْ يَشْرَكْهَا كَلْبٌ غَيْرُهَا قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّا نَرْمِي بِالْمِعْرَاضِ قَالَ مَا خَزَقَ فَكُلْ وَمَا أَصَابَ بِعَرْضِهِ فَلَا تَأْكُلْحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ حَدَّثَنَا سُفْيَانُ عَنْ مَنْصُورٍ نَحْوَهُ إِلَّا أَنَّهُ قَالَ وَسُئِلَ عَنْ الْمِعْرَاضِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan], telah menceritakan kepada kami [Qabishah] dari [Sufyan] dari [Manshur] dari [Ibrahim] dari [Hammam bin Al Harits] dari ['Adi bin Hatim] ia berkata; Aku berkata; Wahai Rasulullah, sesungguhnya kami mengutus (berburu dengan) seekor anjing yang terlatih. Beliau bersabda: \"Makanlah setiap apa yang ditangkap untukmu.\" Aku bertanya; Wahai Rasulullah, jika ia membunuhnya? Beliau menjawab: \"Walaupun ia membunuhnya selama tidak ada anjing lain yang ikut membunuhnya.\" Ia melanjutkan; Aku bertanya; Wahai Rasulullah, sesungguhnya kami melempar dengan sisi panah. Beliau menjawab: \"Apa yang ia tembus (oleh panah itu) makanlah, apa yang terkena sisi panah janganlah engkau makan.\" Telah menceritakan kepada kami [Muhammad bin Yahya] telah menceritakan kepada kami [Muhammad bin Yusuf] telah menceritakan kepada kami [Sufyan] dari [Manshur] seperti itu kecuali bahwa ia berkata; Dan beliau ditanya tentang sisi panah. Abu Isa berkata; Haditsi ini hasan shahih."
    },
    {
        "number": 1386,
        "arab": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى حَدَّثَنَا وَكِيعٌ حَدَّثَنَا شَرِيكٌ عَنْ الْحَجَّاجِ عَنْ الْقَاسِمِ بْنِ أَبِي بَزَّةَ عَنْ سُلَيْمَانَ الْيَشْكُرِيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَنُهِينَا عَنْ صَيْدِ كَلْبِ الْمَجُوسِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ لَا يُرَخِّصُونَ فِي صَيْدِ كَلْبِ الْمَجُوسِ وَالْقَاسِمُ بْنُ أَبِي بَزَّةَ هُوَ الْقَاسِمُ بْنُ نَافِعٍ الْمَكِّيُّ",
        "id": "Telah menceritakan kepada kami [Yusuf bin Isa], telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Syarik] dari [Al Hajjaj] dari [Al Qosim bin Abu Bazzah] dari [Sulaiman Al Yasykuri] dari [Jabir bin Abdullah] ia berkata; Kami dilarang dari hasil buruan anjng Majusi. Abu Isa berkata; Hadits ini gharib tidak kami ketahui kecuali dari jalur ini. Hadits ini menjadi pedoman amal menurut kebanyakan ulama, mereka tidak membolehkan berburu dengan anjing Majusi. Al Qasim bin Abu Bazzah adalah Al Qasim bin Nafi' Al Makki."
    },
    {
        "number": 1387,
        "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ وَهَنَّادٌ وَأَبُو عَمَّارٍ قَالُوا حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ مُجَالِدٍ عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَيْدِ الْبَازِي فَقَالَ مَا أَمْسَكَ عَلَيْكَ فَكُلْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ مُجَالِدٍ عَنْ الشَّعْبِيِّ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ لَا يَرَوْنَ بِصَيْدِ الْبُزَاةِ وَالصُّقُورِ بَأْسًا و قَالَ مُجَاهِدٌ الْبُزَاةُ هُوَ الطَّيْرُ الَّذِي يُصَادُ بِهِ مِنْ الْجَوَارِحِ الَّتِي قَالَ اللَّهُ تَعَالَى{ وَمَا عَلَّمْتُمْ مِنْ الْجَوَارِحِ }فَسَّرَ الْكِلَابَ وَالطَّيْرَ الَّذِي يُصَادُ بِهِ وَقَدْ رَخَّصَ بَعْضُ أَهْلِ الْعِلْمِ فِي صَيْدِ الْبَازِي وَإِنْ أَكَلَ مِنْهُ وَقَالُوا إِنَّمَا تَعْلِيمُهُ إِجَابَتُهُ وَكَرِهَهُ بَعْضُهُمْ وَالْفُقَهَاءُ أَكْثَرُهُمْ قَالُوا يَأْكُلُ وَإِنْ أَكَلَ مِنْهُ",
        "id": "Telah menceritakan kepada kami [Nashr bin Ali], [Hannad] dan [Abu 'Ammar] mereka berkata; Telah menceritakan kepada kami [Isa bin Yunus] dari [Mujalid] dari [Asy Sya'bi] dari ['Adi bin Hatim] ia berkata; Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang buruan burung elang. Beliau menjawab: \"Apa yang didapat untukmu makanlah.\" Abu Isa berkata; Hadits ini tidak kami ketahui kecuali dari Hadits Mujalid dari Asy Sya'bi. Hadits ini menjadi pedoman amal menurut para ulama, mereka membolehkan berburu dengan burung pemangsa dan burung elang. Mujalid berkata; Al Buzah adalah burung yang telah dilatih untuk berburu, sebagaimana yang Allah firmankan: (Dan (buruan yang ditangkap) oleh binatang buas yang Telah kamu ajar dengan melatih nya untuk berburu). Ia menafsirkan dengan anjing dan burung yang dilatih untuk berburu. Sebagian ulama membolehkan berburu dengan burung elang walaupun ia memakannya. Dan mereka mengatakan; Sesungguhnya wajib untuk mengajarinya, namun sebagian dari mereka dan para fuqaha memakruhkan, kebanyakan mereka berpendapat; Boleh memakannya walaupun ia ikut memakannya."
    },
    {
        "number": 1388,
        "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ أَخْبَرَنَا شُعْبَةُ عَنْ أَبِي بِشْرٍ قَال سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ يُحَدِّثُ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أَرْمِي الصَّيْدَ فَأَجِدُ فِيهِ مِنْ الْغَدِ سَهْمِي قَالَ إِذَا عَلِمْتَ أَنَّ سَهْمَكَ قَتَلَهُ وَلَمْ تَرَ فِيهِ أَثَرَ سَبُعٍ فَكُلْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ وَرَوَى شُعْبَةُ هَذَا الْحَدِيثَ عَنْ أَبِي بِشْرٍ وَعَبْدِ الْمَلِكِ بْنِ مَيْسَرَةَ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ عَدِيِّ بْنِ حَاتِمٍ مِثْلَهُ وَكِلَا الْحَدِيثَيْنِ صَحِيحٌ وَفِي الْبَاب عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ",
        "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan], telah menceritakan kepada kami [Abu Dawud] telah mengabarkan kepada kami [Syu'bah] dari [Abu Bisyr] ia berkata; Aku mendengar [Sa'id bin Jubair] menceritakan dari ['Adi bin Hatim] ia berkata; Aku bertanya; Wahai Rasulullah, aku memanah buruan lalu aku mendapati esok harinya tertancap panahku? Beliau menjawab: \"Jika engkau mengetahui bahwa panahmu yang membunuhnya dan engkau tidak melihat bekas hewan buas, maka makanlah.\" Abu Isa berkata; Hadits ini hasan shahih dan menjadi pedoman amal menurut para ulama, [Syu'bah] meriwayatkan hadits ini dari [Abu Bisyr] dan [Abdul Malik bin Maisarah] dari [Sa'id bin Jubair] dari ['Adi bin Hatim] seperti itu, kedua hadits itu shahih. Dalam hal ini ada hadits serupa dari Abu Tsa'labah Al Khusyani."
    },
    {
        "number": 1389,
        "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنِي عَاصِمٌ الْأَحْوَلُ عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الصَّيْدِ فَقَالَ إِذَا رَمَيْتَ بِسَهْمِكَ فَاذْكُرْ اسْمَ اللَّهِ فَإِنْ وَجَدْتَهُ قَدْ قُتِلَ فَكُلْ إِلَّا أَنْ تَجِدَهُ قَدْ وَقَعَ فِي مَاءٍ فَلَا تَأْكُلْ فَإِنَّكَ لَا تَدْرِي الْمَاءُ قَتَلَهُ أَوْ سَهْمُكَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Ahmad bin Mani'], telah menceritakan kepada kami [Abdullah bin Al Mubarak] telah mengabarkan kepadaku ['Ashim Al Ahwal] dari [Asy Sya'bi] dari ['Adi bin Hatim] ia berkata; Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang hewan buruan. Beliau menjawab: \"Jika engkau melempar dengan panahmu sebutlah nama Allah, jika engkau mendapatinya telah mati maka makanlah kecuali engkau mendapatinya tergenang di air, jangan engkau makan karena engkau tidak tahu apakah air atau panahmu yang membunuhnya.\" Abu Isa berkata; Hadits ini hasan shahih."
    },
    {
        "number": 1390,
        "arab": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ مُجَالِدٍ عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَيْدِ الْكَلْبِ الْمُعَلَّمِ قَالَ إِذَا أَرْسَلْتَ كَلْبَكَ الْمُعَلَّمَ وَذَكَرْتَ اسْمَ اللَّهِ فَكُلْ مَا أَمْسَكَ عَلَيْكَ فَإِنْ أَكَلَ فَلَا تَأْكُلْ فَإِنَّمَا أَمْسَكَ عَلَى نَفْسِهِ قُلْتُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ خَالَطَتْ كِلَابَنَا كِلَابٌ أُخَرُ قَالَ إِنَّمَا ذَكَرْتَ اسْمَ اللَّهِ عَلَى كَلْبِكَ وَلَمْ تَذْكُرْ عَلَى غَيْرِهِقَالَ سُفْيَانُ أَكْرَهُ لَهُ أَكْلَهُ قَالَ أَبُو عِيسَى وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ فِي الصَّيْدِ وَالذَّبِيحَةِ إِذَا وَقَعَا فِي الْمَاءِ أَنْ لَا يَأْكُلَ فَقَالَ بَعْضُهُمْ فِي الذَّبِيحَةِ إِذَا قُطِعَ الْحُلْقُومُ فَوَقَعَ فِي الْمَاءِ فَمَاتَ فِيهِ فَإِنَّهُ يُؤْكَلُ وَهُوَ قَوْلُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ وَقَدْ اخْتَلَفَ أَهْلُ الْعِلْمِ فِي الْكَلْبِ إِذَا أَكَلَ مِنْ الصَّيْدِ فَقَالَ أَكْثَرُ أَهْلِ الْعِلْمِ إِذَا أَكَلَ الْكَلْبُ مِنْهُ فَلَا تَأْكُلْ وَهُوَ قَوْلُ سُفْيَانَ وَعَبْدِ اللَّهِ بْنِ الْمُبَارَكِ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَقَ وَرَخَّصَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ فِي الْأَكْلِ مِنْهُ وَإِنْ أَكَلَ الْكَلْبُ مِنْهُ",
        "id": "Telah menceritakan kepada kami [Ibnu Abu Umar], telah menceritakan kepada kami [Sufyan] dari [Mujalid] dari [Asy Sya'bi] dari ['Adi bin Hatim] ia berkata; Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang berburu dengan anjing terlatih. Beliau menjawab: \"Jika engkau mengutus anjingmu yang terlatih dan menyebut nama Allah, maka makanlah apa yang ditangkapkan untukmu. Jika ia memakannya maka janganlah engkau memakannya, karena ia menangkap untuk dirinya.\" Aku bertanya; Wahai Rasulullah, jika anjing kami bercampur dengan anjing lain? Beliau menjawab: \"Sesungguhnya engkau menyebut nama Allah untuk (melepas) anjingmu dan engkau tidak menyebutnya (asma Allah, basmalah) untuk yang lain.\" Sufyan berkata; Aku memakruhkan untuk memakannya. Abu Isa berkata; Hadits ini menjadi pedoman amal menurut sebagian ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka tentang hewan buruan dan sembelihan jika jatuh ke dalam air agar tidak memakannya. Sebagian mereka berpendapat tentang hewan sembelihan; Jika terpotong tenggorokannya lalu jatuh ke dalam air dan mati maka ia dimakan, ini menjadi pendapat Abdullah bin Al Mubarak. Sedangkan para ulama berselisih tentang anjing yang memakan hewan buruan, kebanyakan mereka berpendapat; Jika anjing itu makan darinya maka jangan engkau makan, ini menjadi pendapat Sufyan dan Abdullah bin Al Mubarak, Asy Syafi'i, Ahmad dan Ishaq, namun sebagian ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka membolehkan makan darinya meskipun anjing memakan darinya."
    },
    {
        "number": 1391,
        "arab": "حَدَّثَنَا يُوسُفُ بْنُ عِيسَى حَدَّثَنَا وَكِيعٌ حَدَّثَنَا زَكَرِيَّا عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ صَيْدِ الْمِعْرَاضِ فَقَالَ مَا أَصَبْتَ بِحَدِّهِ فَكُلْ وَمَا أَصَبْتَ بِعَرْضِهِ فَهُوَ وَقِيذٌحَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ زَكَرِيَّا عَنْ الشَّعْبِيِّ عَنْ عَدِيِّ بْنِ حَاتِمٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ وَالْعَمَلُ عَلَيْهِ عِنْدَ أَهْلِ الْعِلْمِ",
        "id": "Telah menceritakan kepada kami [Yusuf bin Isa], telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Zakariya] dari [Asy Sya'bi] dari ['Adi bin Hatim] ia berkata; Aku bertanya kepada Rasulullah shallallahu 'alaihi wasallam tentang buruan yang terkena sisi panah. Beliau menjawab: \"Apa yang terkena dengan besinya, maka makanlah, dan yang terkena sisinya maka itu adalah mati secara perlahan.\" Telah menceritakan kepada kami [Ibnu Abu Umar], telah menceritakan kepada kami [Sufyan] dari [Zakariya] dari [Asy Sya'bi] dari ['Adi bin Hatim] dari Nabi shallallahu 'alaihi wasallam seperti itu. Abu Isa berkata; Hadits ini hasan shahih dan menjadi pedoman amal menurut para ulama."
    }
  ]
}