{
    "kategori": "Kitab Sifat Kiamat, Penggugah Hati dan Waro'",
  "hadits": [
    {
        "number": 2339,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ خَيْثَمَةَ عَنْ عَدِيِّ بْنِ حَاتِمٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْكُمْ مِنْ رَجُلٍ إِلَّا سَيُكَلِّمُهُ رَبُّهُ يَوْمَ الْقِيَامَةِ وَلَيْسَ بَيْنَهُ وَبَيْنَهُ تُرْجُمَانٌ فَيَنْظُرُ أَيْمَنَ مِنْهُ فَلَا يَرَى شَيْئًا إِلَّا شَيْئًا قَدَّمَهُ ثُمَّ يَنْظُرُ أَشْأَمَ مِنْهُ فَلَا يَرَى شَيْئًا إِلَّا شَيْئًا قَدَّمَهُ ثُمَّ يَنْظُرُ تِلْقَاءَ وَجْهِهِ فَتَسْتَقْبِلُهُ النَّارُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اسْتَطَاعَ مِنْكُمْ أَنْ يَقِيَ وَجْهَهُ حَرَّ النَّارِ وَلَوْ بِشِقِّ تَمْرَةٍ فَلْيَفْعَلْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ حَدَّثَنَا أَبُو السَّائِبِ حَدَّثَنَا وَكِيعٌ يَوْمًا بِهَذَا الْحَدِيثِ عَنْ الْأَعْمَشِ فَلَمَّا فَرَغَ وَكِيعٌ مِنْ هَذَا الْحَدِيثِ قَالَ مَنْ كَانَ هَا هُنَا مِنْ أَهْلِ خُرَاسَانَ فَلْيَحْتَسِبْ فِي إِظْهَارِ هَذَا الْحَدِيثِ بِخُرَاسَانَ لِأَنَّ الْجَهْمِيَّةَ يُنْكِرُونَ هَذَا اسْمُ أَبِي السَّائِبِ سَلْمُ بْنُ جُنَادَةَ بْنِ سَلْمِ بْنِ خَالِدِ بْنِ جَابِرِ بْنِ سَمُرَةَ الْكُوفِيُّ",
        "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Khaitsamah] dari ['Adi bin Hatim] berkata: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Tidaklah ada seorang dari kalian melainkan akan diajak bicara Rabbnya pada hari kiamat yang tidak ada penerjemah antara keduanya, ia melihat ke sisi paling membawa berkahnya, ia tidak melihat apa pun kecuali sesuatu yang telah diperbuat, lalu ia melihat ke sisi kirinya, ia tidak melihat apa pun selain sesuatu yang telah diperbuat lalu ia melihat ke arah depannya, lalu neraka menyambutnya.\" Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Barangsiapa di antara kalian bisa menjaga wajahnya dari panasnya neraka meski dengan sebelah kurma hendaklah ia lakukan.\" Berkata Abu Isa: Hadits ini hasan shahih. Telah menceritakan kepada kami [Abu As Sa`ib] telah menceritakan kepada kami [Waki'] pada suatu hari hadits ini dari [Al A'masy], setelah usai menyebut hadits ini Waki' berkata: Siapa pun penduduk Khurasan yang ada di sini, hendaklah mengharap pahala dengan menyebarkan hadits ini di Khurasan karena jahmiyah mengingkari hadits ini. nama Abu As Sa`ib adalah Salm bin Junadah bin Salm bin Khalid bin Jabir bin Samurah Al Kufi."
    },
    {
        "number": 2340,
        "arab": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ حَدَّثَنَا حُصَيْنُ بْنُ نُمَيْرٍ أَبُو مِحْصَنٍ حَدَّثَنَا حُسَيْنُ بْنُ قَيْسٍ الرَّحَبِيُّ حَدَّثَنَا عَطَاءُ بْنُ أَبِي رَبَاحٍ عَنْ ابْنِ عُمَرَ عَنْ ابْنِ مَسْعُودٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا تَزُولُ قَدَمُ ابْنِ آدَمَ يَوْمَ الْقِيَامَةِ مِنْ عِنْدِ رَبِّهِ حَتَّى يُسْأَلَ عَنْ خَمْسٍ عَنْ عُمُرِهِ فِيمَ أَفْنَاهُ وَعَنْ شَبَابِهِ فِيمَ أَبْلَاهُ وَمَالِهِ مِنْ أَيْنَ اكْتَسَبَهُ وَفِيمَ أَنْفَقَهُ وَمَاذَا عَمِلَ فِيمَا عَلِمَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ مِنْ حَدِيثِ ابْنِ مَسْعُودٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا مِنْ حَدِيثِ الْحُسَيْنِ بْنِ قَيْسٍ وَحُسَيْنُ بْنُ قَيْسٍ يُضَعَّفُ فِي الْحَدِيثِ مِنْ قِبَلِ حِفْظِهِ وَفِي الْبَاب عَنْ أَبِي بَرْزَةَ وَأَبِي سَعِيدٍ",
        "id": "Telah menceritakan kepada kami [Humaid bin Mas'adah] telah menceritakan kepada kami [Hushain bin Numair Abu Mihshan] telah menceritakan kepada kami [Husain bin Qais Ar Rahabi] telah menceritakan kepada kami ['Atho` bin Abu Rabah] dari [Ibnu Umar] dari [Ibnu Mas'ud] dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Kaki Anak Adam tidaklah bergeser pada hari Kiamat dari sisi Rabbnya sehingga ditanya tentang lima hal; tentang umurnya untuk apa dia habiskan, tentang masa mudanya untuk apa dia pergunakan, tentang hartanya dari mana dia peroleh dan kemana dia infakkan dan tentang apa yang telah dia lakukan dengan ilmunya.\" Abu Isa berkata: Hadits ini gharib, kami tidak mengetahuinya dari hadits Ibnu Mas'ud dari Nabi Shallallahu 'alaihi wa Salam kecuali dari Hadits Al Husain bin Qais, sementara Husain bin Qais dilemahkan dalam masalah hadits karena sisi hafalannya, dan dalam bab ini ada hadits dari Abu Barzah dan Abu Sa'id."
    },
    {
        "number": 2341,
        "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا الْأَسْوَدُ بْنُ عَامِرٍ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ الْأَعْمَشِ عَنْ سَعِيدِ بْنِ عَبْدِ اللَّهِ بْنِ جُرَيْجٍ عَنْ أَبِي بَرْزَةَ الْأَسْلَمِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تَزُولُ قَدَمَا عَبْدٍ يَوْمَ الْقِيَامَةِ حَتَّى يُسْأَلَ عَنْ عُمُرِهِ فِيمَا أَفْنَاهُ وَعَنْ عِلْمِهِ فِيمَ فَعَلَ وَعَنْ مَالِهِ مِنْ أَيْنَ اكْتَسَبَهُ وَفِيمَ أَنْفَقَهُ وَعَنْ جِسْمِهِ فِيمَ أَبْلَاهُقَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَسَعِيدُ بْنُ عَبْدِ اللَّهِ بْنِ جُرَيْجٍ هُوَ بَصْرِيٌّ وَهُوَ مَوْلَى أَبِي بَرْزَةَ وَأَبُو بَرْزَةَ اسْمُهُ نَضْلَةُ بْنُ عُبَيْدٍ",
        "id": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman] telah menceritakan kepada kami [Al Aswad bin 'Amir] telah mengkhabarkan kepada kami [Abu Bakar bin Ayyasy] dari [Al A'masy] dari [Sa'id bin Abdullah bin Juraij] dari [Abu Barzah Al Aslami] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Kedua telapak kaki seorang hamba tidak akan bergeser pada hari kiamat sampai ditanya tentang umurnya untuk apa dia habiskan, tentang ilmunya untuk apa dia amalkan, tentang hartanya dari mana dia peroleh dan kemana dia infakkan dan tentang tubuhnya untuk apa dia gunakan.\" Dia berkata: Hadits ini hasan shahih, adapun Sa'id bin Abdullah bin Juraij dia adalah orang Bashrah dan dia adalah budak Abu Barzah, sedangkan Abu Barzah namanya adalah Nadlah bin 'Ubaid."
    },
    {
        "number": 2342,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَتَدْرُونَ مَا الْمُفْلِسُ قَالُوا الْمُفْلِسُ فِينَا يَا رَسُولَ اللَّهِ مَنْ لَا دِرْهَمَ لَهُ وَلَا مَتَاعَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُفْلِسُ مِنْ أُمَّتِي مَنْ يَأْتِي يَوْمَ الْقِيَامَةِ بِصَلَاتِهِ وَصِيَامِهِ وَزَكَاتِهِ وَيَأْتِي قَدْ شَتَمَ هَذَا وَقَذَفَ هَذَا وَأَكَلَ مَالَ هَذَا وَسَفَكَ دَمَ هَذَا وَضَرَبَ هَذَا فَيَقْعُدُ فَيَقْتَصُّ هَذَا مِنْ حَسَنَاتِهِ وَهَذَا مِنْ حَسَنَاتِهِ فَإِنْ فَنِيَتْ حَسَنَاتُهُ قَبْلَ أَنْ يُقْتَصَّ مَا عَلَيْهِ مِنْ الْخَطَايَا أُخِذَ مِنْ خَطَايَاهُمْ فَطُرِحَ عَلَيْهِ ثُمَّ طُرِحَ فِي النَّارِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Al 'Alla` bin Abdurrahman] dari [ayahnya] dari [Abu Hurairah] Rasulullah Shallallahu 'alaihi wa salam bertanya: \"Tahukah kalian siapa orang yang rugi itu?\" mereka menjawab: Orang rugi di antara kami wahai Rasulullah adalah orang yang tidak memiliki dirham dan barang. Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Orang rugi dari ummatku adalah orang yang membawa shalat, puasa dan zakat pada hari kiamat, ia datang sementara ia dulu pernah mencela si anu, menuduh berzina si anu, memakan harta si anu, menumpahkan darah si anu dan memukul si anu. Ia duduk lalu kebaikan-kebaikan si ini diqisas dari kebaikan-kebaikannya, bila kebaikan-kebaikannya habis sebelum sepadan dengan kesalahan-kesalahannya, kesalahan-kesalahan mereka diambil lalu dibuang kepadanya, setelah itu dia dilempar ke neraka.\" Berkata Abu Isa: Hadits ini hasan shahih."
    },
    {
        "number": 2343,
        "arab": "حَدَّثَنَا هَنَّادٌ وَنَصْرُ بْنُ عَبْدِ الرَّحْمَنِ الْكُوفِيُّ قَالَا حَدَّثَنَا الْمُحَارِبِيُّ عَنْ أَبِي خَالِدٍ يَزِيدَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَحِمَ اللَّهُ عَبْدًا كَانَتْ لِأَخِيهِ عِنْدَهُ مَظْلَمَةٌ فِي عِرْضٍ أَوْ مَالٍ فَجَاءَهُ فَاسْتَحَلَّهُ قَبْلَ أَنْ يُؤْخَذَ وَلَيْسَ ثَمَّ دِينَارٌ وَلَا دِرْهَمٌ فَإِنْ كَانَتْ لَهُ حَسَنَاتٌ أُخِذَ مِنْ حَسَنَاتِهِ وَإِنْ لَمْ تَكُنْ لَهُ حَسَنَاتٌ حَمَّلُوا عَلَيْهِ مِنْ سَيِّئَاتِهِمْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ حَدِيثِ سَعِيدٍ الْمَقْبُرِيِّ وَقَدْ رَوَاهُ مَالِكُ بْنُ أَنَسٍ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
        "id": "Telah menceritakan kepada kami [Hannad] dan [Nashr bin Abdurrahman Al Kufi] keduanya berkata: telah menceritakan kepada kami [Al Muharibi] dari [Abu Khalid Yazid bin Abdurrahman] dari [Zaid bin Abu 'Unaisah] dari [Sa'id Al Maqburi] dari [Abu Hurairah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Allah memberikan rahmat kepada seorang hamba yang dizhalimi harga diri dan hartanya oleh saudaranya, kemudian dia (yang zhalim) mendatanginya dan dia (yang dizhalimi) merelakannya sebelum meninggal, tidak ada balasan uang dinar maupun dirham (di akhirat), jika dia (orang yang dizhalimi) memiliki kebaikan niscaya akan dipenuhi kebaikannya namun jika tidak mempunyai kebaikan maka (dosa dosa yang zhalimi) akan di berikan kepadanya (orang yang menzhalimi).\" Abu Isa berkata: Hadits ini hasan shahih gharib dari hadits Sa'id Al Maqburi, [Malik bin Anas] telah meriwayatkannya dari [Sa'id Al Maqburi] dari [Abu Hurairah] dari Nabi Shallallahu 'alaihi wa Salam dengan hadits yang semakna."
    },
    {
        "number": 2344,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَتُؤَدُّنَّ الْحُقُوقَ إِلَى أَهْلِهَا حَتَّى يُقَادَ لِلشَّاةِ الْجَلْحَاءِ مِنْ الشَّاةِ الْقَرْنَاءِوَفِي الْبَاب عَنْ أَبِي ذَرٍّ وَعَبْدِ اللَّهِ بْنِ أُنَيْسٍ قَالَ أَبُو عِيسَى وَحَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Al 'Alla` bin Abdurrahman] dari [ayahnya] dari [Abu Hurairah] Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Hak-hak akan ditunaikan kepada pemiliknya hingga kambing bertanduk di qisas karena kambing botak.\" Dalam hal ini ada hadits serupa dari Abu Hurairah, Abu Dzarr, Abdullah bin Unais. Berkata Abu Isa: Hadits Abu Hurairah hasan shahih."
    },
    {
        "number": 2345,
        "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا ابْنُ الْمُبَارَكِ أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ يَزِيدَ بْنِ جَابِرٍ حَدَّثَنِي سُلَيْمُ بْنُ عَامِرٍ حَدَّثَنَا الْمِقْدَادُ صَاحِبُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا كَانَ يَوْمُ الْقِيَامَةِ أُدْنِيَتْ الشَّمْسُ مِنْ الْعِبَادِ حَتَّى تَكُونَ قِيدَ مِيلٍ أَوْ اثْنَيْنِ قَالَ سُلَيْمٌ لَا أَدْرِي أَيَّ الْمِيلَيْنِ عَنَى أَمَسَافَةُ الْأَرْضِ أَمْ الْمِيلُ الَّذِي تُكْتَحَلُ بِهِ الْعَيْنُ قَالَ فَتَصْهَرُهُمْ الشَّمْسُ فَيَكُونُونَ فِي الْعَرَقِ بِقَدْرِ أَعْمَالِهِمْ فَمِنْهُمْ مَنْ يَأْخُذُهُ إِلَى عَقِبَيْهِ وَمِنْهُمْ مَنْ يَأْخُذُهُ إِلَى رُكْبَتَيْهِ وَمِنْهُمْ مَنْ يَأْخُذُهُ إِلَى حِقْوَيْهِ وَمِنْهُمْ مَنْ يُلْجِمُهُ إِلْجَامًا فَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُشِيرُ بِيَدِهِ إِلَى فِيهِ أَيْ يُلْجِمُهُ إِلْجَامًاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْبَاب عَنْ أَبِي سَعِيدٍ وَابْنِ عُمَرَ",
        "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Ibnu Al Mubarak] telah mengkhabarkan kepada kami [Abdurrahman bin Yazid bin Jabir] telah menceritakan kepadaku [Sulaim bin 'Amir] telah menceritakan kepada kami [Al Miqdad] sahabat Rasulullah Shallallahu 'alahi wa Salam, berkata: Aku mendengar Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Pada hari kiamat, matahari di dekatkan ke manusia hingga sebatas satu atau dua mil -berkata Sulam: Aku tidak tahu apakah maksud dua mil itu jarak bumi ataukah mil yang dipakai bercalak mata- lalu matahari melehkan mereka, lalu mereka berada dalam keringat sesuai amal perbuatan mereka, di antara mereka ada yang berkeringat hingga tumitnya, ada yang berkeringat hingga lututnya, ada yang berkeringat hingga pinggang dan ada yang benar-benar tenggelam oleh keringat.\" Aku melihat Rasulullah Shallallahu 'alahi wa Salam menunjukkan tangan ke mulut, maksudnya benar-benar tenggelam. Berkata Abu Isa: Hadits ini hasan shahih dan dalam hal ini ada hadits serupa dari Abu Sa'id dan Ibnu Umar."
    },
    {
        "number": 2346,
        "arab": "حَدَّثَنَا أَبُو زَكَرِيَّا يَحْيَى بْنُ دُرُسْتَ الْبَصْرِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ أَيُّوبَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَ حَمَّادٌ وَهُوَ عِنْدَنَا مَرْفُوعٌ{ يَوْمَ يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ }قَالَ يَقُومُونَ فِي الرَّشْحِ إِلَى أَنْصَافِ آذَانِهِمْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ حَدَّثَنَا هَنَّادٌ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ ابْنِ عَوْنٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
        "id": "Telah menceritakan kepada kami [Abu Zakariya Yahya bin Durusta Al Bashri] telah menceritakan kepada kami [Hammad bin Zaid] dari [Ayyub] dari [Nafi'] dari [Ibnu Umar], berkata Hammad: Itu menurut kami marfu': Pada hari manusia berdiri untuk Rabb semesta alam. Ia berkata: Mereka berdiri dalam keringat hingga mencapai pertengahan telinga mereka. Berkata Abu Isa: Hadits ini hasan shahih. Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami ['Isa bin Yunus] dari [Ibnu 'Aun] dari [Nafi'] dari [Ibnu Umar] dari nabi Shallallahu 'alaihi wa Salam sepertinya."
    },
    {
        "number": 2347,
        "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ حَدَّثَنَا سُفْيَانُ عَنْ الْمُغِيرَةِ بْنِ النُّعْمَانِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ حُفَاةً عُرَاةً غُرْلًا كَمَا خُلِقُوا ثُمَّ قَرَأَ{ كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُعِيدُهُ وَعْدًا عَلَيْنَا إِنَّا كُنَّا فَاعِلِينَ }وَأَوَّلُ مَنْ يُكْسَى مِنْ الْخَلَائِقِ إِبْرَاهِيمُ وَيُؤْخَذُ مِنْ أَصْحَابِي بِرِجَالٍ ذَاتَ الْيَمِينِ وَذَاتَ الشِّمَالِ فَأَقُولُ يَا رَبِّ أَصْحَابِي فَيُقَالُ إِنَّكَ لَا تَدْرِي مَا أَحْدَثُوا بَعْدَكَ إِنَّهُمْ لَمْ يَزَالُوا مُرْتَدِّينَ عَلَى أَعْقَابِهِمْ مُنْذُ فَارَقْتَهُمْ فَأَقُولُ كَمَا قَالَ الْعَبْدُ الصَّالِحُ{ إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبَادُكَ وَإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ }حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ شُعْبَةَ عَنْ الْمُغِيرَةِ بْنِ النُّعْمَانِ بِهَذَا الْإِسْنَادِ فَذَكَرَ نَحْوَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Ahmad Az Zubairi] telah menceritakan kepada kami [Sufyan] dari [Al Mughirah bin An Nu'man] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas] berkata: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Manusia dikumpulkan pada hari kiamat dalam kondisi tanpa alas kaki, telanjang dan belum disunat.\" Kemudian beliau membaca: \"Sebagaimana kami telah memulai panciptaan pertama begitulah Kami akan mengulanginya. Itulah suatu janji yang pasti kami tepati.\" (Al-Anbiyaa`: 104) dan makhluk pertama yang diberi pakaian adalah Ibrahim dan di antara para sahabat-sahabat kami ada yang diambil dari kiki dan kanan, aku berkata: Wahai Rabb, sahabat-sahabatku. Dikatakan: Sesungguhnya engkau tidak tahu apa yang mereka buat-buat setelahmu, mereka tetap murtad sejak kau tinggalkan mereka. Lalu aku berkata seperti yang diucapkan hamba shalih: \"Jika Engkau menyiksa mereka, maka sesungguhnya mereka adalah hamba-hamba Engkau, dan jika Engkau mengampuni mereka, maka sesungguhnya Engkaulah yang Maha Perkasa lagi Maha Bijaksana.\" (Al-Maa`idah: 118) Telah menceritakan kepada kami [Muhammad bin Basyar] dan [Muhammad bin Al Mutsanna] keduanya berkata: telah menceritakan kepada kami [Muhammad bin Ja'far] dari [Syu'bah] dari [Al Mughirah bin An Nu'man] dengan sanad ini lalu ia menyebut sepertinya. Berkata Abu Isa: Hadits ini hasan shahih."
    },
    {
        "number": 2348,
        "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا بَهْزُ بْنُ حَكِيمٍ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّكُمْ مَحْشُورُونَ رِجَالًا وَرُكْبَانًا وَتُجَرُّونَ عَلَى وُجُوهِكُمْوَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Yazid bin Harun] telah mengkhabarkan kepada kami [Bahz bin Hakim] dari [ayahnya] dari [kakeknya] berkata: Aku mendengar Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Sesungguhnya kalian akan dikumpulkan dengan berjalan kaki, berkendaraan dan diseret di atas muka-muka kalian.\" Dalam hal ini ada hadits serupa dari Abu Hurairah. Berkata Abu Isa: Hadits ini hasan shahih."
    },
    {
        "number": 2349,
        "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ عَنْ عَلِيِّ بْنِ عَلِيٍّ عَنْ الْحَسَنِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعْرَضُ النَّاسُ يَوْمَ الْقِيَامَةِ ثَلَاثَ عَرْضَاتٍ فَأَمَّا عَرْضَتَانِ فَجِدَالٌ وَمَعَاذِيرُ وَأَمَّا الْعَرْضَةُ الثَّالِثَةُ فَعِنْدَ ذَلِكَ تَطِيرُ الصُّحُفُ فِي الْأَيْدِي فَآخِذٌ بِيَمِينِهِ وَآخِذٌ بِشِمَالِهِقَالَ أَبُو عِيسَى وَلَا يَصِحُّ هَذَا الْحَدِيثُ مِنْ قِبَلِ أَنَّ الْحَسَنَ لَمْ يَسْمَعْ مِنْ أَبِي هُرَيْرَةَ وَقَدْ رَوَاهُ بَعْضُهُمْ عَنْ عَلِيٍّ الرِّفَاعِيِّ عَنْ الْحَسَنِ عَنْ أَبِي مُوسَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَبُو عِيسَى وَلَا يَصِحُّ هَذَا الْحَدِيثُ مِنْ قِبَلِ أَنَّ الْحَسَنَ لَمْ يَسْمَعْ مِنْ أَبِي مُوسَى",
        "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Waki'] dari ['Ali bin 'Ali] dari [Al Hasan] dari [Abu Hurairah] berkata: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Pada hari kiamat manusia diajukan sebanyak tiga kali, dua kali pengajuan untuk bantahan dan alasan-alasan dan pada pengajuan ketiga, saat itu lembaran-lembaran berterbangan ditangan, ada yang mengambil dengan tangan kanannya dan ada yang mengambil dengan tangan kirinya.\" Berkata Abu Isa: Hadits ini tidak shahih karena Al Hasan tidak mendengar dari Abu Hurairah dan sebagaian dari mereka meriwayatkannya dari ['Ali Ar Rifa'i] dari [Al Hasan] dari [Abu Musa] dari nabi Shallallahu 'alaihi wa Salam. Berkata Abu Isa: Hadits ini tidak shahih karena Al Hasan tidak mendengar dari Abu Musa."
    },
    {
        "number": 2350,
        "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا ابْنُ الْمُبَارَكِ عَنْ عُثْمَانَ بْنِ الْأَسْوَدِ عَنْ ابْنِ أَبِي مُلَيْكَةَ عَنْ عَائِشَةَ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ نُوقِشَ الْحِسَابَ هَلَكَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ اللَّهَ تَعَالَى يَقُولُ{ فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ فَسَوْفَ يُحَاسَبُ حِسَابًا يَسِيرًا }قَالَ ذَلِكَ الْعَرْضُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ حَسَنٌ وَرَوَاهُ أَيُّوبُ أَيْضًا عَنْ ابْنِ أَبِي مُلَيْكَةَ",
        "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Ibnu Al Mubarak] dari ['Utsman bin Al Aswad] dari [Ibnu Abi Malikah] dari ['Aisyah] berkata: Aku mendengar Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Barangsiapa didebat saat penghisaban, ia celaka.\" Aku berkata: Wahai Rasulullah, Allah Ta'ala berfirman: \"Adapun orang yang diberikan kitabnya dari sebelah kanannya, maka dia akan diperiksa dengan pemeriksaan yang mudah.\" (Al-Insyiqaaq: 7-8) Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Itu pengajuan.\" Berkata Abu Isa: Hadits ini shahih hasan, dan [Ayyub] juga meriwayatkannya dari [Ibnu Abi Malikah]."
    },
    {
        "number": 2351,
        "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا ابْنُ الْمُبَارَكِ أَخْبَرَنَا إِسْمَعِيلُ بْنُ مُسْلِمٍ عَنْ الْحَسَنِ وَقَتَادَةَ عَنْ أَنَسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُجَاءُ بِابْنِ آدَمَ يَوْمَ الْقِيَامَةِ كَأَنَّهُ بَذَجٌ فَيُوقَفُ بَيْنَ يَدَيْ اللَّهِ فَيَقُولُ اللَّهُ لَهُ أَعْطَيْتُكَ وَخَوَّلْتُكَ وَأَنْعَمْتُ عَلَيْكَ فَمَاذَا صَنَعْتَ فَيَقُولُ يَا رَبِّ جَمَعْتُهُ وَثَمَّرْتُهُ فَتَرَكْتُهُ أَكْثَرَ مَا كَانَ فَارْجِعْنِي آتِكَ بِهِ فَيَقُولُ لَهُ أَرِنِي مَا قَدَّمْتَ فَيَقُولُ يَا رَبِّ جَمَعْتُهُ وَثَمَّرْتُهُ فَتَرَكْتُهُ أَكْثَرَ مَا كَانَ فَارْجِعْنِي آتِكَ بِهِ كُلِّهِ فَإِذَا عَبْدٌ لَمْ يُقَدِّمْ خَيْرًا فَيُمْضَى بِهِ إِلَى النَّارِقَالَ أَبُو عِيسَى وَقَدَ رَوَى هَذَا الْحَدِيثَ غَيْرُ وَاحِدٍ عَنْ الْحَسَنِ قَوْلَهُ وَلَمْ يُسْنِدُوهُ وَإِسْمَعِيلُ بْنُ مُسْلِمٍ يُضَعَّفُ فِي الْحَدِيثِ مِنْ قِبَلِ حِفْظِهِ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ وَأَبِي سَعِيدٍ الْخُدْرِيِّ",
        "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah menceritakan kepada kami [Ibnu Al Mubarak] telah mengkhabarkan kepada kami [Isma'il bin Muslim] dari [Al Hasan] dan [Qotadah] dari [Anas] dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Pada hari Kiamat anak Adam akan didatangkan seperti anak domba kemudian terhenti di hadapan Allah lalu Allah bertanya kepadanya: Aku telah memberimu, menganugerahkan kepadamu dan memberimu nikmat, lalu apa yang telah kamu lakukan? dia menjawab: Wahai Rabbku, aku telah mengumpulkannya dan mengembangkannya lalu aku tinggalkan menjadi semakin banyak, maka kembalikanlah aku supaya aku bisa membawanya semuanya kepadamu, ternyata hamba ini tidak membawa kebaikan kemudian Allah menyeretnya ke neraka.\" Abu Isa berkata: Banyak perowi yang meriwayatkan hadits ini dari perkataan Al Hasan dan mereka tidak memusnadkannya (tidak menyambungkannya sampai Nabi), adapun Isma'il bin Muslim dia dilemahkan dalam masalah hadits dari sisi hafalannya, dan dalam bab ini ada hadits dari Abu Hurairah dan Abu Sa'id Al Khudri."
    },
    {
        "number": 2352,
        "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الزُّهْرِيُّ الْبَصْرِيُّ حَدَّثَنَا مَالِكُ بْنُ سُعَيْرٍ أَبُو مُحَمَّدٍ التَّمِيمِيُّ الْكُوفِيُّ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ وَعَنْ أَبِي سَعِيدٍ قَالَاقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُؤْتَى بِالْعَبْدِ يَوْمَ الْقِيَامَةِ فَيَقُولُ اللَّهُ لَهُ أَلَمْ أَجْعَلْ لَكَ سَمْعًا وَبَصَرًا وَمَالًا وَوَلَدًا وَسَخَّرْتُ لَكَ الْأَنْعَامَ وَالْحَرْثَ وَتَرَكْتُكَ تَرْأَسُ وَتَرْبَعُ فَكُنْتَ تَظُنُّ أَنَّكَ مُلَاقِي يَوْمَكَ هَذَا قَالَ فَيَقُولُ لَا فَيَقُولُ لَهُ الْيَوْمَ أَنْسَاكَ كَمَا نَسِيتَنِيقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ غَرِيبٌ وَمَعْنَى قَوْلِهِ الْيَوْمَ أَنْسَاكَ يَقُولُ الْيَوْمَ أَتْرُكُكَ فِي الْعَذَابِ هَكَذَا فَسَّرُوهُ قَالَ أَبُو عِيسَى وَقَدْ فَسَّرَ بَعْضُ أَهْلِ الْعِلْمِ هَذِهِ الْآيَةَ{ فَالْيَوْمَ نَنْسَاهُمْ }قَالُوا إِنَّمَا مَعْنَاهُ الْيَوْمَ نَتْرُكُهُمْ فِي الْعَذَابِ",
        "id": "Telah menceritakan kepada kami [Abdullah bin Muhammad Az Zuhri Al Bashri] telah menceritakan kepada kami [Malik bin Syu'air Abu Muhammad At Tamimi Al Kufi] telah menceritakan kepada kami [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dan [Abu Sa'id] keduanya bercerita bahwa Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Pada hari Kiamat seorang hamba akan didatangkan kemudian Allah bertanya kepadanya: Bukankah Aku telah membuatkan pendengaran, penglihatan, harta dan anak untuku, dan Aku telah menundukkan hewan ternak dan tanaman untukmu, Aku telah tingagalkan kamu menjadi pemimpin dan mendapatkan seperempat (harta rampasan), apakah kamu mengira akan menemuiKu saat ini?\" hamba itu menjawab: Tidak. kemudian Allah berfirman kepadanya: Pada hari ini Aku melupakanmu sebagaimana kamu telah melupakanKu.\" Abu Isa berkata: Hadits ini shahih gharib, adapun makna firman Allah \"Pada hari ini Aku melupakanmu, \" dia berkata maksudnya pada hari ini Aku biarkan kamu berada dalam siksaan. Demikianlah para ulama menafsirkan firman tersebut. Abu Isa berkata: Sebagian ahli Ilmu menafsirkan ayat ini \" FAL YAUMA NANSAAHUM (maka pada hari ini (akhirat) kami melupakan mereka) \". (Al A'raaf: 51) mereka berkata: Maknanya adalah pada hari ini Kami biarkan mereka berada dalam siksaan."
    },
    {
        "number": 2353,
        "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ حَدَّثَنَا يَحْيَى بْنُ أَبِي سُلَيْمَانَ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَقَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ{ يَوْمَئِذٍ تُحَدِّثُ أَخْبَارَهَا }قَالَ أَتَدْرُونَ مَا أَخْبَارُهَا قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ فَإِنَّ أَخْبَارَهَا أَنْ تَشْهَدَ عَلَى كُلِّ عَبْدٍ أَوْ أَمَةٍ بِمَا عَمِلَ عَلَى ظَهْرِهَا أَنْ تَقُولَ عَمِلَ كَذَا وَكَذَا يَوْمَ كَذَا وَكَذَا قَالَ فَهَذِهِ أَخْبَارُهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Abdullah bin Al Mubarak] telah mengkhabarkan kepada kami [Sa'id bin Abu Ayyub] telah menceritakan kepada kami [Yahya bin Abu Sulaiman] dari [Sa'id Al Maqbari] dari [Abu Hurairah] berkata: Rasulullah Shallallahu 'alahi wa Salam membaca: \"Pada hari itu bumi menceritakan beritanya.\" (Al-Zalzalah: 4), belia bertanya: \"Tahukah kalian apa berita-beritanya?\" mereka menjawab: Allah dan rasulNya lebih tahu. Beliau bersabda: \"Berita-beritanya adalah perbuatan-perbuatan yang dilakukan oleh hamba lelaki atau perempuan di atas bumi berkata: Ia melakukan ini dan ini, pada hari ini dan ini.\" beliau bersabda: \"Itulah berita-beritanya.\" Berkata Abu Isa: Hadits ini hasan gharib."
    },
    {
        "number": 2354,
        "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا سُلَيْمَانُ التَّيْمِيُّ عَنْ أَسْلَمَ الْعِجْلِيِّ عَنْ بِشْرِ بْنِ شَغَافٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَجَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا الصُّورُ قَالَ قَرْنٌ يُنْفَخُ فِيهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَقَدْ رَوَى غَيْرُ وَاحِدٍ عَنْ سُلَيْمَانَ التَّيْمِيِّ وَلَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِهِ",
        "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami ['Abdulah bin Al Mubarak] telah mengkhabarkan kepada kami [Sulaiman At Taimi] dari [Aslam Al 'Ijli] dari [Bisyr bin Syaghaf] dar [Abdullah bin 'Amru bin Al 'Ash] berkata: Seorang badui mendatangi nabi Shallallahu 'alaihi wa Salam, ia berkata: Apa itu sangkakala? Beliau menjawab: \"Tanduk yang ditiup.\" Berkata Abu Isa: Hadits ini hasan dan beberapa perawi meriwayatkan dari Sulaiman At Taimi, kami hanya mengetahuinya dari hadits Sulaiman."
    },
    {
        "number": 2355,
        "arab": "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا أَبُو الْعَلَاءِ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ أَنْعَمُ وَصَاحِبُ الْقَرْنِ قَدْ الْتَقَمَ الْقَرْنَ وَاسْتَمَعَ الْإِذْنَ مَتَى يُؤْمَرُ بِالنَّفْخِ فَيَنْفُخُ فَكَأَنَّ ذَلِكَ ثَقُلَ عَلَى أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَهُمْ قُولُوا حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ عَلَى اللَّهِ تَوَكَّلْنَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ هَذَا الْحَدِيثُ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
        "id": "Telah menceritakan kepada kami [Suwaid] telah mengkhabarkan kepada kami [Abdullah] telah mengkhabarkan kepada kami [Abu Al 'Alla`] dari ['Athiyah] dari [Abu Sa'id] berkata: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Bagaimana aku bersenang-senang sementara malaikat peniup sangkakala telah menelan tanduk (terompet) dan mendengar izin kapankan diperintahkan untuk meniup lalu ia akan meniup.\" Sepertinya hal itu terasa berat oleh para sahabat nabi Shallallahu 'alaihi wa Salam lalu beliau bersabda kepada mereka: \"Ucapkan: HASBUNALLAAH WA NI'MAL WAKILL 'ALALLAAHI TAWAKKALNAA.\" Berkata Abu Isa: Hadits ini hasan dan hadits ini diriwayatkan melalui beberapa sanad dari 'Athiyah dari Abu Sa'id Al Khudri dari nabi Shallallahu 'alaihi wa Salam sepertinya."
    },
    {
        "number": 2356,
        "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ عَنْ النُّعْمَانِ بْنِ سَعْدٍ عَنْ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شِعَارُ الْمُؤْمِنِ عَلَى الصِّرَاطِ رَبِّ سَلِّمْ سَلِّمْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ الْمُغِيرَةِ بْنِ شُعْبَةَ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ",
        "id": "Telah menceritakan kepada kami ['Ali bin Hujr] telah menceritakan kepada kami ['Ali bin Mushir] dari [Abdurrahman bin Ishaq] dari [An Nu'man bin Sa'ad] dari [Al Mughirah bin Syu'bah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Syi'arnya orang mukmin pada saat di atas shirath (jembatan penyeberangan) adalah: Wahai Rabb selamatkanlah, selamatkanlah.\" Abu Isa berkata: Hadits ini gharib dari hadits Al Mughirah bin Syu'bah, kami tidak mengetahuinya kecuali dari hadits Abdurrahman bin Ishaq, dan dalam bab ini ada hadits dari Abu Hurairah."
    },
    {
        "number": 2357,
        "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ الْهَاشِمِيُّ حَدَّثَنَا بَدَلُ بْنُ الْمُحَبَّرِ حَدَّثَنَا حَرْبُ بْنُ مَيْمُونٍ الْأَنْصَارِيُّ أَبُو الْخَطَّابِ حَدَّثَنَا النَّضْرُ بْنُ أَنَسِ بْنِ مَالِكٍ عَنْ أَبِيهِ قَالَسَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَشْفَعَ لِي يَوْمَ الْقِيَامَةِ فَقَالَ أَنَا فَاعِلٌ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ فَأَيْنَ أَطْلُبُكَ قَالَ اطْلُبْنِي أَوَّلَ مَا تَطْلُبُنِي عَلَى الصِّرَاطِ قَالَ قُلْتُ فَإِنْ لَمْ أَلْقَكَ عَلَى الصِّرَاطِ قَالَ فَاطْلُبْنِي عِنْدَ الْمِيزَانِ قُلْتُ فَإِنْ لَمْ أَلْقَكَ عِنْدَ الْمِيزَانِ قَالَ فَاطْلُبْنِي عِنْدَ الْحَوْضِ فَإِنِّي لَا أُخْطِئُ هَذِهِ الثَّلَاثَ الْمَوَاطِنَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ",
        "id": "Telah menceritakan kepada kami [Abdullah bin Ash Shabbah Al Hasyimi] telah menceritakan kepada kami [Badal bin Al Muhabbir] telah menceritakan kepada kami [Harb bin Maimun Al Anshari Abu Al Khaththab] telah menceritakan kepada kami [An Nadlr bin Anas bin Malik] dari [ayahnya] berkata: Aku meminta nabi Shallallahu 'alaihi wa Salam agar memberiku syafaat pada hari kiamat, beliau bersabda: \"Aku akan melakukannya.\" Ia bertanya: Wahai Rasulullah, ke mana aku mencari baginda? Beliau menjawab: \"Carilah aku pada saat pertama kali kau mencari di atas shirath.\" Ia bertanya: Bila aku tidak bertemu dengan baginda di atas shirath? Beliau menjawab: \"Carilah aku di dekat mizan.\" Ia bertanya: Bila aku tidak bertemu dengan baginda di dekat mizan? Beliau menjawab: \"Carilah aku di dekat telaga, karena aku tidak luput dari tiga tempat itu.\" Berkata Abu Isa: Hadits ini hasan gharib, kami hanya mengetahuinya melalui jalur sanad ini."
    },
    {
        "number": 2358,
        "arab": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا أَبُو حَيَّانَ التَّيْمِيُّ عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ عَنْ أَبِي هُرَيْرَةَ قَالَأُتِيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِلَحْمٍ فَرُفِعَ إِلَيْهِ الذِّرَاعُ فَأَكَلَهُ وَكَانَتْ تُعْجِبُهُ فَنَهَسَ مِنْهَا نَهْسَةً ثُمَّ قَالَ أَنَا سَيِّدُ النَّاسِ يَوْمَ الْقِيَامَةِ هَلْ تَدْرُونَ لِمَ ذَاكَ يَجْمَعُ اللَّهُ النَّاسَ الْأَوَّلِينَ وَالْآخِرِينَ فِي صَعِيدٍ وَاحِدٍ فَيُسْمِعُهُمْ الدَّاعِي وَيَنْفُذُهُمْ الْبَصَرُ وَتَدْنُو الشَّمْسُ مِنْهُمْ فَبَلَغَ النَّاسُ مِنْ الْغَمِّ وَالْكَرْبِ مَا لَا يُطِيقُونَ وَلَا يَحْتَمِلُونَ فَيَقُولُ النَّاسُ بَعْضُهُمْ لِبَعْضٍ أَلَا تَرَوْنَ مَا قَدْ بَلَغَكُمْ أَلَا تَنْظُرُونَ مَنْ يَشْفَعُ لَكُمْ إِلَى رَبِّكُمْ فَيَقُولُ النَّاسُ بَعْضُهُمْ لِبَعْضٍ عَلَيْكُمْ بِآدَمَ فَيَأْتُونَ آدَمَ فَيَقُولُونَ أَنْتَ أَبُو الْبَشَرِ خَلَقَكَ اللَّهُ بِيَدِهِ وَنَفَخَ فِيكَ مِنْ رُوحِهِ وَأَمَرَ الْمَلَائِكَةَ فَسَجَدُوا لَكَ اشْفَعْ لَنَا إِلَى رَبِّكَ أَلَا تَرَى مَا نَحْنُ فِيهِ أَلَا تَرَى مَا قَدْ بَلَغَنَا فَيَقُولُ لَهُمْ آدَمُ إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ وَإِنَّهُ قَدْ نَهَانِي عَنْ الشَّجَرَةِ فَعَصَيْتُ نَفْسِي نَفْسِي نَفْسِي اذْهَبُوا إِلَى غَيْرِي اذْهَبُوا إِلَى نُوحٍ فَيَأْتُونَ نُوحًا فَيَقُولُونَ يَا نُوحُ أَنْتَ أَوَّلُ الرُّسُلِ إِلَى أَهْلِ الْأَرْضِ وَقَدْ سَمَّاكَ اللَّهُ عَبْدًا شَكُورًا اشْفَعْ لَنَا إِلَى رَبِّكَ أَلَا تَرَى إِلَى مَا نَحْنُ فِيهِ أَلَا تَرَى مَا قَدْ بَلَغَنَا فَيَقُولُ لَهُمْ نُوحٌ إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ وَإِنَّهُ قَدْ كَانَ لِي دَعْوَةٌ دَعَوْتُهَا عَلَى قَوْمِي نَفْسِي نَفْسِي نَفْسِي اذْهَبُوا إِلَى غَيْرِي اذْهَبُوا إِلَى إِبْرَاهِيمَ فَيَأْتُونَ إِبْرَاهِيمَ فَيَقُولُونَ يَا إِبْرَاهِيمُ أَنْتَ نَبِيُّ اللَّهِ وَخَلِيلُهُ مِنْ أَهْلِ الْأَرْضِ اشْفَعْ لَنَا إِلَى رَبِّكَ أَلَا تَرَى مَا نَحْنُ فِيهِ فَيَقُولُ إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ وَإِنِّي قَدْ كَذَبْتُ ثَلَاثَ كَذِبَاتٍ فَذَكَرَهُنَّ أَبُو حَيَّانَ فِي الْحَدِيثِ نَفْسِي نَفْسِي نَفْسِي اذْهَبُوا إِلَى غَيْرِي اذْهَبُوا إِلَى مُوسَى فَيَأْتُونَ مُوسَى فَيَقُولُونَ يَا مُوسَى أَنْتَ رَسُولُ اللَّهِ فَضَّلَكَ اللَّهُ بِرِسَالَتِهِ وَبِكَلَامِهِ عَلَى الْبَشَرِ اشْفَعْ لَنَا إِلَى رَبِّكَ أَلَا تَرَى مَا نَحْنُ فِيهِ فَيَقُولُ إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ وَإِنِّي قَدْ قَتَلْتُ نَفْسًا لَمْ أُومَرْ بِقَتْلِهَا نَفْسِي نَفْسِي نَفْسِي اذْهَبُوا إِلَى غَيْرِي اذْهَبُوا إِلَى عِيسَى فَيَأْتُونَ عِيسَى فَيَقُولُونَ يَا عِيسَى أَنْتَ رَسُولُ اللَّهِ وَكَلِمَتُهُ أَلْقَاهَا إِلَى مَرْيَمَ وَرُوحٌ مِنْهُ وَكَلَّمْتَ النَّاسَ فِي الْمَهْدِ اشْفَعْ لَنَا إِلَى رَبِّكَ أَلَا تَرَى مَا نَحْنُ فِيهِ فَيَقُولُ عِيسَى إِنَّ رَبِّي قَدْ غَضِبَ الْيَوْمَ غَضَبًا لَمْ يَغْضَبْ قَبْلَهُ مِثْلَهُ وَلَنْ يَغْضَبَ بَعْدَهُ مِثْلَهُ وَلَمْ يَذْكُرْ ذَنْبًا نَفْسِي نَفْسِي نَفْسِي اذْهَبُوا إِلَى غَيْرِي اذْهَبُوا إِلَى مُحَمَّدٍ قَالَ فَيَأْتُونَ مُحَمَّدًا فَيَقُولُونَ يَا مُحَمَّدُ أَنْتَ رَسُولُ اللَّهِ وَخَاتَمُ الْأَنْبِيَاءِ وَقَدْ غُفِرَ لَكَ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ اشْفَعْ لَنَا إِلَى رَبِّكَ أَلَا تَرَى مَا نَحْنُ فِيهِ فَأَنْطَلِقُ فَآتِي تَحْتَ الْعَرْشِ فَأَخِرُّ سَاجِدًا لِرَبِّي ثُمَّ يَفْتَحُ اللَّهُ عَلَيَّ مِنْ مَحَامِدِهِ وَحُسْنِ الثَّنَاءِ عَلَيْهِ شَيْئًا لَمْ يَفْتَحْهُ عَلَى أَحَدٍ قَبْلِي ثُمَّ يُقَالَ يَا مُحَمَّدُ ارْفَعْ رَأْسَكَ سَلْ تُعْطَهْ وَاشْفَعْ تُشَفَّعْ فَأَرْفَعُ رَأْسِي فَأَقُولُ يَا رَبِّ أُمَّتِي يَا رَبِّ أُمَّتِي يَا رَبِّ أُمَّتِي فَيَقُولُ يَا مُحَمَّدُ أَدْخِلْ مِنْ أُمَّتِكَ مَنْ لَا حِسَابَ عَلَيْهِ مِنْ الْبَابِ الْأَيْمَنِ مِنْ أَبْوَابِ الْجَنَّةِ وَهُمْ شُرَكَاءُ النَّاسِ فِيمَا سِوَى ذَلِكَ مِنْ الْأَبْوَابِ ثُمَّ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ مَا بَيْنَ الْمِصْرَاعَيْنِ مِنْ مَصَارِيعِ الْجَنَّةِ كَمَا بَيْنَ مَكَّةَ وَهَجَرَ وَكَمَا بَيْنَ مَكَّةَ وَبُصْرَىوَفِي الْبَاب عَنْ أَبِي بَكْرٍ الصِّدِّيقِ وَأَنَسٍ وَعُقْبَةَ بْنِ عَامِرٍ وَأَبِي سَعِيدٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَأَبُو حَيَّانَ التَّيْمِيُّ اسْمُهُ يَحْيَى بْنُ سَعِيدِ بْنِ حَيَّانَ كُوفِيٌّ وَهُوَ ثِقَةٌ وَأَبُو زُرْعَةَ بْنُ عَمْرِو بْنِ جَرِيرٍ اسْمُهُ هَرِمٌ",
        "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Abdullah bin Al Mubarak] telah mengkhabarkan kepada kami [Abu Hayyan At Taimi] dari [Abu Zur'ah bin 'Amru bin Jarir] dari [Abu Hurairah] berkata: Rasulullah Shallallahu 'alahi wa Salam diberi daging lalu lengan diangkat pada belia, beliau memakannya dan lengan itu membuat beliau senang, beliau lalu menggigitnya, setelah itu beliau bersabda: \"Aku pemimpin manusia pada hari kiamat, tahukah kalian kenapa? Allah mengumpulkan semua manusia dari yang pertama hingga yang akhir dalam satu tanah lapang, penyeru memperdengarkan mereka, pandangan menembus mereka dan matahari mendekat, duka dan kesusahan manusia sampai pada batas yang tidak mereka mampu dan tidak mampu mereka pikul. Orang-orang saling berkata satu sama lain: Apa kalian tidak melihat yang telah menimpa kalian, apakah kalian tidak melihat siapa yang memberi kalian syafaat kepada Rabb kalian. Orang-orang saling berkata satu sama lain: Hendaklah kalian menemui Adam. Mereka menemui Adam lalu berkata: Engkau adalah nenek moyang manusia, Allah menciptakanmu dengan tanganNya, meniupkan ruhnya padamu dan memerintahkan para malaikat lalu mereka sujud padamu, berilah kami syafaat kepada Rabbmu, apa kau tidak lihat kondisi kami, apa kau tidak melihat yang menimpa kami? Adam berkata kepada mereka: Rabbku saat ini benar-benar marah, Ia tidak pernah marah seperti itu sebelumnya dan tidak akan pernah seperti itu sesudahnya, dulu Ia melarangku mendekati pohon tapi aku durhaka, diriku, diriku, diriku. Pergilah pada selainku, pergilah ke Nuh. Mereka mendatangi Nuh lalu berkata: Hai Nuh, engkau adalah rasul pertama untuk penduduk bumi, Allah menyebutmu hamba yang sangat bersyukur, berilah kami syafaat kepada Rabbmu, apa kau tidak lihat kondisi kami, apa kau tidak melihat yang menimpa kami? Nuh berkata kepada mereka: Rabbku saat ini benar-benar marah, Ia tidak pernah marah seperti itu sebelumnya dan tidak akan pernah seperti itu sesudahnya, dulu aku pernah berdoa keburukan untuk kaumku, diriku, diriku, diriku, pergilah kepada selainku, pergilah ke Ibrahim. Mereka mendatangi Ibrahim lalu berkata: Wahai Ibrahim, engkau nabi Allah dan kekasihNya dari penduduk bumi, berilah kami syafaat kepada Rabbmu, apa kau tidak lihat kondisi kami, apa kau tidak melihat yang menimpa kami? Nuh berkata kepada mereka: Rabbku saat ini benar-benar marah, Ia tidak pernah marah seperti itu sebelumnya dan tidak akan pernah seperti itu sesudahnya, dulu aku pernah bedusta tiga kali -Abu Hayyan menyebut ketiga-tiganya dalam hadits ini- diriku, diriku, diriku, pergilah kepada selainku, pergilah ke Musa. Mereka menemui Musa lalu berkata: Wahai Musa, engkau utusan Allah, Allah melebihkanmu dengan risalah dan kalamNya atas seluruh manusia, berilah kami syafaat kepada Rabbmu, apa kau tidak lihat kondisi kami, apa kau tidak melihat yang menimpa kami? Musa berkata kepada mereka: Rabbku saat ini benar-benar marah, Ia tidak pernah marah seperti itu sebelumnya dan tidak akan pernah seperti itu sesudahnya, dulu aku pernah membunuh jiwa padahal aku tidak diperintahkan untuk membunuhnya, diriku, diriku, diriku, pergilah kepada selainku, pergilah ke 'Isa. Mereka mendatangi 'Isa lalu berkata: Hai 'Isa, engkau adalah utusan Allah, kalimatNya yang disampaikan ke maryam, ruh dariNya, engkau berbicara pada manusia saat masih berada dalam buaian, berilah kami syafaat kepada Rabbmu, apa kau tidak lihat kondisi kami, apa kau tidak melihat yang menimpa kami? Isa berkata kepada mereka: Rabbku saat ini benar-benar marah, Ia tidak pernah marah seperti itu sebelumnya dan tidak akan pernah seperti itu sesudahnya, ia tidak menyebut dosa, diriku, diriku, diriku, pergilah ke selainku, pergilah ke Muhammad. Mereka mendatangi Muhammad lalu berkata: Wahai Muhammad, engkau adalah utusan Allah, penutup para nabi, dosamu yang telah lau dan yang kemudian telah diampuni, berilah kami syafaat kepada Rabbmu, apa kau tidak lihat kondisi kami. Lalu aku pergi hingga sampai di bawah 'arsy, aku tersungkur sujud pada Rabbku lalu Allah memulai dengan pujian dan sanjungan untukku yang belum pernah disampaikan pada seorang pun sebelumku, lalu ada suara: Hai Muhammad, angkatlah kepalamu, mintalah pasti kau diberi, berilah syafaat nicaya kau diizinkan untuk memberi syafaat. Lalu aku mengangkat kepalaku, aku berkata: Wahai Rabb, ummatku, wahai Rabb, ummatku, wahai Rabb, ummatku. Ia berkata: Hai Muhammad, masukkan orang yang tidak dihisab dari ummatmu melalui pintu-pintu surga sebelah kanan dan mereka adalah sekutu semua manusia selain pintu-pintu itu.\" Setelah itu beliau bersabda: \"Demi Dzat yang jiwaku berada ditanganNya, jarak antara dua daun pintu-pintu surga seperti jarak antara Makakah dan Hajar dan seperti jarak antara Makkah dan Bashrah.\" Dalam hal ini ada hadits serupa dari Abu Bakar Ash Shiddiq, Anas, 'Uqbah bin 'Amir, Abu Sa'id. Berkata Abu Isa: Hadits ini hasan shahih dan nama Abu Hayyan At Taimi adalah Yahya bin Sa'id bin Hayyan, orang kufi, terpercaya, dan nama Abu Zur'ah bin 'Amru bin Jarir adalah Harim."
    },
    {
        "number": 2359,
        "arab": "حَدَّثَنَا الْعَبَّاسُ الْعَنْبَرِيُّ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَفَاعَتِي لِأَهْلِ الْكَبَائِرِ مِنْ أُمَّتِيقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَفِي الْبَاب عَنْ جَابِرٍ",
        "id": "Telah menceritakan kepada kami [Al 'Abbas Al 'Ambari] telah menceritakan kepada kami ['Abdur Razzaq] dari [Ma'mar] dari [Tsabit] dari [Anas] berkata: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Syafaatku untuk pemilik dosa-dosa besar dari ummatku.\" Berkata Abu Isa: Hadits ini hasan shahih gharib melalui sanad ini dan dalam hal ini ada hadits serupa dari Jabir."
    },
    {
        "number": 2360,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ عَنْ مُحَمَّدِ بْنِ ثَابِتٍ الْبُنَانِيِّ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَفَاعَتِي لِأَهْلِ الْكَبَائِرِ مِنْ أُمَّتِيقَالَ مُحَمَّدُ بْنُ عَلِيٍّ فَقَالَ لِي جَابِرٌ يَا مُحَمَّدُ مَنْ لَمْ يَكُنْ مِنْ أَهْلِ الْكَبَائِرِ فَمَا لَهُ وَلِلشَّفَاعَةِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ يُسْتَغْرَبُ مِنْ حَدِيثِ جَعْفَرِ بْنِ مُحَمَّدٍ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abu Daud Ath Thayalisi] dari [Muhammad bin Tsabit Al Bunani] dari [Ja'far bin Muhammad] dari [bapaknya] dari [Jabir bin Abdullah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Syafa'atku untuk ummatku yang berbuat dosa dosa besar.\" Muhammad bin Ali berkata: kemudian Jabir berkata kepadaku: Wahai Muhammad orang yang tidak melakukan dosa besar tidak lagi membutuhkan syafa'at. Abu Isa berkata: Hadits ini hasan gharib dari jalur sanad ini, dan dianggap gharib dari hadits Ja'far bin Muhammad."
    },
    {
        "number": 2361,
        "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَرَفَةَ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ مُحَمَّدِ بْنِ زِيَادٍ الْأَلْهَانِيِّ قَال سَمِعْتُ أَبَا أُمَامَةَ يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ وَعَدَنِي رَبِّي أَنْ يُدْخِلَ الْجَنَّةَ مِنْ أُمَّتِي سَبْعِينَ أَلْفًا لَا حِسَابَ عَلَيْهِمْ وَلَا عَذَابَ مَعَ كُلِّ أَلْفٍ سَبْعُونَ أَلْفًا وَثَلَاثُ حَثَيَاتٍ مِنْ حَثَيَاتِهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami [Al Hasan bin 'Arafah] telah menceritakan kepada kami [Isma'il bin 'Ayyasy] dari [Muhammad bin Ziyad Al Alhani] berkata: Aku mendengar [Abu Umamah] berkata: Aku mendengar Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Rabbku berjanji padaku untuk memasukkan tujuhpuluh ribu orang dari ummatku tanpa hisab dan adzab, setiap seribunya bersama tujuhpuluh ribu dan tiga tangkup (mengambil dengan dua telapak tangan) dari tangkupan (tangan) Nya.\" Berkata Abu Isa: Hadits ini hasan gharib."
    },
    {
        "number": 2362,
        "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ خَالِدٍ الْحَذَّاءِ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ قَالَكُنْتُ مَعَ رَهْطٍ بِإِيلِيَاءَ فَقَالَ رَجُلٌ مِنْهُمْ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَدْخُلُ الْجَنَّةَ بِشَفَاعَةِ رَجُلٍ مِنْ أُمَّتِي أَكْثَرُ مِنْ بَنِي تَمِيمٍ قِيلَ يَا رَسُولَ اللَّهِ سِوَاكَ قَالَ سِوَايَ فَلَمَّا قَامَ قُلْتُ مَنْ هَذَا قَالُوا هَذَا ابْنُ أَبِي الْجَذْعَاءِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ وَابْنُ أَبِي الْجَذْعَاءِ هُوَ عَبْدُ اللَّهِ وَإِنَّمَا يُعْرَفُ لَهُ هَذَا الْحَدِيثُ الْوَاحِدُ",
        "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Isma'il bin Ibrahim] dari [Khalid Al Hadzdza`] dari [Abdullah bin Syaqiq] berkata: Aku pernah bersama serombongan orang di Iliya`, seseorang dari mereka berkata: Aku mendengar Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Akan masuk surga karena syafaat seseorang dari ummatku lebih banyak dari Bani Tamim.\" Dikatakan: Wahai Rasulullah, selain baginda? Beliau menjawab: \"Selain aku.\" Saat ia berdiri, aku bertanya: Siapa dia? Mereka menjawab: Dia [Ibnu Abi Al Jadz 'Abdullah']. Berkata Abu Isa: Hadits ini hasan shahih gharib dan Ibnu Abi Al Jadz'a` adalah Abdullah, hanya satu hadits ini saja yang dikenal miliknya."
    },
    {
        "number": 2363,
        "arab": "حَدَّثَنَا أَبُو هِشَامٍ الرِّفَاعِيُّ الْكُوفِيُّ قَالَ حَدَّثَنَا يَحْيَى بْنُ الْيَمَانِ عَنْ جِسْرٍ أَبِي جَعْفَرٍ عَنْ الْحَسَنِ الْبَصْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَشْفَعُ عُثْمَانُ بْنُ عَفَّانَ رَضِيَ اللَّهُ عَنْهُ يَوْمَ الْقِيَامَةِ بِمِثْلِ رَبِيعَةَ وَمُضَرَ",
        "id": "Telah menceritakan kepada kami [Abu Hisyam Ar Rifa'I Al Kufi] berkata: telah menceritakan kepada kami [Yahya bin Al Yaman] dari [Jisr Abu Ja'far] dari [Al Hasan Al Bashri] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"'Utsman bin 'Affan radliallahu 'anhu pada hari Kiamat memberikan syafa'at untuk seperti kabilah Rabi'ah dan Mudlar.\""
    },
    {
        "number": 2364,
        "arab": "حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى عَنْ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ مِنْ أُمَّتِي مَنْ يَشْفَعُ لِلْفِئَامِ مِنْ النَّاسِ وَمِنْهُمْ مَنْ يَشْفَعُ لِلْقَبِيلَةِ وَمِنْهُمْ مَنْ يَشْفَعُ لِلْعَصَبَةِ وَمِنْهُمْ مَنْ يَشْفَعُ لِلرَّجُلِ حَتَّى يَدْخُلُوا الْجَنَّةَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ",
        "id": "Telah menceritakan kepada kami [Abu 'Ammar Al Husain bin Huraits] telah mengkhabarkan kepada kami [Al Fadll bin Musa] dari [Zakariya bin Abu Za`idah] dari ['Athiyah] dari [Abu Sa'id] Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Sesungguhnya diantara ummatku ada yang memberi syafaat kepada sekelompok orang, ada yang memberi syafaat untuk sekabilah, ada yang memberi syafaat untuk segolongan dan ada yang memberi syafaat untuk seseorang hingga mereka masuk surga.\" Berkata Abu Isa: Hadits ini hasan. "
    },
    {
        "number": 2365,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا عَبْدَةُ عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ أَبِي الْمَلِيحِ عَنْ عَوْفِ بْنِ مَالِكٍ الْأَشْجَعِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَانِي آتٍ مِنْ عِنْدِ رَبِّي فَخَيَّرَنِي بَيْنَ أَنْ يُدْخِلَ نِصْفَ أُمَّتِي الْجَنَّةَ وَبَيْنَ الشَّفَاعَةِ فَاخْتَرْتُ الشَّفَاعَةَ وَهِيَ لِمَنْ مَاتَ لَا يُشْرِكُ بِاللَّهِ شَيْئًاوَقَدْ رُوِيَ عَنْ أَبِي الْمَلِيحِ عَنْ رَجُلٍ آخَرَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَذْكُرْ عَنْ عَوْفِ بْنِ مَالِكٍ وَفِي الْحَدِيثِ قِصَّةٌ طَوِيلَةٌ حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَبِي الْمَلِيحِ عَنْ عَوْفِ بْنِ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
        "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami ['Abdah] dari [Sa'id] dari [Qatadah] dari [Abu Al Malih] dari ['Auf bin Malik Al Asyja'i] berkata: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Ada yang mendatangiku dari Rabbku lalu memberiku pilihan antara separuh dari ummatku masuk surga atau syafaat lalu aku memilih syafaat, syafaat tersebut untuk orang yang meninggal tanpa menyekutukan Allah dengan apa pun.\" Diriwayatkan dari Abu Al Malih dari seorang sahabat nabi Shallallahu 'alaihi wa Salam lain dari nabi Shallallahu 'alaihi wa Salam, ia tidak menyebutkan: Dari 'Auf bin Malik. Dan dalam hadits ini ada kisah panjang. Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abu 'Awanah] dari [Qaadah] dari [Abu Al Malih] dari ['Auf bin Malik] dari nabi Shallallahu 'alaihi wa Salam sepertinya."
    },
    {
        "number": 2366,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى حَدَّثَنَا بِشْرُ بْنُ شُعَيْبِ بْنِ أَبِي حَمْزَةَ حَدَّثَنِي أَبِي عَنْ الزُّهْرِيِّ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي حَوْضِي مِنْ الْأَبَارِيقِ بِعَدَدِ نُجُومِ السَّمَاءِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] telah menceritakan kepada kami [Bisyr bin Syu'aib bin Abu Hamzah] telah menceritakan kepadaku [ayahku] dari [Az Zuhri] dari [Anas bin Malik], Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Sesungguhnya gelas-gelas di telagaku sejumlah bintang-bintang di langit.\" Berkata Abu Isa: Hadits ini hasan shahih gharib dari jalur sanad ini."
    },
    {
        "number": 2367,
        "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ نِيْزَكَ الْبَغْدَادِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارٍ الدِّمَشْقِيُّ حَدَّثَنَا سَعِيدُ بْنُ بَشِيرٍ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ لِكُلِّ نَبِيٍّ حَوْضًا وَإِنَّهُمْ يَتَبَاهَوْنَ أَيُّهُمْ أَكْثَرُ وَارِدَةً وَإِنِّي أَرْجُو أَنْ أَكُونَ أَكْثَرَهُمْ وَارِدَةًقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَقَدْ رَوَى الْأَشْعَثُ بْنُ عَبْدِ الْمَلِكِ هَذَا الْحَدِيثَ عَنْ الْحَسَنِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا وَلَمْ يَذْكُرْ فِيهِ عَنْ سَمُرَةَ وَهُوَ أَصَحُّ",
        "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad bin Nizak Al Baghdadi] telah menceritakan kepada kami [Muhammad bin Bakkar Ad Dimasyqi] telah menceritakan kepada kami [Sa'id bin Basyir] dari [Qatadah] dari [Al Hasan] dari [Samrah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya tiap tiap nabi itu memiliki telaga, dan sesungguhnya mereka saling membangga-banggakan telaga siapakah di antara mereka yang paling banyak pengunjungnya, dan sesungguhnya aku berharap menjadi orang yang paling banyak pengunjungnya.\" Abu Isa berkata: Hadits ini gharib, [Al Asy'ats bin Abdul Malik] telah meriwayatkan hadits ini dari [Al Hasan] dari Nabi Shallallahu 'alaihi wa Salam secara mursal dan di dalamnya tidak menyebutkan: Dari Samuroh dan inilah yang lebih shahih.\""
    },
    {
        "number": 2368,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ حَدَّثَنَا مُحَمَّدُ بْنُ الْمُهَاجِرِ عَنْ الْعَبَّاسِ عَنْ أَبِي سَلَّامٍ الْحَبَشِيِّ قَالَبَعَثَ إِلَيَّ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ فَحُمِلْتُ عَلَى الْبَرِيدِ قَالَ فَلَمَّا دَخَلَ عَلَيْهِ قَالَ يَا أَمِيرَ الْمُؤْمِنِينَ لَقَدْ شَقَّ عَلَى مَرْكَبِي الْبَرِيدُ فَقَالَ يَا أَبَا سَلَّامٍ مَا أَرَدْتُ أَنْ أَشُقَّ عَلَيْكَ وَلَكِنْ بَلَغَنِي عَنْكَ حَدِيثٌ تُحَدِّثُهُ عَنْ ثَوْبَانَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَوْضِ فَأَحْبَبْتُ أَنْ تُشَافِهَنِي بِهِ قَالَ أَبُو سَلَّامٍ حَدَّثَنِي ثَوْبَانُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حَوْضِي مِنْ عَدَنَ إِلَى عَمَّانَ الْبَلْقَاءِ مَاؤُهُ أَشَدُّ بَيَاضًا مِنْ اللَّبَنِ وَأَحْلَى مِنْ الْعَسَلِ وَأَكَاوِيبُهُ عَدَدُ نُجُومِ السَّمَاءِ مَنْ شَرِبَ مِنْهُ شَرْبَةً لَمْ يَظْمَأْ بَعْدَهَا أَبَدًا أَوَّلُ النَّاسِ وُرُودًا عَلَيْهِ فُقَرَاءُ الْمُهَاجِرِينَ الشُّعْثُ رُءُوسًا الدُّنْسُ ثِيَابًا الَّذِينَ لَا يَنْكِحُونَ الْمُتَنَعِّمَاتِ وَلَا تُفْتَحُ لَهُمْ السُّدَدُقَالَ عُمَرُ لَكِنِّي نَكَحْتُ الْمُتَنَعِّمَاتِ وَفُتِحَ لِيَ السُّدَدُ وَنَكَحْتُ فَاطِمَةَ بِنْتَ عَبْدِ الْمَلِكِ لَا جَرَمَ أَنِّي لَا أَغْسِلُ رَأْسِي حَتَّى يَشْعَثَ وَلَا أَغْسِلُ ثَوْبِي الَّذِي يَلِي جَسَدِي حَتَّى يَتَّسِخَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ مَعْدَانَ بْنِ أَبِي طَلْحَةَ عَنْ ثَوْبَانَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو سَلَّامٍ الْحَبَشِيُّ اسْمُهُ مَمْطُورٌ وَهُوَ شَامِيٌّ ثِقَةٌ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Isma'il] telah menceritakan kepada kami [Yahya bin Shalih] telah menceritakan kepada kami [Muhammad bin Al Muhajir] dari [Al 'Abbas] dari [Abu Sallam Al Habasyi] berkata: Umar bin Abdul Aziz mengutusku untuk menjadi tukang antar surat, Abu sallam berkata: Ketika masuk dia berkata: Wahai Amirul mukminin kendaraanku telah keberatan untuk dijadikan transportsi surat menyurat. lalu Umar bin Abdul aziz berkata: Wahai Abu Sallam, aku tidak ingin memberatkanmu akan tetapi karena telah sampai kepadaku hadits yang diriwayatkan olehmu yang kamu ceritakan dari [Tsauban] dari Nabi Shallallahu 'alaihi wa Salam dalam masalah telaga, maka aku ingin bertatap muka denganmu dalam masalah ini, Abu Sallam berkata: Tsauban telah menceritakan kepadaku dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Luasnya telagaku adalah seluas antara Aden sampai Oman Al Balqa', airnya lebih putih dari air susu, lebih manis dari madu dan cangkir-cangkirnya sebanyak bilangan bintang di langit, barangsiapa yang minum satu tegukan air darinya niscaya setelah itu tidak akan merasa haus selamanya, orang yang pertama kali akan mengunjunginya adalah orang orang fakir dari sahabat muhajirin, yang rambut kepalanya acak acakan, pakaiannya kumal dan mereka mereka yang tidak menikahi wanita wanita yang hidup dalam kemewahan, dan orang yang tidak dibukakan pintu (apabila bertamu atau mengetuk pintu rumah orang).\" Umar berkata: Akan tetapi aku telah menikahi seorang wanita yang hidup dalam kemewahan, pintu-pintu rumah juga dibukakan bagiku, dan aku telah menikahi Fathimah binti 'Abdul Malik, tidak ada salahnya aku tidak membasuh kepalaku hingga menjadi acak acakan, aku tidak mencuci pakaian yang ada di tubuhku sampai menjadi kumal.\" Abu Isa berkata: Hadits ini gharib dari jalur sanad ini, hadits ini telah diriwayatkan dari [Ma'dan bin Abu Thalhah] dari [Tsauban] dari Nabi Shallallahu 'alaihi wa Salam, adapun Abu sallam Al Habasyi namanya adalah Mamthur dan dia adalah orang Syam yang tsiqah.\""
    },
    {
        "number": 2369,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَبْدِ الصَّمَدِ الْعَمِّيُّ عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ عَنْ أَبِي ذَرٍّ قَالَقُلْتُ يَا رَسُولَ اللَّهِ مَا آنِيَةُ الْحَوْضِ قَالَ وَالَّذِي نَفْسِي بِيَدِهِ لَآنِيَتُهُ أَكْثَرُ مِنْ عَدَدِ نُجُومِ السَّمَاءِ وَكَوَاكِبِهَا فِي لَيْلَةٍ مُظْلِمَةٍ مُصْحِيَةٍ مِنْ آنِيَةِ الْجَنَّةِ مَنْ شَرِبَ مِنْهَا شَرْبَةً لَمْ يَظْمَأْ آخِرَ مَا عَلَيْهِ عَرْضُهُ مِثْلُ طُولِهِ مَا بَيْنَ عُمَانَ إِلَى أَيْلَةَ مَاؤُهُ أَشَدُّ بَيَاضًا مِنْ اللَّبَنِ وَأَحْلَى مِنْ الْعَسَلِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ وَفِي الْبَاب عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَأَبِي بَرْزَةَ الْأَسْلَمِيِّ وَابْنِ عُمَرَ وَحَارِثَةَ بْنِ وَهْبٍ وَالْمُسْتَوْرِدِ بْنِ شَدَّادٍ وَرُوِي عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حَوْضِي كَمَا بَيْنَ الْكُوفَةِ إِلَى الْحَجَرِ الْأَسْوَدِ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abu 'Abdush Shamad Al 'Ammi Abdul Aziz bin 'Abdush Shamad] telah menceritakan kepada kami [Abu 'Imran Al Juwaini] dari [Abdullah bin Ash Shamit] dari [Abu Dzarr] berkata: Aku bertanya: Wahai Rasulullah, telaga itu bejananya apa? Beliau menjawab: Demi Dzat yang jiwaku berada di tanganNya, sungguh bejana-bejananya lebih banyak melebihi bilangan bintang-bintang langit pada malam gelap yang tidak ada mendung dan awan, bejana itu kesemuanya dari bejana-bejana surga, barangsiapa meminum satu tegukan darinya, ia tidak akan dahaga hingga tanggungan terakhirnya, lausnya seluas antara Omman hingga Aila, airnya lebih putih dari susu, lebih manis dari madu.\" Berkata Abu Isa: Hadits ini hasan shahih gharib. Dalam hal ini ada hadits serupa dari Hudzaifah bin Al Yaman, Abdullah bin 'AMru, abu Barzah Al Aslami, Ibnu Umar, Haritsah bin Wahab, Al Mustaurid bin Syadad. Dan diriwayatkan dari Ibnu Umar dari nabi Shallallahu 'alaihi wa Salam bersabda: Telagaku sepanjang antara Kufah hingga hajar aswad."
    },
    {
        "number": 2370,
        "arab": "حَدَّثَنَا أَبُو حَصِينٍ عَبْدُ اللَّهِ بْنُ أَحْمَدَ بْنِ يُونُسَ كُوفِيٌّ حَدَّثَنَا عَبْثَرُ بْنُ الْقَاسِمِ حَدَّثَنَا حُصَيْنٌ هُوَ ابْنُ عَبْدِ الرَّحْمَنِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَلَمَّا أُسْرِيَ بِالنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَعَلَ يَمُرُّ بِالنَّبِيِّ وَالنَّبِيَّيْنِ وَمَعَهُمْ الْقَوْمُ وَالنَّبِيِّ وَالنَّبِيَّيْنِ وَمَعَهُمْ الرَّهْطُ وَالنَّبِيِّ وَالنَّبِيَّيْنِ وَلَيْسَ مَعَهُمْ أَحَدٌ حَتَّى مَرَّ بِسَوَادٍ عَظِيمٍ فَقُلْتُ مَنْ هَذَا قِيلَ مُوسَى وَقَوْمُهُ وَلَكَنِ ارْفَعْ رَأْسَكَ فَانْظُرْ قَالَ فَإِذَا سَوَادٌ عَظِيمٌ قَدْ سَدَّ الْأُفُقَ مِنْ ذَا الْجَانِبِ وَمِنْ ذَا الْجَانِبِ فَقِيلَ هَؤُلَاءِ أُمَّتُكَ وَسِوَى هَؤُلَاءِ مِنْ أُمَّتِكَ سَبْعُونَ أَلْفًا يَدْخُلُونَ الْجَنَّةَ بِغَيْرِ حِسَابٍ فَدَخَلَ وَلَمْ يَسْأَلُوهُ وَلَمْ يُفَسِّرْ لَهُمْ فَقَالُوا نَحْنُ هُمْ وَقَالَ قَائِلُونَ هُمْ أَبْنَاؤُنَا الَّذِينَ وُلِدُوا عَلَى الْفِطْرَةِ وَالْإِسْلَامِ فَخَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ هُمْ الَّذِينَ لَا يَكْتَوُونَ وَلَا يَسْتَرْقُونَ وَلَا يَتَطَيَّرُونَ وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ فَقَامَ عُكَّاشَةُ بْنُ مِحْصَنٍ فَقَالَ أَنَا مِنْهُمْ يَا رَسُولَ اللَّهِ قَالَ نَعَمْ ثُمَّ قَامَ آخَرُ فَقَالَ أَنَا مِنْهُمْ فَقَالَ سَبَقَكَ بِهَا عُكَّاشَةُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْبَاب عَنْ ابْنِ مَسْعُودٍ وَأَبِي هُرَيْرَةَ",
        "id": "Telah menceritakan kepada kami [Abu Hashin Abdullah bin Ahmad bin Yunus Kufi] telah menceritakan kepada kami ['Abtsar bin Al Qasim] telah menceritakan kepada kami [Hushain bin Abdurrahman] dari [Sa'id bin Jubair] dari [Ibnu 'Abbas] berkata: Saat nabi Shallallahu 'alaihi wa Salam isra`, ia melintasi satu nabi dan beberapa nabi Shallallahu 'alaihi wa Salam bersama kaum mereka, satu nabi dan beberapa nabi Shallallahu 'alaihi wa Salam bersama beberapa orang, satu nabi dan beberapa nabi Shallallahu 'alaihi wa Salam tidak bersama seorang pun hingga beliau melewati sekumpulan besar manusia, aku bertanya: Siapa dia? Dijawab: Musa dan kaumnya, tapi angkatlah kepalamu lau lihatlah. Ternyata sekelompok besar manusia menutupi ufuk dari sisi ini dan sisi ini. dikatakan: Mereka adalah ummatmu dan diantara ummatmu itu ada tujuhpuluh ribu yang masuk surga tanpa hisab. Beliau masuk lalu para sahabat tidak bertanya kepada beliau dan beliau tidak memberi penjelasan pada mereka, lalu mereka bertanya: Kamikah mereka itu? Ada yang menjawab: Mereka adalah anak-anak kami yang meninggal dunia diatas fitrah dan Islam. Lalu nabi Shallallahu 'alaihi wa Salam keluar dan bersabda: \"Mereka adalah orang-orang yang tidak mengecos (berobat dengan sundutan api), tidak meminta diruqyah, tidak berfirasat buruk karena kedatangan hewan dan mereka bertawakal kepada Rabb mereka.\" 'Ukkasyah bin Mihshan berdiri lalu bertanya: Saya termasuk dari mereka wahai Rasulullah? beliau menjawab: \"Ya.\" Yang lain berdiri lalu bertanya: Saya termasuk dari mereka? Beliau menjawab: \"Kau sudah didahului 'Ukkasyah.\" Berkata Abu Isa: Hadits ini hasan shahih dan dalam hal ini ada hadits serupa dari Ibnu Mas'ud dan Abu Hurairah."
    },
    {
        "number": 2371,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ حَدَّثَنَا زِيَادُ بْنُ الرَّبِيعِ حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَمَا أَعْرِفُ شَيْئًا مِمَّا كُنَّا عَلَيْهِ عَلَى عَهْدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقُلْتُ أَيْنَ الصَّلَاةُ قَالَ أَوَلَمْ تَصْنَعُوا فِي صَلَاتِكُمْ مَا قَدْ عَلِمْتُمْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ أَبِي عِمْرَانَ الْجَوْنِيِّ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ أَنَسٍ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Abdullah bin Yazi'] telah menceritakan kepada kami [Ziyad bin Ar Rabi'] telah menceritakan kepada kami [Abu 'Imran Al Jauni] dari [Anas bin Malik] berkata: Aku tidak mengetahui apa pun yang ada pada kami di masa nabi Shallallahu 'alaihi wa Salam. Aku bertanya: Mana shalat? Ia menjawab: Bukankah kalian lakukan dalam shalat kalian yang telah kalian tahu? Berkata Abu Isa: Hadits ini hasan gharib dari jalur sanad ini dari hadits Abu 'Imran AL Juwaini dan diriwayatkan melalui beberapa sanad dari Anas."
    },
    {
        "number": 2372,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى الْأَزْدِيُّ الْبَصْرِيُّ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ حَدَّثَنَا هَاشِمٌ وَهُوَ ابْنُ سَعِيدٍ الْكُوفِيُّ حَدَّثَنِي زَيْدٌ الْخَثْعَمِيُّ عَنْ أَسْمَاءَ بِنْتِ عُمَيْسٍ الْخَثْعَمِيَّةِ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ بِئْسَ الْعَبْدُ عَبْدٌ تَخَيَّلَ وَاخْتَالَ وَنَسِيَ الْكَبِيرَ الْمُتَعَالِ بِئْسَ الْعَبْدُ عَبْدٌ تَجَبَّرَ وَاعْتَدَى وَنَسِيَ الْجَبَّارَ الْأَعْلَى بِئْسَ الْعَبْدُ عَبْدٌ سَهَا وَلَهَا وَنَسِيَ الْمَقَابِرَ وَالْبِلَى بِئْسَ الْعَبْدُ عَبْدٌ عَتَا وَطَغَى وَنَسِيَ الْمُبْتَدَا وَالْمُنْتَهَى بِئْسَ الْعَبْدُ عَبْدٌ يَخْتِلُ الدُّنْيَا بِالدِّينِ بِئْسَ الْعَبْدُ عَبْدٌ يَخْتِلُ الدِّينَ بِالشُّبُهَاتِ بِئْسَ الْعَبْدُ عَبْدٌ طَمَعٌ يَقُودُهُ بِئْسَ الْعَبْدُ عَبْدٌ هَوًى يُضِلُّهُ بِئْسَ الْعَبْدُ عَبْدٌ رَغَبٌ يُذِلُّهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَلَيْسَ إِسْنَادُهُ بِالْقَوِيِّ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Yahya Al Azdi Al Bashri] telah menceritakan kepada kami ['Abdus Shamad bin 'Abdul Warits] telah menceritakan kepada kami [Hasyim bin Sa'id Al Kufi] telah menceritakan kepada kami [Zaid Al Khats'ami] dari [Asma` binti 'Umais Al Khats'amiyah] berkata: Aku mendengar Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Seburuk buruk hamba adalah hamba yang sombong, berbangga diri dan lupa terhadap Dzat yang maha besar dan maha tinggi, seburuk buruk hamba adalah hamba yang diktator dan kejam dan dia lupa terhadap Dzat yang maha perkasa lagi maha tinggi, seburuk buruk hamba adalah hamba yang lupa dan lalai dan lupa akan kuburan dan ujian, seburuk buruk hamba adalah hamba yang melampaui batas dan berlebih lebihan, lupa terhadap adanya permulaan dan kesudahan, seburuk buruk hamba adalah hamba yang mencari dunia dengan mengorbankan agama, seburuk buruk hamba adalah hamba yang mencari agama dengan hal hal yang syubhat, seburuk buruk hamba adalah hamba yang dikendalikan oleh sifat tamak, seburuk buruk hamba adalah hamba yang dikuasai oleh hawa nafsu yang menyesatkannya dan seburuk buruk hamba adalah hamba yang dikuasai sifat rakus yang menjadikannya hina.\" Abu Isa berkata: Hadits ini gharib, kami tidak mengetahuinya kecuali dari jalur sanad ini sedangkan sanadnya tidak kuat.\""
    },
    {
        "number": 2373,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ الْمُؤَدِّبُ حَدَّثَنَا عَمَّارُ بْنُ مُحَمَّدٍ ابْنُ أُخْتِ سُفْيَانَ الثَّوْرِيِّ حَدَّثَنَا أَبُو الْجَارُودِ الْأَعْمَى وَاسْمُهُ زِيَادُ بْنُ الْمُنْذِرِ الْهَمْدَانِيُّ عَنْ عَطِيَّةَ الْعَوْفِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّمَا مُؤْمِنٍ أَطْعَمَ مُؤْمِنًا عَلَى جُوعٍ أَطْعَمَهُ اللَّهُ يَوْمَ الْقِيَامَةِ مِنْ ثِمَارِ الْجَنَّةِ وَأَيُّمَا مُؤْمِنٍ سَقَى مُؤْمِنًا عَلَى ظَمَإٍ سَقَاهُ اللَّهُ يَوْمَ الْقِيَامَةِ مِنْ الرَّحِيقِ الْمَخْتُومِ وَأَيُّمَا مُؤْمِنٍ كَسَا مُؤْمِنًا عَلَى عُرْيٍ كَسَاهُ اللَّهُ مِنْ خُضْرِ الْجَنَّةِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَقَدْ رُوِيَ هَذَا عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ مَوْقُوفًا وَهُوَ أَصَحُّ عِنْدَنَا وَأَشْبَهُ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Hatim Al Mu`addib] telah menceritakan kepada kami ['Ammar bin Muhammad bin ukhti Sufyan Ats Tsauri] telah menceritakan kepada kami [Abu Al Jarud Al A'ma, namanya Ziyad bin Al Mundzir Al Hamdani] dari ['Athiyah Al 'Aufi] dari [Abu Sa'id Al Khudri] berkata: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Siapapun orang mu`min yang memberi makan mu`min lain saat lapar, Allah akan memberinya makan dari buah surga, siapapun mu`min yang memberi minum mu`min lain saat dahaga, Allah akan memberinya minum pada hari kiamat dengan minuman yang penghabisannya adalah beraroma wangi kesturi, siapapun mu`min yang memberi pakaian mu`min lain saat telanjang, Allah akan memberi pakaian dari sutera surga.\" Berkata Abu Isa: Hadits ini gharib. Hadits ini diriwayatkan dari 'Athiyah dari Abu Sa'id secara mauquf dan menurut kami itu lebih shahih dan lebih mirip."
    },
    {
        "number": 2374,
        "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي النَّضْرِ حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا أَبُو عَقِيلٍ الثَّقَفِيُّ حَدَّثَنَا أَبُو فَرْوَةَ يَزِيدُ بْنُ سِنَانٍ التَّمِيمِيُّ حَدَّثَنِي بُكَيْرُ بْنُ فَيْرُوزَ قَال سَمِعْتُ أَبَا هُرَيْرَةَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ خَافَ أَدْلَجَ وَمَنْ أَدْلَجَ بَلَغَ الْمَنْزِلَ أَلَا إِنَّ سِلْعَةَ اللَّهِ غَالِيَةٌ أَلَا إِنَّ سِلْعَةَ اللَّهِ الْجَنَّةُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ أَبِي النَّضْرِ",
        "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu Nadlar] telah menceritakan kepada kami [Abu An Nadlar] telah menceritakan kepada kami [Abu 'Aqil Ats Tsaqafi] telah menceritakan kepada kami [Abu Farwah Yazid bin Sinan At Tamimi] telah menceritakan kepadaku [Bukair bin Fairuz] berkata: Aku mendengar [Abu Hurairah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Barangsiapa yang takut maka dia berjalan, dan barangsiapa yang berjalan niscaya dia akan sampai ke tempat tinggal, ketahuilah sesungguhnya barang dagangan Allah itu sangat mahal, ketahuilah sesungguhnya barang dagangan Allah itu adalah surga.\" Abu Isa berkata: Hadits ini hasan gharib, kami tidak mengetahuinya kecuali dari hadits Abu An Nadlar."
    },
    {
        "number": 2375,
        "arab": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي النَّضْرِ حَدَّثَنَا أَبُو النَّضْرِ حَدَّثَنَا أَبُو عَقِيلٍ الثَّقَفِيُّ عَبْدُ اللَّهِ بْنُ عَقِيلٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنِي رَبِيعَةُ بْنُ يَزِيدَ وَعَطِيَّةُ بْنُ قَيْسٍ عَنْ عَطِيَّةَ السَّعْدِيِّ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَبْلُغُ الْعَبْدُ أَنْ يَكُونَ مِنْ الْمُتَّقِينَ حَتَّى يَدَعَ مَا لَا بَأْسَ بِهِ حَذَرًا لِمَا بِهِ الْبَأْسُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ",
        "id": "Telah menceritakan kepada kami [Abu Bakar bin Abu An Nadlar] telah menceritakan kepada kami [Abu An Nadlar] telah menceritakan kepada kami [Abu 'Aqil Ats Tsaqafi Abdullah bin 'Aqil] telah menceritakan kepada kami [Abdullah bin Yazid] telah menceritakan kepada kami [Rabi'ah bin Yazid] dan ['Athiyyah bin Qais] dari ['Athiyyah As Sa'di] dia adalah termasuk sahabat Nabi Shallallahu 'alaihi wa Salam dia berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Seorang hamba tidak akan sampai pada derajat orang orang muttaqin sehingga dia meninggalkan sesuatu yang boleh (mubah) karena berhati-hati dari hal-hal yang dilarang.\" Abu Isa berkata: Hadits ini hasan gharib, kami tidak mengetahuinya kecuali dari jalur sanad ini.\""
    },
    {
        "number": 2376,
        "arab": "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا عِمْرَانٌ الْقَطَّانُ عَنْ قَتَادَةَ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ حَنْظَلَةَ الْأُسَيِّدِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ أَنَّكُمْ تَكُونُونَ كَمَا تَكُونُونَ عِنْدِي لَأَظَلَّتْكُمْ الْمَلَائِكَةُ بِأَجْنِحَتِهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ هَذَا الْوَجْهِ عَنْ حَنْظَلَةَ الْأُسَيْدِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ",
        "id": "Telah menceritakan kepada kami ['Abbas Al 'Anbari] telah menceritakan kepada kami [Abu Dawud] telah menceritakan kepada kami ['Imran Al Qaththan] dari [Qatadah] dari [Yazid bin Abdullah bin Asy Syakhir] dari [Hanzhalah Al Usaidi] berkata: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Andai saja kalian seperti saat berada didekatku niscaya para malaikat akan menaungi kalian dengan sayap-sayapnya.\" Berkata Abu Isa: Hadits ini hasan gharib dari jalur sanad ini. Dan hadits ini diriwayatkan melalui sanad lain dari Hanzhalah Al Usaidi dari nabi Shallallahu 'alaihi wa Salam dan dalam hal ini ada hadits serupa dari Abu Hurairah."
    },
    {
        "number": 2377,
        "arab": "حَدَّثَنَا يُوسُفُ بْنُ سَلْمَانَ أَبُو عُمَرَ الْبَصْرِيُّ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ عَنْ ابْنِ عَجْلَانَ عَنْ الْقَعْقَاعِ بْنِ حَكِيمٍ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ لِكُلِّ شَيْءٍ شِرَّةً وَلِكُلِّ شِرَّةٍ فَتْرَةً فَإِنْ كَانَ صَاحِبُهَا سَدَّدَ وَقَارَبَ فَارْجُوهُ وَإِنْ أُشِيرَ إِلَيْهِ بِالْأَصَابِعِ فَلَا تَعُدُّوهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَقَدْ رُوِيَ عَنْ أَنَسِ بْنِ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ بِحَسْبِ امْرِئٍ مِنْ الشَّرِّ أَنْ يُشَارَ إِلَيْهِ بِالْأَصَابِعِ فِي دِينٍ أَوْ دُنْيَا إِلَّا مَنْ عَصَمَهُ اللَّهُ",
        "id": "Telah menceritakan kepada kami [Yusuf bin Salman Abu 'Amir Al Bahsri] telah menceritakan kepada kami [Hatim bin Isma'il] dari [Ibnu 'Ajlan] dari [Al Qa'qa' bin Hakim] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Sesungguhnya pada setiap sesuatu itu ada saat kesungguhannya dan setiap kesungguhan ada masa melemahnya, jika pelakunya senantiasa bersikap istiqomah dan mendekat, berharaplah dia bisa tetap (semangat), sebaliknya jika ia hanya ingin ditunjuk dengan jari (berbuat karena riya', pent.) maka janganlah orang itu kalian anggap (tidak termasuk orang yang baik, pent.) \". Abu Isa berkata: Hadits ini hasan shahih gharib dari jalur sanad ini, telah diriwayatkan dari Anas bin Malik dari Nabi Shallallahu 'alaihi wa Salam bahwa beliau bersabda: \"Cukuplah keburukan bagi seseorang dengan ditunjuk dengan jari (sekedar mencari perhatian) dalam masalah agama atau dunia kecuali orang yang di jaga oleh Allah.\""
    },
    {
        "number": 2379,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَهْرَمُ ابْنُ آدَمَ وَيَشِبُّ مِنْهُ اثْنَانِ الْحِرْصُ عَلَى الْمَالِ وَالْحِرْصُ عَلَى الْعُمُرِهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari [Anas] berkata: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Anak cucu Adam tua sementara ada dua darinya yang muda; ketamakan terhadap harta dan ketamakan terhadap usia.\" Hadits ini hasan shahih."
    },
    {
        "number": 2380,
        "arab": "حَدَّثَنَا أَبُو هُرَيْرَةَ مُحَمَّدُ بْنُ فِرَاسٍ الْبَصْرِيُّ حَدَّثَنَا أَبُو قُتَيْبَةَ سَلْمُ بْنُ قُتَيْبَةَ حَدَّثَنَا أَبُو الْعَوَّامِ وَهُوَ عِمْرَانُ الْقَطَّانُ عَنْ قَتَادَةَ عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُثِّلَ ابْنُ آدَمَ وَإِلَى جَنْبِهِ تِسْعَةٌ وَتِسْعُونَ مَنِيَّةً إِنْ أَخْطَأَتْهُ الْمَنَايَا وَقَعَ فِي الْهَرَمِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami [Abu Hubairah Muhammad bin Firas Al Bashri] telah menceritakan kepada kami [Abu Qutaibah Salm bin Qutaibah] telah menceritakan kepada kami [Abu Al 'Awwam 'Imran Al Qaththan] dari [Qatadah] dari [Muththarrif bin Abdullah bin Asy Syakhir] dari [ayahnya] berkata: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Anak cucu adam dibentuk dan disampingnya ada sembilanpuluh sembilan kematian, bila kematian-kematian luput darinya, pada akhirnya ia jatuh pada masa tua juga.\" Berkata Abu Isa: Hadits ini hasan shahih gharib."
    },
    {
        "number": 2381,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا قَبِيصَةُ عَنْ سُفْيَانَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ عَنْ الطُّفَيْلِ بْنِ أُبَيِّ بْنِ كَعْبٍ عَنْ أَبِيهِ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا ذَهَبَ ثُلُثَا اللَّيْلِ قَامَ فَقَالَ يَا أَيُّهَا النَّاسُ اذْكُرُوا اللَّهَ اذْكُرُوا اللَّهَ جَاءَتْ الرَّاجِفَةُ تَتْبَعُهَا الرَّادِفَةُ جَاءَ الْمَوْتُ بِمَا فِيهِ جَاءَ الْمَوْتُ بِمَا فِيهِ قَالَ أُبَيٌّ قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أُكْثِرُ الصَّلَاةَ عَلَيْكَ فَكَمْ أَجْعَلُ لَكَ مِنْ صَلَاتِي فَقَالَ مَا شِئْتَ قَالَ قُلْتُ الرُّبُعَ قَالَ مَا شِئْتَ فَإِنْ زِدْتَ فَهُوَ خَيْرٌ لَكَ قُلْتُ النِّصْفَ قَالَ مَا شِئْتَ فَإِنْ زِدْتَ فَهُوَ خَيْرٌ لَكَ قَالَ قُلْتُ فَالثُّلُثَيْنِ قَالَ مَا شِئْتَ فَإِنْ زِدْتَ فَهُوَ خَيْرٌ لَكَ قُلْتُ أَجْعَلُ لَكَ صَلَاتِي كُلَّهَا قَالَ إِذًا تُكْفَى هَمَّكَ وَيُغْفَرُ لَكَ ذَنْبُكَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Qabishah] dari [Sufyan] dari [Abdullah bin Muhammad bin 'Uqail] dari [Ath Thufail bin Ubai bin Ka'ab] dari [ayahnya] berkata: Bila dua pertiga malam berlalu, Rasulullah Shallallahu 'alahi wa Salam bangun lalu bersabda: \"Wahai sekalian manusia, ingatlah Allah, ingatlah Allah, tiupan pertama datang dan diiringi oleh tiupan kedua, kematian datang dengan yang ada padanya, kematian datang dengan membawa segala kelanjutannya, kematian datang dengan membawa segala kelanjutannya.\" Berkata Ubai: Wahai Rasulullah, aku sering membawa shalawat untuk baginda, lalu seberapa banyak aku bershalawat untuk baginda? Rasulullah Shallallahu 'alaihi wa salam menjawab: \"Terserah.\" Aku bertanya: Seperempat? Rasulullah Shallallahu 'alahi wa Salam menjawab: \"Terserah, jika kau tambahi itu lebih baik bagimu.\" Aku bertanya: Setengah? Beliau menjawab: \"\"Terserah, jika kau tambahi itu lebih baik bagimu.\" Aku bertanya: Dua pertiga?\"Terserah, jika kau tambahi itu lebih baik bagimu.\" Aku berkata: Aku akan menjadikan seluruh doaku untuk baginda. Beliau bersabda: \"Kalau begitu, kau dicukupkan dari dukamu dan dosamu diampuni.\" Berkata Abu Isa: Hadits ini hasan shahih."
    },
    {
        "number": 2383,
        "arab": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ أَبِي بَكْرِ بْنِ أَبِي مَرْيَمَ ح و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا عَمْرُو بْنُ عَوْنٍ أَخْبَرَنَا ابْنُ الْمُبَارَكِ عَنْ أَبِي بَكْرِ بْنِ أَبِي مَرْيَمَ عَنْ ضَمْرَةَ بْنِ حَبِيبٍ عَنْ شَدَّادِ بْنِ أَوْسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْكَيِّسُ مَنْ دَانَ نَفْسَهُ وَعَمِلَ لِمَا بَعْدَ الْمَوْتِ وَالْعَاجِزُ مَنْ أَتْبَعَ نَفْسَهُ هَوَاهَا وَتَمَنَّى عَلَى اللَّهِقَالَ هَذَا حَدِيثٌ حَسَنٌ قَالَ وَمَعْنَى قَوْلِهِ مَنْ دَانَ نَفْسَهُ يَقُولُ حَاسَبَ نَفْسَهُ فِي الدُّنْيَا قَبْلَ أَنْ يُحَاسَبَ يَوْمَ الْقِيَامَةِ وَيُرْوَى عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَ حَاسِبُوا أَنْفُسَكُمْ قَبْلَ أَنْ تُحَاسَبُوا وَتَزَيَّنُوا لِلْعَرْضِ الْأَكْبَرِ وَإِنَّمَا يَخِفُّ الْحِسَابُ يَوْمَ الْقِيَامَةِ عَلَى مَنْ حَاسَبَ نَفْسَهُ فِي الدُّنْيَا وَيُرْوَى عَنْ مَيْمُونِ بْنِ مِهْرَانَ قَالَ لَا يَكُونُ الْعَبْدُ تَقِيًّا حَتَّى يُحَاسِبَ نَفْسَهُ كَمَا يُحَاسِبُ شَرِيكَهُ مِنْ أَيْنَ مَطْعَمُهُ وَمَلْبَسُهُ",
        "id": "Telah menceritakan kepada kami [Sufyan bin Waqi'] telah menceritakan kepada kami ['Isa bin Yunus] dari [Abu Bakar bin Abu Maryam], dan telah mengkhabarkan kepada kami [Abdullah bin Abdurrahman] telah mengkhabarkan kepada kami ['Amru bin 'Aun] telah mengkhabarkan kepada kami [Ibnu Al Mubarak] dari [Abu Bakar bin Abu Maryam] dari [Dlamrah bin Habib] dari [Syaddad bin Aus] dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Orang yang cerdas adalah orang yang mempersiapkan dirinya dan beramal untuk hari setelah kematian, sedangkan orang yang bodoh adalah orang jiwanya mengikuti hawa nafsunya dan berangan angan kepada Allah.\" Dia berkata: Hadits ini hasan, dia berkata: Maksud sabda Nabi \"Orang yang mempersiapkan diri\" dia berkata: Yaitu orang yang selalu mengoreksi dirinya pada waktu di dunia sebelum di hisab pada hari Kiamat. Dan telah diriwayatkan dari Umar bin Al Khottob dia berkata: hisablah (hitunglah) diri kalian sebelum kalian dihitung dan persiapkanlah untuk hari semua dihadapkan (kepada Rabb Yang Maha Agung), hisab (perhitungan) akan ringan pada hari kiamat bagi orang yang selalu menghisab dirinya ketika di dunia.\" Dan telah diriwayatkan dari Maimun bin Mihran dia berkata: Seorang hamba tidak akan bertakwa hingga dia menghisab dirinya sebagaimana dia menghisab temannya dari mana dia mendapatkan makan dan pakaiannya.\""
    },
    {
        "number": 2384,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ مَدُّوَيْهِ حَدَّثَنَا الْقَاسِمُ بْنُ الْحَكَمِ الْعُرَنِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ الْوَلِيدِ الْوَصَّافِيُّ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ قَالَدَخَلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُصَلَّاهُ فَرَأَى نَاسًا كَأَنَّهُمْ يَكْتَشِرُونَ قَالَ أَمَا إِنَّكُمْ لَوْ أَكْثَرْتُمْ ذِكْرَ هَاذِمِ اللَّذَّاتِ لَشَغَلَكُمْ عَمَّا أَرَى فَأَكْثِرُوا مِنْ ذِكْرِ هَاذِمِ اللَّذَّاتِ الْمَوْتِ فَإِنَّهُ لَمْ يَأْتِ عَلَى الْقَبْرِ يَوْمٌ إِلَّا تَكَلَّمَ فِيهِ فَيَقُولُ أَنَا بَيْتُ الْغُرْبَةِ وَأَنَا بَيْتُ الْوَحْدَةِ وَأَنَا بَيْتُ التُّرَابِ وَأَنَا بَيْتُ الدُّودِ فَإِذَا دُفِنَ الْعَبْدُ الْمُؤْمِنُ قَالَ لَهُ الْقَبْرُ مَرْحَبًا وَأَهْلًا أَمَا إِنْ كُنْتَ لَأَحَبَّ مَنْ يَمْشِي عَلَى ظَهْرِي إِلَيَّ فَإِذْ وُلِّيتُكَ الْيَوْمَ وَصِرْتَ إِلَيَّ فَسَتَرَى صَنِيعِيَ بِكَ قَالَ فَيَتَّسِعُ لَهُ مَدَّ بَصَرِهِ وَيُفْتَحُ لَهُ بَابٌ إِلَى الْجَنَّةِ وَإِذَا دُفِنَ الْعَبْدُ الْفَاجِرُ أَوْ الْكَافِرُ قَالَ لَهُ الْقَبْرُ لَا مَرْحَبًا وَلَا أَهْلًا أَمَا إِنْ كُنْتَ لَأَبْغَضَ مَنْ يَمْشِي عَلَى ظَهْرِي إِلَيَّ فَإِذْ وُلِّيتُكَ الْيَوْمَ وَصِرْتَ إِلَيَّ فَسَتَرَى صَنِيعِيَ بِكَ قَالَ فَيَلْتَئِمُ عَلَيْهِ حَتَّى يَلْتَقِيَ عَلَيْهِ وَتَخْتَلِفَ أَضْلَاعُهُ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِأَصَابِعِهِ فَأَدْخَلَ بَعْضَهَا فِي جَوْفِ بَعْضٍ قَالَ وَيُقَيِّضُ اللَّهُ لَهُ سَبْعِينَ تِنِّينًا لَوْ أَنْ وَاحِدًا مِنْهَا نَفَخَ فِي الْأَرْضِ مَا أَنْبَتَتْ شَيْئًا مَا بَقِيَتْ الدُّنْيَا فَيَنْهَشْنَهُ وَيَخْدِشْنَهُ حَتَّى يُفْضَى بِهِ إِلَى الْحِسَابِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّمَا الْقَبْرُ رَوْضَةٌ مِنْ رِيَاضِ الْجَنَّةِ أَوْ حُفْرَةٌ مِنْ حُفَرِ النَّارِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Ahmad bin Maduwaih] telah menceritakan kepada kami [Al Qasim bin Al Hakam Al 'Urani] telah menceritakan kepada kami ['Ubaidullah bin Al Walid Al Washshafi] dari ['Athiyah] dari [Abu Sa'id] berkata: Rasulullah Shallallahu 'alahi wa Salam memasuki tempat shalat beliau lalu beliau melihat orang-orang, sepertinya mereka tertawa hingga terlihat gigi-giginya, beliau bersabda: \"Ingat, sesungguhnya bila kalian banyak-banyak mengingat pemutus segala kenikmatan niscaya kalian tidak sempat melakukan yang aku lihat, karena itu perbanyaklah mengingat pemutus segala kenikmatan, sesungguhnya tidaklah ada suatu hari melewati makam (pekuburan) melainkan ia berbicara; aku rumah keterasingan, aku rumah kesendirian, aku rumah tanah, aku rumah cacing. Bila seorang hamba mu`min disemayamkan, makam berkata padanya: Selamat datang, engkau adalah orang yang berjalan di atas punggungku yang paling aku sukai, karena saat ini aku diberi kuasa menanganimu dan kau kembali kepadaku, kau akan melihat apa yang akan aku lakukan padamu.\" Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Lalu diluaskan baginya sejauh mata memandang dan dibukakan baginya pintu menuju surga. Dan bila hamba keji atau kafir dikubur, makam berkata padanya: Tidak selamat datang, engkau adalah orang yang melintasi di atas punggungku yang paling aku benci, karena saat ini aku diberi kuasa menanganimu dan kau kembali padaku, kau akan mengetahui apa yang akan aku lakukan padamu.\" Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Lalu kubur menghimpitnya hingga mengenainya sehingga tulang tulangnya tidak karu-karuan (amburadul), \" -Rasul memperagakan dengan memasukkan sebagian jari-jemarinya ke sebagian yang lain-- Berkata Abu Sa'id: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Allah menguasakan untuknya tujuhpuluh ular besar, andai satu diantaranya menghembus di bumi nicaya tidak akan menumbuhkan apa pun selama dunia masih ada, lalu semua mengigit dan melukainya hingga ia sampai ke penghisaban.\" Berkata Abu Sa'id: Rasulullah Shallallahu 'alaihi wa salam bersabda: \"Sesungguhnya kubur adalah salah satu taman surga atau salah satu liang neraka.\" Berkata Abu Isa: Hadits ini gharib, kami hanya mengetahuinya dari sanad ini."
    },
    {
        "number": 2385,
        "arab": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي ثَوْرٍ قَال سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ أَخْبَرَنِي عُمَرُ بْنُ الْخَطَّابِ قَالَ دَخَلْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَإِذَا هُوَ مُتَّكِئٌ عَلَى رَمْلِ حَصِيرٍ فَرَأَيْتُ أَثَرَهُ فِي جَنْبِهِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْحَدِيثِ قِصَّةٌ طَوِيلَةٌ",
        "id": "Telah menceritakan kepada kami 'Abd bin Humaid telah mengkhabarkan kepada kami 'Abdur Razzaq dari Ma'mar dari Az Zuhri dari 'Ubaidullah bin Abdullah bin Abu Tsaur berkata: Aku mendengar Ibnu 'Abbas berkata: telah mengabarkan kepadaku Umar bin Al Khaththab berkata: Aku memasuki kediaman Rasulullah Shallallahu 'alahi wa Salam, beliau bersandar pada tikar dari serabut, aku melihat bekasnya di lambung belau. Berkata Abu Isa: Hadits ini hasan shahih dan ada kisah panjang dalam hadits ini."
    },
    {
        "number": 2386,
        "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ مَعْمَرٍ وَيُونُسَ عَنْ الزُّهْرِيِّ أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ أَخْبَرَهُ أَنَّ الْمِسْوَرَ بْنَ مَخْرَمَةَ أَخْبَرَهُ أَنَّ عَمْرَو بْنَ عَوْفٍ وَهُوَ حَلِيفُ بَنِي عَامِرِ بْنِ لُؤَيٍّ وَكَانَ شَهِدَ بَدْرًا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَخْبَرَهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ فَقَدِمَ بِمَالٍ مِنْ الْبَحْرَيْنِ وَسَمِعَتْ الْأَنْصَارُ بِقُدُومِ أَبِي عُبَيْدَةَ فَوَافَوْا صَلَاةَ الْفَجْرِ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا صَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْصَرَفَ فَتَعَرَّضُوا لَهُ فَتَبَسَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ رَآهُمْ ثُمَّ قَالَ أَظُنُّكُمْ سَمِعْتُمْ أَنْ أَبَا عُبَيْدَةَ قَدِمَ بِشَيْءٍ قَالُوا أَجَلْ يَا رَسُولَ اللَّهِ قَالَ فَأَبْشِرُوا وَأَمِّلُوا مَا يَسُرُّكُمْ فَوَاللَّهِ مَا الْفَقْرَ أَخْشَى عَلَيْكُمْ وَلَكِنِّي أَخْشَى أَنْ تُبْسَطَ الدُّنْيَا عَلَيْكُمْ كَمَا بُسِطَتْ عَلَى مَنْ قَبْلَكُمْ فَتَنَافَسُوهَا كَمَا تَنَافَسُوهَا فَتُهْلِكَكُمْ كَمَا أَهْلَكَتْهُمْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Abdullah bin Al Mubarak] dari [Ma'mar] dan [Yunus] dari [Az Zuhri] bahwa ['Urwah bin Az Zubair] memberitahunya bahwa [Al Miswar bin Makhramah] memberitahunya bahwa [Amru bin 'Auf], yang ia adalah sekutu Bani 'Amir bin Lu`ai, yang ia turut serta dalam perang Badar bersama Rasulullah Shallallahu 'alahi wa Salam, ia memberitahunya bahwa Rasulullah Shallallahu 'alahi wa Salam mengutus Abu 'Ubaidah bin Al Jarrah lalu ia datang membawa harta dari Bahrain dan kaun Anshar mendengar kedatangan Abu 'Ubaidah lalu mereka shalat fajar bersama Rasulullah Shallallahu 'alahi wa Salam, seusai shalat Rasulullah Shallallahu 'alahi wa Salam bergegas lalu mereka menghadang beliau, Rasulullah Shallallahu 'alahi wa Salam tersenyum saat melihat mereka, setelah itu beliau bersabda: \"Aku kira kalian mendengar bahwa Abu 'Ubaidah datang membawa sesuatu.\" Mereka berkata: Benar, wahai Rasulullah. beliau bersabda: \"Bergembiralah dan berharaplah apa yang menggembirakan kalian, demi Allah bukan kemiskinan yang aku takutkan pada kalian, tapi aku takut dunia dibentangkan untuk kalian seperti halnya dibentangkan pada orang sebelum kalian, lalu kalian memperlombakannya sebagaimana mereka memperlombakannya lalu ia membinasakan kalian seperti halnya mereka.\" Berkata Abu Isa: Hadits ini shahih."
    },
    {
        "number": 2387,
        "arab": "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ وَابْنِ الْمُسَيَّبِ أَنَّ حَكِيمَ بْنَ حِزَامٍ قَالَسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ قَالَ يَا حَكِيمُ إِنَّ هَذَا الْمَالَ خَضِرَةٌ حُلْوَةٌ فَمَنْ أَخَذَهُ بِسَخَاوَةِ نَفْسٍ بُورِكَ لَهُ فِيهِ وَمَنْ أَخَذَهُ بِإِشْرَافِ نَفْسٍ لَمْ يُبَارَكْ لَهُ فِيهِ وَكَانَ كَالَّذِي يَأْكُلُ وَلَا يَشْبَعُ وَالْيَدُ الْعُلْيَا خَيْرٌ مِنْ الْيَدِ السُّفْلَى فَقَالَ حَكِيمٌ فَقُلْتُ يَا رَسُولَ اللَّهِ وَالَّذِي بَعَثَكَ بِالْحَقِّ لَا أَرْزَأُ أَحَدًا بَعْدَكَ شَيْئًا حَتَّى أُفَارِقَ الدُّنْيَا فَكَانَ أَبُو بَكْرٍ يَدْعُو حَكِيمًا إِلَى الْعَطَاءِ فَيَأْبَى أَنْ يَقْبَلَهُ ثُمَّ إِنَّ عُمَرَ دَعَاهُ لِيُعْطِيَهُ فَأَبَى أَنْ يَقْبَلَ مِنْهُ شَيْئًا فَقَالَ عُمَرُ إِنِّي أُشْهِدُكُمْ يَا مَعْشَرَ الْمُسْلِمِينَ عَلَى حَكِيمٍ أَنِّي أَعْرِضُ عَلَيْهِ حَقَّهُ مِنْ هَذَا الْفَيْءِ فَيَأْبَ أَنْ يَأْخُذَهُ فَلَمْ يَرْزَأْ حَكِيمٌ أَحَدًا مِنْ النَّاسِ شَيْئًا بَعْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَتَّى تُوُفِّيَقَالَ هَذَا حَدِيثٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Suwaid] telah mengkhabarkan kepada kami [Abdullah] dari [Yunus] dari [Az Zuhri] dari ['Urwah] dan [Ibnu Al Musayyib] bahwa [Hakim bin Hizam] berkata: Aku meminta Rasulullah Shallallahu 'alahi wa Salam lalu beliau memberiku, setelah itu aku meminta pada beliau, beliau memberiku, kemudian aku meminta pada beliau, beliau memberiku, setelah itu beliau bersabda: \"Hai Hakim, sesungguhnya harta ini hijau manis, barangsiapa yang mengambilnya dengan kedermawanan jiwa, ia diberkahi, sebaliknya barangsiapa mengambilnya dengan ambisius dan ketamakan jiwa, ia tidak diberkahi dan seperti orang makan namun tidak kenyang, tangan di atas lebih baik dari tangan di bawah.\" Berkata Hakim: Aku berkata: Wahai Rasulullah, demi yang mengutusmu dengan kebenaran, aku tidak akan meminta apa pun kepada siapa pun sepeninggal baginda hingga aku meninggalkan dunia. Abu Bakar memanggil Hakim untuk diberi sesuatu, ia enggan menerimanya, setelah itu Umar memanggilnya untuk diberi sesuatu, ia sama sekali tidak menerimanya lalu Umar berkata: Aku menjadikan kalian wahai kaum muslimin sebagai saksi atas Hakim, sesungguhnya aku telah menawarkan haknya dari harta rampasan perang ini tapi ia enggan mengambilnya. Hakim tidak menerima sesuatu pun dari siapa pun setelah Rasulullah Shallallahu 'alahi wa Salam hingga ia meninggal. Berkata Abu Isa: Hadits ini shahih."
    },
    {
        "number": 2388,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو صَفْوَانَ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَابْتُلِينَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالضَّرَّاءِ فَصَبَرْنَا ثُمَّ ابْتُلِينَا بِالسَّرَّاءِ بَعْدَهُ فَلَمْ نَصْبِرْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abu Shofwan] dari [Yunus] dari [Az Zuhri] dari [Humaid bin Abdurrahman] dari [Abdurrahman bin 'Auf] berkata: Ketika bersama Rasulullah kami di uji dengan kesusahan dan kami bersabar, kemudian setelah beliau meninggal kami diuji dengan kesenangan dan kami tidak bersabar.\" Abu Isa berkata: Hadits ini hasan."
    },
    {
        "number": 2389,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا وَكِيعٌ عَنْ الرَّبِيعِ بْنِ صَبِيحٍ عَنْ يَزِيدَ بْنِ أَبَانَ وَهُوَ الرَّقَاشِيُّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَتْ الْآخِرَةُ هَمَّهُ جَعَلَ اللَّهُ غِنَاهُ فِي قَلْبِهِ وَجَمَعَ لَهُ شَمْلَهُ وَأَتَتْهُ الدُّنْيَا وَهِيَ رَاغِمَةٌ وَمَنْ كَانَتْ الدُّنْيَا هَمَّهُ جَعَلَ اللَّهُ فَقْرَهُ بَيْنَ عَيْنَيْهِ وَفَرَّقَ عَلَيْهِ شَمْلَهُ وَلَمْ يَأْتِهِ مِنْ الدُّنْيَا إِلَّا مَا قُدِّرَ لَهُ",
        "id": "Telah menceritakan kepada kami Hannad telah menceritakan kepada kami Waqi' dari Ar Rabi' bin Shabih dari Yazid bin Abban Ar Raqasyi dari Anas bin Malik berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Barangsiapa yang keinginannya hanya kehidupan akhirat maka Allah akan memberi rasa cukup dalam hatinya, menyatukan urusannya yang berserakan dan dunia datang kepadanya tanpa dia cari, dan barangsiapa yang keinginannya hanya kehidupan dunia maka Allah akan jadikan kemiskinan selalu membayang-bayangi di antara kedua matanya, mencerai beraikan urusannya dan dunia tidak akan datang kepadanya kecuali sekedar apa yang telah ditentukan baginya.\""
    },
    {
        "number": 2390,
        "arab": "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ عَنْ عِمْرَانَ بْنِ زَائِدَةَ بْنِ نَشِيطٍ عَنْ أَبِيهِ عَنْ أَبِي خَالِدٍ الْوَالِبِيِّ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ اللَّهَ تَعَالَى يَقُولُ يَا ابْنَ آدَمَ تَفَرَّغْ لِعِبَادَتِي أَمْلَأْ صَدْرَكَ غِنًى وَأَسُدَّ فَقْرَكَ وَإِلَّا تَفْعَلْ مَلَأْتُ يَدَيْكَ شُغْلًا وَلَمْ أَسُدَّ فَقْرَكَقَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَأَبُو خَالِدٍ الْوَالِبِيُّ اسْمُهُ هُرْمُزُ",
        "id": "Telah menceritakan kepada kami ['Ali bin Khasyram] telah menceritakan kepada kami ['Isa bin Yunus] dari ['Imran bin Za'idah bin Nasyith] dari [bapaknya] dari [Abu Khalid Al Walibi] dari [Abu Hurairah] dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Sesungguhnya Allah Ta'ala berfirman: Wahai anak Adam, fokuskanlah untuk beribadah kepadaku niscaya Aku penuhi dadamu dengan rasa cukup dan aku tutupi kefakiranmu, jika kamu tidak mengerjakannya Aku akan penuhi kedua tanganmu dengan kesibukan dan Aku tidak menutupi kefakiranmu.\" Dia berkata: Hadits ini hasan gharib, adapun Abu Kholid Al Walibi namanya adalah Hurmuz."
    },
    {
        "number": 2391,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعِنْدَنَا شَطْرٌ مِنْ شَعِيرٍ فَأَكَلْنَا مِنْهُ مَا شَاءَ اللَّهُ ثُمَّ قُلْتُ لِلْجَارِيَةِ كِيلِيهِ فَكَالَتْهُ فَلَمْ يَلْبَثْ أَنْ فَنِيَ قَالَتْ فَلَوْ كُنَّا تَرَكْنَاهُ لَأَكَلْنَا مِنْهُ أَكْثَرَ مِنْ ذَلِكَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ وَمَعْنَى قَوْلِهَا شَطْرٌ تَعْنِي شَيْئًا",
        "id": "Telah menceritakan kepada kami Hannad telah menceritakan kepada kami Abu Mu'awiyah dari Hisyam bin 'Urwah dari ayahnya dari 'Aisyah berkata: Rasulullah Shallallahu 'alaihi wa Salam wafat dan kami memiliki separuh gandum, kami memakannya kemudian aku berkata kepada budak wanita: takarlah. Ia kemudian menakarnya. Tidak berselang lama makanan habis, wanita itu berkata: Andai kami membiarkannya (maksudnya tidak menakarnya), pastilah kami bisa memakannya lebih dari itu. Berkata Abu Isa: Hadits ini shahih dan makna perkataan 'Aisyah: Separuh, yaitu sesuatu."
    },
    {
        "number": 2392,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ عَنْ عَزْرَةَ عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيِّ عَنْ سَعْدِ بْنِ هِشَامٍ عَنْ عَائِشَةَ قَالَتْ كَانَ لَنَا قِرَامُ سِتْرٍ فِيهِ تَمَاثِيلُ عَلَى بَابِي فَرَآهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ انْزَعِيهِ فَإِنَّهُ يُذَكِّرُنِي الدُّنْيَا قَالَتْ وَكَانَ لَنَا سَمَلُ قَطِيفَةٍ تَقُولُ عَلَمُهَا مِنْ حَرِيرٍ كُنَّا نَلْبَسُهَا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ",
        "id": "Telah menceritakan kepada kami Hannad telah menceritakan kepada kami Abu Mu'awiyah dari Dawud bin Abu Hind dari 'Azrah dari Humaid bin Abdurrahman Al Himyari dari Sa'ad bin Hisyam dari 'Aisyah berkata: Kami memiliki kelambu tipis bergambar di kedua pintuku lalu Rasulullah Shallallahu 'alaihi wa Sallam melihatnya, beliau bersabda: \"Cabutlah karena itu mengingatkanku pada dunia.\" Berkata 'Aisyah: Kami memiliki kain sutra lusuh, ia berkata: Lukisannya dari sutera, dulu kami memakainya. Berkata Abu Isa: Hadits ini hasan shahih gharib dari jalur sanad ini."
    },
    {
        "number": 2393,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا عَبْدَةُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ كَانَتْ وِسَادَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الَّتِي يَضْطَجِعُ عَلَيْهَا مِنْ أَدَمٍ حَشْوُهَا لِيفٌ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami Hannad telah menceritakan kepada kami 'Abdah dari Hisyam bin 'Urwah dari ayahnya dari 'Aisyah berkata: Bantal Rasulullah Shallallahu 'alahi wa Salam yang dipakai tidur terbuat dari kulit isinya rumput kering. Berkata Abu Isa: Hadits ini shahih."
    },
    {
        "number": 2394,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي مَيْسَرَةَ عَنْ عَائِشَةَ أَنَّهُمْ ذَبَحُوا شَاةً فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا بَقِيَ مِنْهَا قَالَتْ مَا بَقِيَ مِنْهَا إِلَّا كَتِفُهَا قَالَ بَقِيَ كُلُّهَا غَيْرَ كَتِفِهَا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ وَأَبُو مَيْسَرَةَ هُوَ الْهَمْدَانِيُّ اسْمُهُ عَمْرُو بْنُ شُرَحْبِيلَ",
        "id": "Telah menceritakan kepada kami Muhammad bin Basyar telah menceritakan kepada kami Yahya bin Sa'id dari Sufyan dari Abu Ishaq dari Abu Maisarah dari 'Aisyah, mereka menyembelih kambing lalu nabi Shallallahu 'alaihi wa Salam bertanya: \"Apa yang tersisa?\" 'A`isyah menjawab: Tidak ada yang tersisa selain bahunya. Beliau bersabda: \"Semuanya ada selain bahunya.\" Berkata Abu Isa: Hadits ini shahih dan Abu Maisarah Al Hamdani namanya 'Amru bin Syurahbil."
    },
    {
        "number": 2395,
        "arab": "حَدَّثَنَا هَارُونُ بْنُ إِسْحَقَ الْهَمْدَانِيُّ حَدَّثَنَا عَبْدَةُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْ إِنْ كُنَّا يَئُولُ مُحَمَّدٍ نَمْكُثُ شَهْرًا مَا نَسْتَوْقِدُ بِنَارٍ إِنْ هُوَ إِلَّا الْمَاءُ وَالتَّمْرُ قَالَ هَذَا حَدِيثٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami Harun bin Ishaq Al Hamdani telah menceritakan kepada kami 'Abdah dari Hisyam bin 'Urwah dari ayahnya dari 'Aisyah berkata: Kami keluarga Muhammad, selama sebulan kami pernah tidak menyalakan dengan api, yang ada hanya air dan kurma. Berkata Abu Isa: Hadits ini shahih."
    },
    {
        "number": 2396,
        "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنَا رَوْحُ بْنُ أَسْلَمَ أَبُو حَاتِمٍ الْبَصْرِيُّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ حَدَّثَنَا ثَابِتٌ عَنْ أَنَسٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَدْ أُخِفْتُ فِي اللَّهِ وَمَا يُخَافُ أَحَدٌ وَلَقَدْ أُوذِيتُ فِي اللَّهِ وَمَا يُؤْذَى أَحَدٌ وَلَقَدْ أَتَتْ عَلَيَّ ثَلَاثُونَ مِنْ بَيْنِ يَوْمٍ وَلَيْلَةٍ وَمَا لِي وَلِبِلَالٍ طَعَامٌ يَأْكُلُهُ ذُو كَبِدٍ إِلَّا شَيْءٌ يُوَارِيهِ إِبْطُ بِلَالٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَمَعْنَى هَذَا الْحَدِيثِ حِينَ خَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَارِبًا مِنْ مَكَّةَ وَمَعَهُ بِلَالٌ إِنَّمَا كَانَ مَعَ بِلَالٍ مِنْ الطَّعَامِ مَا يَحْمِلُهُ تَحْتَ إِبْطِهِ",
        "id": "Telah menceritakan kepada kami Abdullah bin Abdurrahman telah menceritakan kepada kami Rauh bin Aslam Abu Hatim Al Bashri telah menceritakan kepada kami Hammad bin Salamah telah menceritakan kepada kami Tsabit dari Anas berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: Aku biasa ditakut-takuti (diteror) karena dijalan Allah ketika tidak ada seorang pun yang ditakut-takuti (diteror), aku disakiti karena Allah ketika tidak ada seorangpun yang disakiti, tigapuluh hari tigapuluh malam berlalu sementara aku dan Bilal tidak memiliki makanan yang dapat dimakan kecuali sesuatu yang disembunyikan di ketiak Bilal.\" Abu Isa berkata: Hadits ini hasan shahih, adapun makna hadits ini, ketika Nabi Shallallahu 'alaihi wa Salam keluar meninggalkan Makkah bersama Bilal, makanan yang dibawa Bilal hanyalah yang dia bawa di bawah ketiaknya."
    },
    {
        "number": 2397,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ حَدَّثَنَا يَزِيدُ بْنُ زِيَادٍ عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ حَدَّثَنِي مَنْ سَمِعَ عَلِيَّ بْنَ أَبِي طَالِبٍ يَقُولُ خَرَجْتُ فِي يَوْمٍ شَاتٍ مِنْ بَيْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ أَخَذْتُ إِهَابًا مَعْطُوبًا فَحَوَّلْتُ وَسَطَهُ فَأَدْخَلْتُهُ عُنُقِي وَشَدَدْتُ وَسَطِي فَحَزَمْتُهُ بِخُوصِ النَّخْلِ وَإِنِّي لَشَدِيدُ الْجُوعِ وَلَوْ كَانَ فِي بَيْتِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ طَعَامٌ لَطَعِمْتُ مِنْهُ فَخَرَجْتُ أَلْتَمِسُ شَيْئًا فَمَرَرْتُ بِيَهُودِيٍّ فِي مَالٍ لَهُ وَهُوَ يَسْقِي بِبَكَرَةٍ لَهُ فَاطَّلَعْتُ عَلَيْهِ مِنْ ثُلْمَةٍ فِي الْحَائِطِ فَقَالَ مَا لَكَ يَا أَعْرَابِيُّ هَلْ لَكَ فِي كُلِّ دَلْوٍ بِتَمْرَةٍ قُلْتُ نَعَمْ فَافْتَحْ الْبَابَ حَتَّى أَدْخُلَ فَفَتَحَ فَدَخَلْتُ فَأَعْطَانِي دَلْوَهُ فَكُلَّمَا نَزَعْتُ دَلْوًا أَعْطَانِي تَمْرَةً حَتَّى إِذَا امْتَلَأَتْ كَفِّي أَرْسَلْتُ دَلْوَهُ وَقُلْتُ حَسْبِي فَأَكَلْتُهَا ثُمَّ جَرَعْتُ مِنْ الْمَاءِ فَشَرِبْتُ ثُمَّ جِئْتُ الْمَسْجِدَ فَوَجَدْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami Hannad telah menceritakan kepada kami Yunus bin Bukair dari Muhammad bin Ishaq bahwa Yazid bin Ziyad dari Muhammad bin Ka'ab Al Quradli telah menceritakan kepadaku orang yang mendengar 'Ali bin Abu Thalib berkata: Pada suatu hari yang dingin aku keluar dari rumah Rasulullah Shallallahu 'alaihi wa Salam dan aku mengambil sebuah kulit yang disamak dan sudah rusak kemudian aku lubangi bagian tengahnya lalu aku memasukkan leherku dan kukencangkan bagian tengahnya kemudian aku memakai ikat pinggang dengan daun kurma sementara aku dalam keadaan sangat lapar, seandainya di rumah Rasulullah Shallallahu 'alaihi wa Salam ada makanan pasti aku memakannya, kemudian aku keluar untuk mencari sesuatu dan melewati seorang yahudi yang sedang berada dikebunnya dan sedang menyiram dengan embernya, lalu aku mengintipnya dari lubang tembok, dia berkata: Ada apa denganmu wahai orang badui, apakah kamu mau menyiram dengan imbalan setiap satu ember satu kurma? aku menjawab: Ya tolong bukakan pintunya. Pintunya dibuka dan aku masuk, dia menyerahkan embernya kepadaku, setiap aku mengambil satu ember dia memberiku satu kurma, sampai ketika telapak tanganku telah penuh dengan kurma aku menyerahkan kembali embernya dan aku mengatakan: Sudah cukup, kemudian aku memakannya lalu meneguk air minum kemudian aku datang ke masjid dan mendapatkan Rasulullah Shallallahu 'alaihi wa Salam berada di dalamnya. Abu Isa berkata: Hadits ini hasan gharib."
    },
    {
        "number": 2398,
        "arab": "حَدَّثَنَا أَبُو حَفْصٍ عَمْرُو بْنُ عَلِيٍّ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ عَبَّاسٍ الْجُرَيْرِيِّ قَال سَمِعْتُ أَبَا عُثْمَانَ النَّهْدِيَّ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ أَصَابَهُمْ جُوعٌ فَأَعْطَاهُمْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَمْرَةً تَمْرَةً قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami Abu Hafsh 'Amru bin 'Ali telah menceritakan kepada kami Muhammad bin Ja'far telah menceritakan kepada kami Syu'bah dari 'Abbas Al Jurairi berkata: Aku mendengar Abu 'Utsman An Nahdi bercerita dari Abu Hurairah: Para sahabat terserang lapar lalu Rasulullah Shallallahu 'alahi wa Sallam memberi mereka hanya sebutir-sebutir. Berkata Abu Isa: Hadits ini hasan shahih."
    },
    {
        "number": 2399,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا عَبْدَةُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ وَهْبِ بْنِ كَيْسَانَ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ بَعَثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ ثَلَاثُ مِائَةٍ نَحْمِلُ زَادَنَا عَلَى رِقَابِنَا فَفَنِيَ زَادُنَا حَتَّى إِنْ كَانَ يَكُونُ لِلرَّجُلِ مِنَّا كُلَّ يَوْمٍ تَمْرَةٌ فَقِيلَ لَهُ يَا أَبَا عَبْدِ اللَّهِ وَأَيْنَ كَانَتْ تَقَعُ التَّمْرَةُ مِنْ الرَّجُلِ فَقَالَ لَقَدْ وَجَدْنَا فَقْدَهَا حِينَ فَقَدْنَاهَا وَأَتَيْنَا الْبَحْرَ فَإِذَا نَحْنُ بِحُوتٍ قَدْ قَذَفَهُ الْبَحْرُ فَأَكَلْنَا مِنْهُ ثَمَانِيَةَ عَشَرَ يَوْمًا مَا أَحْبَبْنَا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ وَرَوَاهُ مَالِكُ بْنُ أَنَسٍ عَنْ وَهْبِ بْنِ كَيْسَانَ أَتَمَّ مِنْ هَذَا وَأَطْوَلَ",
        "id": "Telah menceritakan kepada kami Hannad telah menceritakan kepada kami 'Abdah dari Hisyam bin 'Urwah dari Wahab bin Kaisan dari Jabir bin Abdullah berkata: Rasulullah Shallallahu 'alahi wa Salam mengutus kami dan kami berjumlah tiga ratus orang, kami membawa perbekalan kami di atas pundak lalu perbekalan kami habis hingga bila pun ada seseorang dari kami memakan, itu hanyalah satu butir kurma setiap harinya. Ia ditanya: \"Wahai Abu Abdullah, dimana kurma seseorang jatuh? ia menjawab: Kami menemukan bekasnya ketika kami kehilangan kurma itu, Dan kami akhirnya pergi ke laut, ternyata ada ikan besar yang dimuntahkan laut lalu kami memakannya selama delapan belas hari semau kami. Berkata Abu Isa: Hadits ini hasan shahih. Diriwayatkan melalui sanad lain dari Jabir bin Abdullah, dan Malik bin Anas meriwayatkannya dari Wahab bin Kaisan dengan lebih lengkap dan lebih panjang dari hadits ini."
    },
    {
        "number": 2400,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ حَدَّثَنِي يَزِيدُ بْنُ زِيَادٍ عَنْ مُحَمَّدِ بْنِ كَعْبٍ الْقُرَظِيِّ حَدَّثَنِي مَنْ سَمِعَ عَلِيَّ بْنَ أَبِي طَالِبٍ يَقُولُ إِنَّا لَجُلُوسٌ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْمَسْجِدِ إِذْ طَلَعَ مُصْعَبُ بْنُ عُمَيْرٍ مَا عَلَيْهِ إِلَّا بُرْدَةٌ لَهُ مَرْقُوعَةٌ بِفَرْوٍ فَلَمَّا رَآهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَكَى لِلَّذِي كَانَ فِيهِ مِنْ النِّعْمَةِ وَالَّذِي هُوَ الْيَوْمَ فِيهِ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَيْفَ بِكُمْ إِذَا غَدَا أَحَدُكُمْ فِي حُلَّةٍ وَرَاحَ فِي حُلَّةٍ وَوُضِعَتْ بَيْنَ يَدَيْهِ صَحْفَةٌ وَرُفِعَتْ أُخْرَى وَسَتَرْتُمْ بُيُوتَكُمْ كَمَا تُسْتَرُ الْكَعْبَةُ قَالُوا يَا رَسُولَ اللَّهِ نَحْنُ يَوْمَئِذٍ خَيْرٌ مِنَّا الْيَوْمَ نَتَفَرَّغُ لِلْعِبَادَةِ وَنُكْفَى الْمُؤْنَةَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَأَنْتُمْ الْيَوْمَ خَيْرٌ مِنْكُمْ يَوْمَئِذٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَيَزِيدُ بْنُ زِيَادٍ هُوَ ابْنُ مَيْسَرَةَ وَهُوَ مَدَنِيٌّ وَقَدْ رَوَى عَنْهُ مَالِكُ بْنُ أَنَسٍ وَغَيْرُ وَاحِدٍ مِنْ أَهْلِ الْعِلْمِ وَيَزِيدُ بْنُ زِيَادٍ الدِّمَشْقِيُّ الَّذِي رَوَى عَنْ الزُّهْرِيِّ رَوَى عَنْهُ وَكِيعٌ وَمَرْوَانُ بْنُ مُعَاوِيَةَ وَيَزِيدُ بْنُ أَبِي زِيَادٍ كُوفِيٌّ رَوَى عَنْهُ سُفْيَانُ وَشُعْبَةُ وَابْنُ عُيَيْنَةَ وَغَيْرُ وَاحِدٍ مِنْ الْأَئِمَّةِ",
        "id": "Telah menceritakan kepada kami Hannad telah menceritakan kepada kami Yunus bin Bukair dari Muhammad bin Ishaq telah menceritakan kepada kami Yazid bin Ziyad dari Muhammad bin Ka'ab Al Quradli telah menceritakan kepadaku seseorang yang telah mendengar Ali bin Abu Thalib berkata: Ketika kami sedang duduk-duduk di masjid bersama Rasulullah Shallallahu 'alaihi wa Salam, tiba tiba Mush'ab bin 'Umair muncul tidak membawa apa pun kecuali selendangnya yang penuh dengan tambalan kulit, ketika Rasulullah Shallallahu 'alaihi wa Salam melihatnya beliau menangis karena mengingat kenikmatan Mush'ab dahulu dibandingkan hari ini lalu Rasulullah Shallallahu 'alaihi wa Salam berkata: Bagaimana dengan salah seorang dari kalian yang di pagi hari mengenakan satu pakaian dan di siang harinya mengenakan yang lain lagi, dan di depannya disiapkan hidangan makanan kemudian diganti lagi dengan hidangan yang lain, kalian selimuti rumah kalian sebagaimana Ka'bah diselimuti? Para sahabat berkata: Wahai Rasulullah pada hari itu kami lebih baik dari sekarang ini sehingga kami fokus dalam beribadah dan kami diberi kecukupan dari tanggungan hidup. Kemudian Rasulullah Shallallahu 'alaihi wa Salam menjawab: \"Justru hari ini kalian lebih baik dari pada hari itu.\" Abu Isa berkata: Hadits ini hasan gharib, adapun Yazid bin Ziyad dia adalah anak Maisarah, dia orang Madinah yang sering menjadi sumber periwayatan Malik bin Anas dan para ahli ilmu lainnya, sedangkan Yazid bin Ziyad Ad Dimasyqi yang meriwayatkah hadits dari Az Zuhri, haditsnya diriwayatkan oleh Waqi', Marwan bin Mu'awiyah dan Yazid bin Abu Ziyad dia adalah orang kufah dimana Sufyan, Syu'bah dan Ibnu 'Uyainah serta para imam yang lain meriwayatkan hadits darinya."
    },
    {
        "number": 2401,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ حَدَّثَنِي عُمَرُ بْنُ ذَرٍّ حَدَّثَنَا مُجَاهِدٌ عَنْ أَبِي هُرَيْرَةَ قَالَ كَانَ أَهْلُ الصُّفَّةِ أَضْيَافُ أَهْلِ الْإِسْلَامِ لَا يَأْوُونَ عَلَى أَهْلٍ وَلَا مَالٍ وَاللَّهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ إِنْ كُنْتُ لَأَعْتَمِدُ بِكَبِدِي عَلَى الْأَرْضِ مِنْ الْجُوعِ وَأَشُدُّ الْحَجَرَ عَلَى بَطْنِي مِنْ الْجُوعِ وَلَقَدْ قَعَدْتُ يَوْمًا عَلَى طَرِيقِهِمْ الَّذِي يَخْرُجُونَ فِيهِ فَمَرَّ بِي أَبُو بَكْرٍ فَسَأَلْتُهُ عَنْ آيَةٍ مِنْ كِتَابِ اللَّهِ مَا أَسْأَلُهُ إِلَّا لِيُشْبِعَنِي فَمَرَّ وَلَمْ يَفْعَلْ ثُمَّ مَرَّ بِي عُمَرُ فَسَأَلْتُهُ عَنْ آيَةٍ مِنْ كِتَابِ اللَّهِ مَا أَسْأَلُهُ إِلَّا لِيُشْبِعَنِي فَمَرَّ وَلَمْ يَفْعَلْ ثُمَّ مَرَّ أَبُو الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَتَبَسَّمَ حِينَ رَآنِي وَقَالَ أَبَا هُرَيْرَةَ قُلْتُ لَبَّيْكَ يَا رَسُولَ اللَّهِ قَالَ الْحَقْ وَمَضَى فَاتَّبَعْتُهُ وَدَخَلَ مَنْزِلَهُ فَاسْتَأْذَنْتُ فَأَذِنَ لِي فَوَجَدَ قَدَحًا مِنْ لَبَنٍ فَقَالَ مِنْ أَيْنَ هَذَا اللَّبَنُ لَكُمْ قِيلَ أَهْدَاهُ لَنَا فُلَانٌ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَا هُرَيْرَةَ قُلْتُ لَبَّيْكَ فَقَالَ الْحَقْ إِلَى أَهْلِ الصُّفَّةِ فَادْعُهُمْ وَهُمْ أَضْيَافُ الْإِسْلَامِ لَا يَأْوُونَ عَلَى أَهْلٍ وَلَا مَالٍ إِذَا أَتَتْهُ صَدَقَةٌ بَعَثَ بِهَا إِلَيْهِمْ وَلَمْ يَتَنَاوَلْ مِنْهَا شَيْئًا وَإِذَا أَتَتْهُ هَدِيَّةٌ أَرْسَلَ إِلَيْهِمْ فَأَصَابَ مِنْهَا وَأَشْرَكَهُمْ فِيهَا فَسَاءَنِي ذَلِكَ وَقُلْتُ مَا هَذَا الْقَدَحُ بَيْنَ أَهْلِ الصُّفَّةِ وَأَنَا رَسُولُهُ إِلَيْهِمْ فَسَيَأْمُرُنِي أَنْ أُدِيرَهُ عَلَيْهِمْ فَمَا عَسَى أَنْ يُصِيبَنِي مِنْهُ وَقَدْ كُنْتُ أَرْجُو أَنْ أُصِيبَ مِنْهُ مَا يُغْنِينِي وَلَمْ يَكُنْ بُدٌّ مِنْ طَاعَةِ اللَّهِ وَطَاعَةِ رَسُولِهِ فَأَتَيْتُهُمْ فَدَعَوْتُهُمْ فَلَمَّا دَخَلُوا عَلَيْهِ فَأَخَذُوا مَجَالِسَهُمْ فَقَالَ أَبَا هُرَيْرَةَ خُذْ الْقَدَحَ وَأَعْطِهِمْ فَأَخَذْتُ الْقَدَحَ فَجَعَلْتُ أُنَاوِلُهُ الرَّجُلَ فَيَشْرَبُ حَتَّى يَرْوَى ثُمَّ يَرُدُّهُ فَأُنَاوِلُهُ الْآخَرَ حَتَّى انْتَهَيْتُ بِهِ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ رَوَى الْقَوْمُ كُلُّهُمْ فَأَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْقَدَحَ فَوَضَعَهُ عَلَى يَدَيْهِ ثُمَّ رَفَعَ رَأْسَهُ فَتَبَسَّمَ فَقَالَ أَبَا هُرَيْرَةَ اشْرَبْ فَشَرِبْتُ ثُمَّ قَالَ اشْرَبْ فَلَمْ أَزَلْ أَشْرَبُ وَيَقُولُ اشْرَبْ حَتَّى قُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا أَجِدُ لَهُ مَسْلَكًا فَأَخَذَ الْقَدَحَ فَحَمِدَ اللَّهَ وَسَمَّى ثُمَّ شَرِبَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami Hannad telah menceritakan kepada kami Yunus bin Bukair telah menceritakan kepadaku Umar bin Dzarr telah menceritakan kepada kami Mujahid dari Abu Hurairah berkata: Ahlush shuffah adalah tamu-tamu orang Islam, mereka tidak punya tempat untuk menempatkan keluarga dan harta mereka. Demi Allah yang tidak ada Ilah selainNya, dulu pernah kubungkukkan badanku sambil duduk di atas tanah karena lapar dan aku mengikatkan batu diperutku. Pada suatu hari aku duduk diatas jalan yang bisa mereka lalui saat bepergian. Abu Bakar melewatiku, aku bertanya padanya tentang salah satu ayat dari kitab Allah, aku tidak menanyakannya kecuali supaya membuatku kenyang, ia lewat dan enggan (menjawab), setelah itu Umar lewat lalu aku bertanya padanya tentang salah satu ayat dari kitab Allah, aku tidak menanyakannya kecuali supaya membuatku kenyang, ia lewat dan tidak mau (menjawab), kemudian Abu Al Qasim Shallallahu 'alaihi wa Salam lewat, beliau tersenyum saat melihatku, beliau bersabda: \"Hai Abu Hurairah!\" aku menyahut: Baik, wahai Rasulullah. Beliau bersabda: \"Ikutlah.\" Beliau pergi lalu aku mengikuti beliau, beliau masuk rumah lalu aku meminta izin masuk, beliau mengizinkanku, beliau menemukan wadah besar bersisi susu, beliau bertanya: \"Dari mana susu untuk kalian ini?\" dikatakan kepada beliau: Seseorang menghadiahkannya pada kita.\" Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Abu Hurairah!\" aku menyahut: Baik. Beliau bersabda: \"Pergilah ke ahlush shufah, panggil mereka, mereka adalah tamu-tamu orang Islam, mereka tidak punya tempat untuk menempatkan keluarga dan harta.\" Bila sedekah datang, beliau mengirimnya untuk mereka dan beliau tidak memakainya sama sekali, bila ada hadiah, beliau mengirimkannya untuk mereka dan beliau memakannya sedikit dan mengajak serta mereka. Hal itu mengusikku lalu aku berkata: Untuk apa wadah ini bagi ahlush shufah sementara aku utusan beliau untuk mereka, beliau akan memerintahkanku membagi-bagikannya pada mereka, mudah-mudahan beliau sedikit meminumnya dan aku berharap meminum sebagiannya secukupnya, tapi aku harus menaati Allah dan RasulNya. Aku mendatangi mereka dan memanggil mereka, saat mereka menemui beliau, mereka duduk lalu beliau bersabda: \"Abu Hurairah, ambil wadah itu lalu berikan pada mereka.\" Aku mengambil wadah lalu aku mengambilkan untuk seseorang, ia minum hingga puas lalu ia mengembalikannya, setelah itu aku mengambilkan untuk yang lain hingga tiba pada giliran Rasulullah Shallallahu 'alaihi wa Salam sementara mereka semua telah puas, setelah itu Rasulullah Shallallahu 'alaihi wa Salam mengambil wadah itu dan meletakkannya di atas tangan beliau, beliau menengadahkan kepala lalu bersabda: \"Abu Hurairah, minumlah.\" Aku minum lalu beliau bersabda: \"Minumlah.\" Aku terus minum, beliau bersabda: \"Minumlah\" hingga aku berkata: Demi Yang mengutusmu dengan kebenaran, aku tidak kuat lagi. Lalu beliau mengambil wadah itu, beliau memuji Allah, menyebut namba Allah lalu minum. Berkata Abu Isa: Hadits ini hasan shahih."
    },
    {
        "number": 2402,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ الْقُرَشِيُّ حَدَّثَنَا يَحْيَى الْبَكَّاءُ عَنْ ابْنِ عُمَرَ قَالَ تَجَشَّأَ رَجُلٌ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ كُفَّ عَنَّا جُشَاءَكَ فَإِنَّ أَكْثَرَهُمْ شِبَعًا فِي الدُّنْيَا أَطْوَلُهُمْ جُوعًا يَوْمَ الْقِيَامَةِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَفِي الْبَاب عَنْ أَبِي جُحَيْفَةَ",
        "id": "Telah menceritakan kepada kami Muhammad bin Humaid Ar Rozi telah bercerita kepada kami Abdul Aziz bin Abdullah Al Qurasyi telah bercerita kepada kami Yahya Al Bakka' dari Ibnu Umar berkata: Ada seorang lelaki bersendawa di sisi Nabi Shallallahu 'alaihi wa Salam, kemudian Nabi bersabda: \"Hentikan sendawamu dari kami karena sesungguhnya kebanyakan orang yang kekenyangan di dunia kelak pada hari kiamat adalah orang yang paling lama merasakan kelaparan.\" Abu Isa berkata: Hadits ini hasan gharib dari jalur sanad ini, dan dalam bab ini ada hadits dari Abu Juhaifah."
    },
    {
        "number": 2403,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى عَنْ أَبِيهِ قَالَ يَا بُنَيَّ لَوْ رَأَيْتَنَا وَنَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصَابَتْنَا السَّمَاءُ لَحَسِبْتَ أَنَّ رِيحَنَا رِيحُ الضَّأْنِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ وَمَعْنَى هَذَا الْحَدِيثِ أَنَّهُ كَانَ ثِيَابَهُمْ الصُّوفُ فَإِذَا أَصَابَهُمْ الْمَطَرُ يَجِيءُ مِنْ ثِيَابِهِمْ رِيحُ الضَّأْنِ",
        "id": "Telah menceritakan kepada kami Qutaibah telah bercerita kepada kami Abu 'Awanah dari Qotadah dari Abu Burdah bin Abu Musa dari bapaknya berkata: wahai anakku andai kamu melihat kami ketika kami bersama Rasulullah dan kami terkena air hujan, niscaya kamu akan mengira bahwa bau kami adalah seperti bau kambing. Abu Isa berkata: Hadits ini shahih, adapun makna hadits ini adalah bahwa pakaian mereka terbuat dari bulu domba dan jika terkena air hujan maka pakaian mereka mengeluarkan bau kambing."
    },
    {
        "number": 2404,
        "arab": "حَدَّثَنَا الْجَارُودُ بْنُ مُعَاذٍ حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ أَبِي حَمْزَةَ عَنْ إِبْرَاهِيمَ النَّخَعِيِّ قَالَ الْبِنَاءُ كُلُّهُ وَبَالٌ قُلْتُ أَرَأَيْتَ مَا لَا بُدَّ مِنْهُ قَالَ لَا أَجْرَ وَلَا وِزْرَ",
        "id": "Telah menceritakan kepada kami Al Jarud bin Mu'adz telah menceritakan kepada kami Al Fadll bin Musa dari Sufyan Ats Tsauri dari Abu Hamzah dari Ibrahim An Nakha'i berkata: Bangunan seluruhnya adalah bencana. Aku berkata: bagaimana pendapatmu jika tidak ada pilihan lain? Ia menjawab: Tidak ada pahala dan dosanya."
    },
    {
        "number": 2405,
        "arab": "حَدَّثَنَا عَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ عَنْ أَبِي مَرْحُومٍ عَبْدِ الرَّحِيمِ بْنِ مَيْمُونٍ عَنْ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ الْجُهَنِيِّ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ تَرَكَ اللِّبَاسَ تَوَاضُعًا لِلَّهِ وَهُوَ يَقْدِرُ عَلَيْهِ دَعَاهُ اللَّهُ يَوْمَ الْقِيَامَةِ عَلَى رُءُوسِ الْخَلَائِقِ حَتَّى يُخَيِّرَهُ مِنْ أَيِّ حُلَلِ الْإِيمَانِ شَاءَ يَلْبَسُهَا هَذَا حَدِيثٌ حَسَنٌ وَمَعْنَى قَوْلِهِ حُلَلِ الْإِيمَانِ يَعْنِي مَا يُعْطَى أَهْلُ الْإِيمَانِ مِنْ حُلَلِ الْجَنَّةِ",
        "id": "Telah menceritakan kepada kami Abbas bin Muhammad Ad Dauri telah menceritakan kepada kami Abdullah bin Yazid Al Muqri` telah menceritakan kepada kami Sa'id ibn Abu Ayyub dari Abu Marhum 'Abdur Rahim bin Maimun dari Sahal bin Mu'adz bin Anas Al Juhani dari ayahnya, Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Barangsiapa meninggalkan pakaian (mewah) karena merendah kepada Allah padahal ia mampu, Allah akan memanggilnya pada hari kiamat di hadapan semua makhluk hingga Ia mempersilahkan untuk memilih pakaian dari perihasan mana saja yang ia mau.\" Hadits ini hasan dan makna sabda: \"Perhiasan iman\" adalah perhiasan surga yang diberikan kepada ahli iman."
    },
    {
        "number": 2406,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ حَدَّثَنَا زَافِرُ بْنُ سُلَيْمَانَ عَنْ إِسْرَائِيلَ عَنْ شَبِيبِ بْنِ بَشِيرٍ هَكَذَا قَالَ شَبِيبُ بْنُ بَشِيرٍ وَإِنَّمَا هُوَ شَبِيبُ بْنُ بِشْرٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّفَقَةُ كُلُّهَا فِي سَبِيلِ اللَّهِ إِلَّا الْبِنَاءَ فَلَا خَيْرَ فِيهِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami Muhammad bin Humaid Ar Rozi telah bercerita kepada kami Zafir bin Sulaiman dari Isra'il dari Syabib bin Basyir seperti ini, berkata Syabib bin Basyir - dia adalah Syabib bin Bisyr- dari Anas bin Malik berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Semua nafkah adalah di jalan Allah kecuali untuk bangunan maka tidak ada kebaikan di dalamnya.\" Abu Isa berkata: Hadits ini gharib."
    },
    {
        "number": 2407,
        "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ حَارِثَةَ بْنِ مُضَرِّبٍ قَالَ أَتَيْنَا خَبَّابًا نَعُودُهُ وَقَدْ اكْتَوَى سَبْعَ كَيَّاتٍ فَقَالَ لَقَدْ تَطَاوَلَ مَرَضِي وَلَوْلَا أَنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ لَا تَمَنَّوْا الْمَوْتَ لَتَمَنَّيْتُ وَقَالَ يُؤْجَرُ الرَّجُلُ فِي نَفَقَتِهِ كُلِّهَا إِلَّا التُّرَابَ أَوْ قَالَ فِي الْبِنَاءِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami Ali bin Hujr telah bercerita kepada kami Syarik dari Abu Ishaq dari Haritsah bin Mudlarrib berkata: Kami datang menjenguk Khabbab karena dia telah berobat dengan menempelkan besi panas ke bagian yang sakit sebanyak empat kali, lalu dia berkata: sakitku sudah cukup lama seandainya aku tidak mendengar bahwa Rasulullah Shallallahu 'alaihi wa Salam pernah bersabda: \"Janganlah kalian berangan angan untuk mati, \" niscaya aku sudah berangan angan, dan beliau bersabda: \"Seseorang akan diberi balasan pahala dalam semua nafkahnya selain tanah, \" atau beliau bersabda: \"Dalam nafkah untuk bangunan.\" Abu Isa berkata: Hadits ini hasan shahih."
    },
    {
        "number": 2408,
        "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ حَدَّثَنَا خَالِدُ بْنُ طَهْمَانَ أَبُو الْعَلَاءِ حَدَّثَنَا حُصَيْنٌ قَالَ جَاءَ سَائِلٌ فَسَأَلَ ابْنَ عَبَّاسٍ فَقَالَ ابْنُ عَبَّاسٍ لِلسَّائِلِ أَتَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ قَالَ نَعَمْ قَالَ أَتَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ قَالَ نَعَمْ قَالَ وَتَصُومُ رَمَضَانَ قَالَ نَعَمْ قَالَ سَأَلْتَ وَلِلسَّائِلِ حَقٌّ إِنَّهُ لَحَقٌّ عَلَيْنَا أَنْ نَصِلَكَ فَأَعْطَاهُ ثَوْبًا ثُمَّ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَا مِنْ مُسْلِمٍ كَسَا مُسْلِمًا ثَوْبًا إِلَّا كَانَ فِي حِفْظٍ مِنْ اللَّهِ مَا دَامَ مِنْهُ عَلَيْهِ خِرْقَةٌ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ",
        "id": "Telah menceritakan kepada kami Mahmud bin Ghailan telah bercerita kepada kami Abu Ahmad Az Zubairi telah bercerita kepada kami Khalid bin Thahman Abul 'Ala` telah bercerita kepada kami Hushain berkata: Seorang pengemis datang kemudian meminta kepada Ibnu Abbas, Ibnu Abbas berkata kepada si pengemis: Apakah kamu bersaksi bahwa tidak ada Ilah (yang berhak disembah) kecuali Allah? dia menjawab: Ya. Ibnu Abbas bertanya lagi: Apakah kamu bersaksi bahwa Muhammad adalah utusan Allah? dia menjawab: Ya. Ibnu abbas bertanya: Apakah kamu puasa ramadlon? dia menjawab: Ya. Ibnu Abbas berkata: Kamu telah meminta dan bagi peminta ada haq dan sesungguhnya menjadi hak kami untuk menyambungmu, \" lalu Ibnu Abbas memberinya pakaian dan berkata: Aku telah mendengar Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Tidaklah seorang muslim memberikan pakaian kepada muslim yang lain melainkan dia akan selalu berada dalam perlindungan Allah selama masih ada sehelai kain padanya.\" Abu Isa berkata: Hadits ini hasan gharib dari jalur sanad ini."
    },
    {
        "number": 2409,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ وَمُحَمَّدُ بْنُ جَعْفَرٍ وَابْنُ أَبِي عَدِيٍّ وَيَحْيَى بْنُ سَعِيدٍ عَنْ عَوْفِ بْنِ أَبِي جَمِيلَةَ الْأَعْرَابِيِّ عَنْ زُرَارَةَ بْنِ أَوْفَى عَنْ عَبْدِ اللَّهِ بْنِ سَلَامٍ قَالَ لَمَّا قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ انْجَفَلَ النَّاسُ إِلَيْهِ وَقِيلَ قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدِمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَجِئْتُ فِي النَّاسِ لِأَنْظُرَ إِلَيْهِ فَلَمَّا اسْتَثْبَتُّ وَجْهَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَرَفْتُ أَنَّ وَجْهَهُ لَيْسَ بِوَجْهِ كَذَّابٍ وَكَانَ أَوَّلُ شَيْءٍ تَكَلَّمَ بِهِ أَنْ قَالَ أَيُّهَا النَّاسُ أَفْشُوا السَّلَامَ وَأَطْعِمُوا الطَّعَامَ وَصَلُّوا وَالنَّاسُ نِيَامٌ تَدْخُلُوا الْجَنَّةَ بِسَلَامٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami Muhammad bin Basyar telah bercerita kepada kami 'Abdul Wahhab Ats Tsaqafi, Muhammad bin Ja'far, Ibnu Abi 'Adi dan Yahya bin Sa'id dari 'Auf bin Abu jamilah Al A'rabi dari Zurarah bin Aufa dari Abdullah bin Salam berkata: Ketika Rasulullah Shallallahu 'alaihi wa Salam tiba di Madinah, orang-orang bergegas menyambut beliau sambil mengucapkan: Rasulullah Shallallahu 'alaihi wa Salam datang, Rasulullah Shallallahu 'alaihi wa Salam datang, Rasulullah Shallallahu 'alaihi wa Salam datang, \" aku mendatangi orang orang untuk melihat mereka, dan ketika aku telah memastikan wajah Rasulullah Shallallahu 'alaihi wa Salam aku baru faham bahwa wajah beliau bukanlah wajah wajah pendusta, dan yang pertama kali beliau ucapkan adalah: \"Wahai sekalian manusia, sebarkanlah salam, berikanlah makanan dan laksanakanlah shalat pada saat manusia tertidur nisacaya kalian masuk surga dengan selamat.\" Abu Isa berkata: Hadits ini shahih."
    },
    {
        "number": 2410,
        "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مُوسَى الْأَنْصَارِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ مَعْنٍ الْمَدَنِيُّ الْغِفَارِيُّ حَدَّثَنِي أَبِي عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الطَّاعِمُ الشَّاكِرُ بِمَنْزِلَةِ الصَّائِمِ الصَّابِرِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami Ishaq bin Musa Al Anshari telah bercerita kepada kami Muhammad bin Ma'nu Al Madani Al Ghifari telah bercerita kepada kami bapakku dari Sa'id Al Maqburi dari Abu Hurairah dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Orang yang makan dan pandai bersyukur seperti derajat orang yang berpuasa dan penyabar.\" Abu Isa berkata: Hadits ini hasan gharib."
    },
    {
        "number": 2411,
        "arab": "حَدَّثَنَا الْحُسَيْنُ بْنُ الْحَسَنِ الْمَرْوَزِيُّ بِمَكَّةَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ حَدَّثَنَا حُمَيْدٌ عَنْ أَنَسٍ قَالَ لَمَّا قَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ أَتَاهُ الْمُهَاجِرُونَ فَقَالُوا يَا رَسُولَ اللَّهِ مَا رَأَيْنَا قَوْمًا أَبْذَلَ مِنْ كَثِيرٍ وَلَا أَحْسَنَ مُوَاسَاةً مِنْ قَلِيلٍ مِنْ قَوْمٍ نَزَلْنَا بَيْنَ أَظْهُرِهِمْ لَقَدْ كَفَوْنَا الْمُؤْنَةَ وَأَشْرَكُونَا فِي الْمَهْنَإِ حَتَّى لَقَدْ خِفْنَا أَنْ يَذْهَبُوا بِالْأَجْرِ كُلِّهِ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا مَا دَعَوْتُمْ اللَّهَ لَهُمْ وَأَثْنَيْتُمْ عَلَيْهِمْ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ",
        "id": "Telah menceritakan kepada kami Al Husain bin Al Hasan Al Marwazi di Makkah, telah menceritakan kepada kami Ibnu Abi 'Adi telah menceritakan kepada kami Humaid dari Anas berkata: Saat nabi Shallallahu 'alaihi wa Salam tiba di Madinah, kaum muhajirin mendatangi beliau, mereka berkata: Wahai Rasulullah, kami tidak melihat suatu kaum yang lebih banyak berkorban ketika harta melimpah, dan tidak pula lebih banyak menolong ketika dalam keterbatasan, daripada kaum yang kami tinggal di tengah-tengah mereka, mereka mencukupi beban hidup kami, dan mereka menyertakan kami dalam hasil tanaman hingga kami khawatir mereka memborong semua pahala. Nabi Shallallahu 'alaihi wa Salam bersabda: \"Tidak, selama kalian berdoa kepada Allah untuk mereka dan kalian sanjung mereka.\" Berkata Abu Isa: Hadits ini hasan shahih g harib melalui jalur sanad ini."
    },
    {
        "number": 2412,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا عَبْدَةُ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ مُوسَى بْنِ عُقْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو الْأَوْدِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا أُخْبِرُكُمْ بِمَنْ يَحْرُمُ عَلَى النَّارِ أَوْ بِمَنْ تَحْرُمُ عَلَيْهِ النَّارُ عَلَى كُلِّ قَرِيبٍ هَيِّنٍ سَهْلٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami Hannad telah menceritakan kepada kami 'Abdah dari Hisyam bin Urwah dari Musa bin 'Uqbah dari Abdullah bin Amru Al Audi dari Abdullah bin Mas'ud berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Maukah kalian aku beritahu orang yang haram bagi neraka atau orang yang diharamkan bagi neraka: semua kerabat yang mudah lagi gampang.\" Berkata Abu Isa: Hadits ini hasan gharib."
    },
    {
        "number": 2413,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا وَكِيعٌ عَنْ شُعْبَةَ عَنْ الْحَكَمِ عَنْ إِبْرَاهِيمَ عَنْ الْأَسْوَدِ بْنِ يَزِيدَ قَالَ قُلْتُ لِعَائِشَةَ أَيُّ شَيْءٍ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ إِذَا دَخَلَ بَيْتَهُ قَالَتْ كَانَ يَكُونَ فِي مَهْنَةِ أَهْلِهِ فَإِذَا حَضَرَتْ الصَّلَاةُ قَامَ فَصَلَّى قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami Hannad telah menceritakan kepada kami Waki' dari Syu'bah dari Al Hakam dari Ibrahim dari Al Aswad bin Yazid berkata: Aku bertanya kepada Aisyah: Apa yang dilakukan Nabi Shallallahu 'alaihi wa Salam saat masuk rumah? Ia menjawab: Beliau mengerjakan pekerjaan keluarganya dan bila tiba (waktu shalat), beliau beranjak untuk shalat. Berkata Abu Isa: Hadits ini hasan shahih."
    },
    {
        "number": 2414,
        "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ عِمْرَانَ بْنِ زَيْدٍ التَّغْلَبِيِّ عَنْ زَيْدٍ الْعَمِّيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَقْبَلَهُ الرَّجُلُ فَصَافَحَهُ لَا يَنْزِعُ يَدَهُ مِنْ يَدِهِ حَتَّى يَكُونَ الرَّجُلُ يَنْزِعُ وَلَا يَصْرِفُ وَجْهَهُ عَنْ وَجْهِهِ حَتَّى يَكُونَ الرَّجُلُ هُوَ الَّذِي يَصْرِفُهُ وَلَمْ يُرَ مُقَدِّمًا رُكْبَتَيْهِ بَيْنَ يَدَيْ جَلِيسٍ لَهُ قَالَ هَذَا حَدِيثٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami Suwaid bin Nashr telah bercerita kepada kami Abdullah bin Al Mubarak dari Imran bin Zaid At Taghlibi dari Zaid Al 'Ammi dari Anas bin Malik berkata: Apabila ada seseorang menemui Nabi shallallahu 'alaihi wa salam lalu berjabat tangan dengannya, beliau tidak melepaskan jabatan tangannya sampai lelaki tadi yang melepaskannya terlebih dahulu, dan beliau tidak memalingkan wajahnya dari wajah orang yang menemuinya sampai lelaki itu yang terlebih dahulu memalingkan wajahnya, dan beliau tidak pernah terlihat mengedepankan kedua lututnya di hadapan para sahabatnya. Berkata Abu Isa: Hadits ini gharib."
    },
    {
        "number": 2415,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَرَجَ رَجُلٌ مِمَّنْ كَانَ قَبْلَكُمْ فِي حُلَّةٍ لَهُ يَخْتَالُ فِيهَا فَأَمَرَ اللَّهُ الْأَرْضَ فَأَخَذَتْهُ فَهُوَ يَتَجَلْجَلُ فِيهَا أَوْ قَالَ يَتَلَجْلَجُ فِيهَا إِلَى يَوْمِ الْقِيَامَةِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami Hannad telah menceritakan kepada kami Abu Al Ahwash dari 'Atho` bin As Sa`ib dari ayahnya dari Abdullah bin Amru, Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Dahulu sebelum kalian ada seseorang memakai perhiasan miliknya, ia menyombongkannya lalu Allah memerintahkan bumi untuk menelannya dan orang itu terus meronta-ronta dalam tanah-atau bersabda: meronta-ronta hingga lebih dalam- hingga hari kiamat.\" Berkata Abu Isa: Hadits ini shahih."
    },
    {
        "number": 2416,
        "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُحْشَرُ الْمُتَكَبِّرُونَ يَوْمَ الْقِيَامَةِ أَمْثَالَ الذَّرِّ فِي صُوَرِ الرِّجَالِ يَغْشَاهُمْ الذُّلُّ مِنْ كُلِّ مَكَانٍ فَيُسَاقُونَ إِلَى سِجْنٍ فِي جَهَنَّمَ يُسَمَّى بُولَسَ تَعْلُوهُمْ نَارُ الْأَنْيَارِ يُسْقَوْنَ مِنْ عُصَارَةِ أَهْلِ النَّارِ طِينَةَ الْخَبَالِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami Suwaid bin Nashr telah mengkhabarkan kepada kami Abdullah bin Al Mubarak dari Muhammad bin 'Ajlan dari Amru bin Syu'aib dari ayahnya dari kakeknya dari nabi Shallallahu 'alaihi wa Salam bersabda: \"Orang-orang sombong dikumpulkan pada hari kiamat seperti semut bermuka manusia, mereka dilputi kehinaan dari segala penjuru, mereka digiring menuju penjara di neraka jahanam yang bernama Bulas, di atas mereka ada api paling panas, mereka di minumi muntahan dan darah penduduk neraka yang namanya thinatul khabal.\" Berkata Abu Isa: Hadits ini hasan shahih."
    },
    {
        "number": 2417,
        "arab": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ وَعَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ قَالَا حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ حَدَّثَنِي أَبُو مَرْحُومٍ عَبْدُ الرَّحِيمِ بْنُ مَيْمُونٍ عَنْ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَظَمَ غَيْظًا وَهُوَ يَقْدِرُ عَلَى أَنْ يُنَفِّذَهُ دَعَاهُ اللَّهُ عَلَى رُءُوسِ الْخَلَائِقِ يَوْمَ الْقِيَامَةِ حَتَّى يُخَيِّرَهُ فِي أَيِّ الْحُورِ شَاءَ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami 'Abd bin Humaid dan Abbas bin Muhammad Ad Duri keduanya berkata: telah menceritakan kepada kami Abdullah bin Yazid Al Muqri` telah menceritakan kepada kami Sa'id bin Abu Ayyub telah menceritakan kepadaku Abu Marhum 'Abdur Rahim bin Maimun dari Sahal bin Mu'adz bin Anas dari ayahnya, nabi Shallallahu 'alaihi wa Salam bersabda: \"Barangsiapa menahan marah padahal ia mampu untuk melampiaskannya, Allah akan memanggilnya di hadapan seluruh makhluk pada hari kiamat, ia dipersilahkan memilih bidadari semaunya.\" Berkata Abu Isa: Hadits ini hasan gharib."
    },
    {
        "number": 2418,
        "arab": "حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِبْرَاهِيمَ الْغِفَارِيُّ الْمَدَنِيُّ حَدَّثَنِي أَبِي عَنْ أَبِي بَكْرِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثٌ مَنْ كُنَّ فِيهِ سَتَرَ اللَّهُ عَلَيْهِ كَنَفَهُ وَأَدْخَلَهُ جَنَّتَهُ رِفْقٌ بِالضَّعِيفِ وَشَفَقَةٌ عَلَى الْوَالِدَيْنِ وَإِحْسَانٌ إِلَى الْمَمْلُوكِ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَأَبُو بَكْرِ بْنُ الْمُنْكَدِرِ هُوَ أَخُو مُحَمَّدُ بْنُ الْمُنْكَدِرِ",
        "id": "Telah menceritakan kepada kami Salamah bin Syabib telah bercerita kepada kami Abdullah bin Ibrahim Al Ghifari Al Madani telah bercerita kepada kami bapakku dari Abu Bakar bin Al Munkadir dari Jabir berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Ada tiga hal barangsiapa melakukannya niscaya Allah akan menutupi aibnya dan memasukkannya ke dalam surgaNya: lemah lembut terhadap orang orang yang lemah, belas kasihan kepada kedua orang tua dan berbuat baik kepada para budak.\" Dia berkata: Hadits ini hasan gharib, adapun Abu Bakar bin Al Munkadir dia adalah saudaranya Muhammad bin Al Munkadir."
    },
    {
        "number": 2419,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ لَيْثٍ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ عَنْ أَبِي ذَرٍّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ اللَّهُ تَعَالَى يَا عِبَادِي كُلُّكُمْ ضَالٌّ إِلَّا مَنْ هَدَيْتُهُ فَسَلُونِي الْهُدَى أَهْدِكُمْ وَكُلُّكُمْ فَقِيرٌ إِلَّا مَنْ أَغْنَيْتُ فَسَلُونِي أَرْزُقْكُمْ وَكُلُّكُمْ مُذْنِبٌ إِلَّا مَنْ عَافَيْتُ فَمَنْ عَلِمَ مِنْكُمْ أَنِّي ذُو قُدْرَةٍ عَلَى الْمَغْفِرَةِ فَاسْتَغْفَرَنِي غَفَرْتُ لَهُ وَلَا أُبَالِي وَلَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَحَيَّكُمْ وَمَيِّتَكُمْ وَرَطْبَكُمْ وَيَابِسَكُمْ اجْتَمَعُوا عَلَى أَتْقَى قَلْبِ عَبْدٍ مِنْ عِبَادِي مَا زَادَ ذَلِك فِي مُلْكِي جَنَاحَ بَعُوضَةٍ وَلَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَحَيَّكُمْ وَمَيِّتَكُمْ وَرَطْبَكُمْ وَيَابِسَكُمْ اجْتَمَعُوا عَلَى أَشْقَى قَلْبِ عَبْدٍ مِنْ عِبَادِي مَا نَقَصَ ذَلِكَ مِنْ مُلْكِي جَنَاحَ بَعُوضَةٍ وَلَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَحَيَّكُمْ وَمَيِّتَكُمْ وَرَطْبَكُمْ وَيَابِسَكُمْ اجْتَمَعُوا فِي صَعِيدٍ وَاحِدٍ فَسَأَلَ كُلُّ إِنْسَانٍ مِنْكُمْ مَا بَلَغَتْ أُمْنِيَّتُهُ فَأَعْطَيْتُ كُلَّ سَائِلٍ مِنْكُمْ مَا سَأَلَ مَا نَقَصَ ذَلِكَ مِنْ مُلْكِي إِلَّا كَمَا لَوْ أَنَّ أَحَدَكُمْ مَرَّ بِالْبَحْرِ فَغَمَسَ فِيهِ إِبْرَةً ثُمَّ رَفَعَهَا إِلَيْهِ ذَلِكَ بِأَنِّي جَوَادٌ مَاجِدٌ أَفْعَلُ مَا أُرِيدُ عَطَائِي كَلَامٌ وَعَذَابِي كَلَامٌ إِنَّمَا أَمْرِي لِشَيْءٍ إِذَا أَرَدْتُهُ أَنْ أَقُولَ لَهُ كُنْ فَيَكُونُ قَالَ هَذَا حَدِيثٌ حَسَنٌ وَرَوَى بَعْضُهُمْ هَذَا الْحَدِيثَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ مَعْدِي كَرِبَ عَنْ أَبِي ذَرٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
        "id": "Telah menceritakan kepada kami Hanad telah menceritakan kepada kami Abu Al Ahwash dari Laits dari Syahr bin Hausyab dari Abdurrahman bin Ghanm dari Abu Dzarr berkata: Rasulullah shallallahu 'alaihi wa salam bersabda: \"Allah Ta'ala berfirman: Hai hamba-hambaKu, kalian semua tersesat kecuali yang aku beri petunjuk, mintalah petunjuk padaKu niscaya Aku akan menuntunmu, kalian semua fakir kecuali yang Aku cukupi, mintalah padaku niscaya Aku memberimu rizki, kalian semua pendosa kecuali yang Aku ampuni, barangsiapa diantara kalian yang mengetahui bahwa Aku memiliki kemampuan untuk mengampuni, mintalah ampunan padaKu, niscaya Aku ampuni dan Aku tidak perduli, andai orang-orang pertama dan akhir kalian, yang hidup dan yang mati, yang basah dan yang kering berkumpul di atas hati seorang hambaKu yang paling bertakwa, itu sama sekali tidak bisa menambah sedikitpun kekuasaanKu sekalipun sebesar sayap nyamuk, andai orang-orang pertama dan akhir kalian, yang hidup dan yang mati, yang basah dan yang kering berkumpul di atas hati seorang hambaKu yang paling bejat (brengsek), itu tidak mengurangi sedikitpun kekuasaanKu sekalipun hanya sebesar sayap nyamuk, andai orang-orang pertama dan akhir kalian, yang hidup dan yang mati, yang basah dan yang kering berkumpul di atas tanah luas lalu masing-masing dari kalian meminta sebatas keinginannya lalu Aku memberi masing-masing yang meminta, itu tidak mengurangi kekuasaanKu selain hanyalah bagaikan bila salah seorang dari kalian melintasi laut lalu mencelupkan jarum lalu di angkatnya, itu karena Aku Maha Mulia lagi Terpuji, Aku berbuat sekehendak-Ku, pemberianKu adalah kalam dan adzabKu adalah kalam, sesungguhnya bila Aku menginginkan sesuatu, Aku cukup berfirman: 'Jadilah, ia pun jadi.'\" Berkata Abu Isa: Hadits ini hasan. Sebagian dari mereka meriwayatkan hadits ini dari Syahr bin Husyab dari Ma'di Karib dari Abu Dzarr dari Nabi shallallahu 'alaihi wa salam sepertinya."
    },
    {
        "number": 2420,
        "arab": "حَدَّثَنَا عُبَيْدُ بْنُ أَسْبَاطِ بْنِ مُحَمَّدٍ الْقُرَشِيُّ حَدَّثَنَا أَبِي حَدَّثَنَا الْأَعْمَشُ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ الرَّازِيِّ عَنْ سَعْدٍ مَوْلَى طَلْحَةَ عَنْ ابْنِ عُمَرَ قَالَ سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحَدِّثُ حَدِيثًا لَوْ لَمْ أَسْمَعْهُ إِلَّا مَرَّةً أَوْ مَرَّتَيْنِ حَتَّى عَدَّ سَبْعَ مَرَّاتٍ وَلَكِنِّي سَمِعْتُهُ أَكَثَرَ مِنْ ذَلِكَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ كَانَ الْكِفْلُ مِنْ بَنِي إِسْرَائِيلَ لَا يَتَوَرَّعُ مِنْ ذَنْبٍ عَمِلَهُ فَأَتَتْهُ امْرَأَةٌ فَأَعْطَاهَا سِتِّينَ دِينَارًا عَلَى أَنْ يَطَأَهَا فَلَمَّا قَعَدَ مِنْهَا مَقْعَدَ الرَّجُلِ مِنْ امْرَأَتِهِ أَرْعَدَتْ وَبَكَتْ فَقَالَ مَا يُبْكِيكِ أَأَكْرَهْتُكِ قَالَتْ لَا وَلَكِنَّهُ عَمَلٌ مَا عَمِلْتُهُ قَطُّ وَمَا حَمَلَنِي عَلَيْهِ إِلَّا الْحَاجَةُ فَقَالَ تَفْعَلِينَ أَنْتِ هَذَا وَمَا فَعَلْتِهِ اذْهَبِي فَهِيَ لَكِ وَقَالَ لَا وَاللَّهِ لَا أَعْصِي اللَّهَ بَعْدَهَا أَبَدًا فَمَاتَ مِنْ لَيْلَتِهِ فَأَصْبَحَ مَكْتُوبًا عَلَى بَابِهِ إِنَّ اللَّهَ قَدْ غَفَرَ لِلْكِفْلِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ قَدْ رَوَاهُ شَيْبَانُ وَغَيْرُ وَاحِدٍ عَنْ الْأَعْمَشِ نَحْوَ هَذَا وَرَفَعُوهُ وَرَوَى بَعْضُهُمْ عَنْ الْأعْمَشِ فَلَمْ يَرْفَعْهُ وَرَوَى أَبُو بَكْرِ بْنُ عَيَّاشٍ هَذَا الْحَدِيثَ عَنْ الْأَعْمَشِ فَأَخْطَأَ فِيهِ وَقَالَ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عُمَرَ وَهُوَ غَيْرُ مَحْفُوظٍ وَعَبْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ الرَّازِيُّ هُوَ كُوفِيٌّ وَكَانَتْ جَدَّتُهُ سُرِّيَّةً لِعَلِيِّ بْنِ أَبِي طَالِبٍ وَرَوَى عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ الرَّازِيِّ عُبَيْدَةُ الضَّبِّيُّ وَالْحَجَّاجُ بْنُ أَرْطَاةَ وَغَيْرُ وَاحِدٍ مِنْ كِبَارِ أَهْلِ الْعِلْمِ",
        "id": "Telah menceritakan kepada kami 'Ubaid bin Asbath bin Muhammad Al Qurasy telah menceritakan kepada kami ayahku telah menceritakan kepada kami Al A'masy dari Abdullah bin Abdullah Ar Razi d dari Sa'ad, budak Thalhah dari Ibnu Umar berkata: Aku mendengar Rasulullah Shallallahu 'alaihi wa Salam menceritakan suatu hadits, aku hanya mendengarnya sekali atau dua kali -hingga ia menyebut tujuh kali- tapi aku mendengarnya lebih dari itu, aku pernah mendengar Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Ada seorang tukang jaga (semacam satpam) dari bani Isra`il yang tidak pernah menjaga diri dari dosa yang ia perbuat, lalu seorang wanita mendatanginya, ia memberikan enampuluh dinar kepada wanita itu dengan imbalan ia menyetubuhinya. Saat ia menduduki wanita itu layaknya seorang suami menduduki istrinya, wanita itu gemetar dan menangis. Si satpam bertanya: Apa yang membuatmu menangis, apa aku memaksamu? Wanita itu menjawab: Tidak, tapi itu adalah perbuatan yang sama sekali belum pernah aku lakukan dan yang menyebabkanku melakukannya karena aku terhimpit kebutuhan.\" Si satpam itu bertanya: Kau melakukanya sementara kau belum pernah melakukan sebelumnya?, pergilah, uang itu untukmu. Setelah itu orang itu berkata: Tidak, demi Allah aku tidak akan mendurhakai Allah setelahnya selamanya.\" Ia mati pada malam harinya dan di pagi harinya tertulis di pintunya: Allah telah mengampuni si pengasuh.\" Berkata Abu Isa: Hadits hasan. Syaiban dan yang lain meriwayatkannya dari Al A'masy seperti ini dan mereka memarfu'kannya. Sebagaian lainnya meriwayatkan dari Al A'masy tapi tidak dimarfu'kan. Abu Bakar bin 'Ayyasy meriwayatkan hadits ini dari Al A'masy tapi salah, ia berkata: Dari Abdullah bin Abdullah dari Sa'id bin Jubair dari Ibnu Umar, sanad ini tidak mahfudz dan Abdullah bin Abdullah Ar Razi adalah orang Kufah, neneknya adalah pemegang rahasia Ali bin Abi Thalib. 'Ubaidah Adl Dlabyi, Hajjaj bin Arthah dan lainnya meriwayatkan dari Abdullah bin Abdullah Ar Razi dari para pembesar ahlul ilmi."
    },
    {
        "number": 2421,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ عُمَارَةَ بْنِ عُمَيْرٍ عَنْ الْحَارِثِ بْنِ سُوَيْدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْعُودٍ بِحَدِيثَيْنِ أَحَدِهِمَا عَنْ نَفْسِهِ وَالْآخَرِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ عَبْدُ اللَّهِ إِنَّ الْمُؤْمِنَ يَرَى ذُنُوبَهُ كَأَنَّهُ فِي أَصْلِ جَبَلٍ يَخَافُ أَنْ يَقَعَ عَلَيْهِ وَإِنَّ الْفَاجِرَ يَرَى ذُنُوبَهُ كَذُبَابٍ وَقَعَ عَلَى أَنْفِهِ قَالَ بِهِ هَكَذَا فَطَارَ",
        "id": "Telah menceritakan kepada kami Hannad telah menceritakan kepada kami Abu Mu'awiyah dari Al A'masy dari Umarah bin 'Umair dari Al Harits bin Suwaid telah menceritakan kepada kami Abdullah bin Mas'ud dua hadits, salah satunya dari dia dan yang lain dari nabi Shallallahu 'alaihi wa Salam, berkata Abdullah: Sesungguhnya orang mu`min menilai dosa-dosanyanya sepertinya ia berada di bawah gunung, ia khawatir gunung itu meruntuhinya, sebaliknya orang keji menilai dosa-dosanya seperti lalat yang menempel di hidungnya. Ia berkata \"Ah Cuma kayak begini, lalu terbang."
    },
    {
        "number": 2422,
        "arab": "قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَلَّهُ أَفْرَحُ بِتَوْبَةِ أَحَدِكُمْ مِنْ رَجُلٍ بِأَرْضِ فَلَاةٍ دَوِيَّةٍ مَهْلَكَةٍ مَعَهُ رَاحِلَتُهُ عَلَيْهَا زَادُهُ وَطَعَامُهُ وَشَرَابُهُ وَمَا يُصْلِحُهُ فَأَضَلَّهَا فَخَرَجَ فِي طَلَبِهَا حَتَّى إِذَا أَدْرَكَهُ الْمَوْتُ قَالَ أَرْجِعُ إِلَى مَكَانِي الَّذِي أَضْلَلْتُهَا فِيهِ فَأَمُوتُ فِيهِ فَرَجَعَ إِلَى مَكَانِهِ فَغَلَبَتْهُ عَيْنُهُ فَاسْتَيْقَظَ فَإِذَا رَاحِلَتُهُ عِنْدَ رَأْسِهِ عَلَيْهَا طَعَامُهُ وَشَرَابُهُ وَمَا يُصْلِحُهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِيهِ عَنْ أَبِي هُرَيْرَةَ وَالنُّعْمَانِ بْنِ بَشِيرٍ وَأَنَسِ بْنِ مَالِكٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
        "id": "(Telah menceritakan kepada kami Hannad telah menceritakan kepada kami Abu Mu'awiyah dari Al A'masy dari Umarah bin 'Umair dari Al Harits bin Suwaid telah menceritakan kepada kami Abdullah berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Sungguh Allah lebih senang terhadap taubat salah seorang dari kalian melebihi seseorang yang ada di padang tandus gersang, ia bersama tunggangannya, diatasnya ada perbekalan, makanan, minuman serta keperluannya lalu ia kehilangan kendaraan tungangannya, ia pergi mencari-carinya hingga kematian menghampirinya, ia berkata: Kembalikan aku ke tempat aku kehilangan dia, biarlah aku akan mati di sana. Ia kembali ke tempatnya lalu mengantuk lalu tidur kemudian bangun, ternyata kendaraannya ada di dekat kepalanya, lengkap dengan makanan, minuman dan perbekalannya.\" Berkata Abu Isa: Hadits ini hasan shahih dan dalam hal ini ada hadits serupa dari Abu Hurairah, An Nu'man bin Basyir dan Anas bin Malik dari nabi Shallallahu 'alaihi wa Salam."
    },
    {
        "number": 2423,
        "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ حَدَّثَنَا عَلِيُّ بْنُ مَسْعَدَةَ الْبَاهِلِيُّ حَدَّثَنَا قَتَادَةُ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ كُلُّ ابْنِ آدَمَ خَطَّاءٌ وَخَيْرُ الْخَطَّائِينَ التَّوَّابُونَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ عَلِيِّ بْنِ مَسْعَدَةَ عَنْ قَتَادَةَ",
        "id": "Telah menceritakan kepada kami Ahmad bin Mani' telah menceritakan kepada kami Zaid bin Hubab telah menceritakan kepada kami Ali bin Mas'adah Al Bahili telah menceritakan kepada kami Qatadah dari Anas nabi Shallallahu 'alaihi wa Salam bersabda: \"Semua anak cucu Adam banyak salah dan sebaik-baik orang yang bersalah adalah mereka yang bertaubat.\" Berkata Abu Isa: Hadits ini gharib, kami hanya mengetahuinya dari hadits Ali bin Mas'adah dari Qatadah."
    },
    {
        "number": 2424,
        "arab": "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ وَفِي الْبَاب عَنْ عَائِشَةَ وَأَنَسٍ وَأَبِي شُرَيْحٍ الْعَدَوِيِّ الْكَعْبِيِّ الْخُزَاعِيِّ وَاسْمُهُ خُوَيْلِدُ بْنُ عَمْرٍو",
        "id": "Telah menceritakan kepada kami Suwaid telah mengkhabarkan kepada kami Abdullah bin Al Mubarak dari Ma'mar dari Az Zuhri dari Abu Salamah dari Abu Hurairah dari nabi Shallallahu 'alaihi wa Salam bersabda: \"Barangsiapa beriman kepada Allah dan hari akhir hendaklah memuliakan tamunya dan barangsiapa beriman kepada Allah dan hari akhir hendaklah mengatakan kebaikan atau diam.\" Berkata Abu Isa: Hadits ini shahih. Dalam hal ini ada hadits serupa dari Aisyah, Anas dan Abu Syuraih Al 'Adawi Al Ka'bi Al Khuza'I namanya Khuwailid bin Amru."
    },
    {
        "number": 2425,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ يَزِيدَ بْنِ عَمْرٍو الْمَعَافِرِيِّ عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَمَتَ نَجَا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ ابْنِ لَهِيعَةَ وَأَبُو عَبْدِ الرَّحْمَنِ الْحُبُلِيُّ هُوَ عَبْدُ اللَّهِ بْنُ يَزِيدَ",
        "id": "Telah menceritakan kepada kami Qutaibah telah menceritakan kepada kami Ibnu Lahi'ah dari Yazid bin Amru Al Ma'afiri dari Abu Abdurrahman Al Hubuli dari Abdullah bin Amru berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Barangsiapa diam, ia selamat.\" Berkata Abu Isa: Hadits ini gharib, kami hanya mengetahuinya dari hadits Ibnu Lahi'ah dan Abu Abdurrahman Al Hubuli adalah Abdullah bin Yazid."
    },
    {
        "number": 2426,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالَا حَدَّثَنَا سُفْيَانُ عَنْ عَلِيِّ بْنِ الْأَقْمَرِ عَنْ أَبِي حُذَيْفَةَ وَكَانَ مِنْ أَصْحَابِ ابْنِ مَسْعُودٍ عَنْ عَائِشَةَ قَالَتْ حَكَيْتُ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَجُلًا فَقَالَ مَا يَسُرُّنِي أَنِّي حَكَيْتُ رَجُلًا وَأَنَّ لِي كَذَا وَكَذَا قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّ صَفِيَّةَ امْرَأَةٌ وَقَالَتْ بِيَدِهَا هَكَذَا كَأَنَّهَا تَعْنِي قَصِيرَةً فَقَالَ لَقَدْ مَزَجْتِ بِكَلِمَةٍ لَوْ مَزَجْتِ بِهَا مَاءَ الْبَحْرِ لَمُزِجَTelah menceritakan kepada kami Muhammad bin Basyar telah menceritakan kepada kami Yahya bin Sa'id dan Abdurrahman bin Mahdi keduanya berkata: Telah menceritakan kepada kami Sufyan dari Ali bin Al Aqmar dari Abu Hudzaifah salah satu sahabat Ibnu Mas'ud, dari Aisyah berkata: Aku menceritakan seorang lelaki kepada nabi Shallallahu 'alaihi wa Salam lalu beliau bersabda: \"Aku tidak suka menceritakan kekurangan seseorang sementara aku sendiri memiliki banyak kekurangan seperti ini dan itu.\" Berkata Aisyah: Aku berkata: Wahai Rasulullah, sesungguhnya Shafiyah, --'Aisyah peragakan dengan tangannya-yang ia maksudkan, Shafiyah orangnya pendek. Beliau bersabda: \"Kau telah mengeruhkan dengan satu patah kata, yang seandainya satu patah katamu dicampurkan ke laut pasti laut menjadi keruh.\"",
        "id": ""
    },
    {
        "number": 2427,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ عَلِيِّ بْنِ الْأَقْمَرِ عَنْ أَبِي حُذَيْفَةَ عَنْ عَائِشَةَ قَالَتْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أُحِبُّ أَنِّي حَكَيْتُ أَحَدًا وَأَنَّ لِي كَذَا وَكَذَا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَأَبُو حُذَيْفَةَ هُوَ كُوفِيٌّ مِنْ أَصْحَابِ ابْنِ مَسْعُودٍ وَيُقَالُ اسْمُهُ سَلَمَةُ بْنُ صُهَيْبَةَ",
        "id": "Telah menceritakan kepada kami Hannad telah menceritakan kepada kami Waki' dari Sufyan dari Ali bin Al Aqmar dari Abu Hudzaifah dari Aisyah berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Aku tidak suka menceritakan seseorang sementara aku sendiri memiliki banyak kekurangan seperti ini dan itu.\" Berkata Abu Isa: Hadits ini hasan shahih. Abu Hudzaifah adalah orang Kufah, termasuk sahabat Ibnu Mas'ud. Ada yang mengatakan namanya adalah Salamah bin Shuhaibah."
    },
    {
        "number": 2428,
        "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنَا بُرَيْدُ بْنُ عَبْدِ اللَّهِ عَنْ أَبِي بُرْدَةَ عَنْ أَبِي مُوسَى قَالَ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَيُّ الْمُسْلِمِينَ أَفْضَلُ قَالَ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ هَذَا حَدِيثٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ أَبِي مُوسَى",
        "id": "Telah menceritakan kepada kami Ibrahim bin Sa'id Al Jauhari telah bercerita kepada kami Abu Usamah telah bercerita kepada kami Buraid bin Abdullah dari Abu Burdah dari Abu Musa berkata: Suatu ketika Rasulullah Shallallahu 'alaihi wa Salam ditanya: Siapakah orang muslim yang paling utama? beliau menjawab: \"Orang yang kaum muslimin lainnya merasa aman dari gangguan lisan dan tangannya.\" Hadits ini shahih gharib dari jalur sanad ini dari hadits Abu Musa."
    },
    {
        "number": 2429,
        "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا مُحَمَّدُ بْنُ الْحَسَنِ بْنِ أَبِي يَزِيدَ الْهَمْدَانِيُّ عَنْ ثَوْرِ بْنِ يَزِيدَ عَنْ خَالِدِ بْنِ مَعْدَانَ عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ عَيَّرَ أَخَاهُ بِذَنْبٍ لَمْ يَمُتْ حَتَّى يَعْمَلَهُ قَالَ أَحْمَدُ مِنْ ذَنْبٍ قَدْ تَابَ مِنْهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَلَيْسَ إِسْنَادُهُ بِمُتَّصِلٍ وَخَالِدُ بْنُ مَعْدَانَ لَمْ يُدْرِكْ مُعَاذَ بْنَ جَبَلٍ وَرُوِيَ عَنْ خَالِدِ بْنِ مَعْدَانَ أَنَّهُ أَدْرَكَ سَبْعِينَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَاتَ مُعَاذُ بْنُ جَبَلٍ فِي خِلَافَةِ عُمَرَ بْنِ الْخَطَّابِ وَخَالِدُ بْنُ مَعْدَانَ رَوَى عَنْ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِ مُعَاذٍ عَنْ مُعَاذٍ غَيْرَ حَدِيثٍ",
        "id": "Telah menceritakan kepada kami Ahmad bin Mani' telah bercerita kepada kami Muhammad bin Al Hasan bin Abu Yazid Al Hamdani dari Tsaur bin Yazid dari Khalid bin Ma'dan dari Mu'adz bin Jabal berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Barangsiapa mengungkap kejelekan saudaranya karena perbuatan dosa (yang dia lakukan), maka dia tidak akan meninggal sampai melakukannya (perbuatan yang diungkap kejelekkannya).\" Ahmad berkata: Perbuatan dosa yang dia telah bertobat. Abu Isa berkata: Hadits ini gharib, dan sanadnya tidak bersambung, adapun Khalid bin Ma'dan dia tidak bertemu dengan Mu'adz bin Jabal, dan telah diriwayatkan dari Khalid bin Ma'dan bahwa dia bertemu dengan tujuh puluh sahabat Nabi Shallallahu 'alaihi wa Salam, dan Mu'adz bin Jabal wafat pada masa khalifah Umar bin Al Khaththab, sementara Khalid bin Ma'dan telah meriwayatkan banyak hadits dari sekian banyak sahabat Mu'adz dari Mu'adz."
    },
    {
        "number": 2430,
        "arab": "حَدَّثَنَا عُمَرُ بْنُ إِسْمَعِيلَ بْنِ مُجَالِدٍ الْهَمْدَانِيُّ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ ح قَالَ و أَخْبَرَنَا سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا أُمَيَّةُ بْنُ الْقَاسِمِ الْحَذَّاءُ الْبَصْرِيُّ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ بُرْدِ بْنِ سِنَانٍ عَنْ مَكْحُولٍ عَنْ وَاثِلَةَ بْنِ الْأَسْقَعِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا تُظْهِرْ الشَّمَاتَةَ لِأَخِيكَ فَيَرْحَمَهُ اللَّهُ وَيَبْتَلِيكَ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَمَكْحُولٌ قَدْ سَمِعَ مِنْ وَاثِلَةَ بْنِ الْأَسْقَعِ وَأَنَسِ بْنِ مَالِكٍ وَأَبِي هِنْدٍ الدَّارِيِّ وَيُقَالُ إِنَّهُ لَمْ يَسْمَعْ مِنْ أَحَدٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا مِنْ هَؤُلَاءِ الثَّلَاثَةِ وَمَكْحُولٌ شَامِيٌّ يُكْنَى أَبَا عَبْدِ اللَّهِ وَكَانَ عَبْدًا فَأُعْتِقَ وَمَكْحُولٌ الْأَزْدِيُّ بَصْرِيٌّ سَمِعَ مِنْ عَبْدِ اللَّهِ بْنِ عُمَرَ يَرْوِي عَنْهُ عُمَارَةُ بْنُ زَاذَانَ حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ عَيَّاشٍ عَنْ تَمِيمِ بْنِ عَطِيَّةَ قَالَ كَثِيرًا مَا كُنْتُ أَسْمَعُ مَكْحُولًا يُسْئِلُ فَيَقُولُ نَدَانَمْ",
        "id": "Telah menceritakan kepada kami Umar bin Isma'il bin Mujalid Al Hamdani telah bercerita kepada kami Hafs bin Ghiyats, -lewat jalur periwayatan lain- Tirmidzi berkata: telah mengkhabarkan kepada kami Salamah bin Syabib telah menceritakan kepada kami Umayyah bin Al Qasim Al Hadza' Al Bashri telah bercerita kepada kami Hafs bin Ghiyats dari Burd bin Sinan dari Mukhul dari Watsilah bin Al Asqa' berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Janganlah kamu merasa senang atas bencana yang menimpa saudaramu, karena siapa tahu Allah kemudian hari memberinya rahmat dan sebaliknya mengujimu.\" Dia berkata: Hadits ini hasan gharib, adapun Mukhul telah mendengar dari Watsilah bin Al Asqa', Anas bin Malik dan Abu Hindi Ad Dari, dan dikatakan juga bahwa dia tidak pernah mendengar dari seorangpun dari sahabat Nabi Shallallahu 'alaihi wa Salam kecuali dari mereka tiga orang tadi, Makhul adalah orang Syam kuniyahnya adalah Abu Abdullah dulunya seorang budak kemudian dimerdekakan, sedangkan Makhul Al Azdi yang orang Bashrah, dia telah mendengar dari Abdullah bin Umar dan Umarah bin Zadzan telah meriwayatkan darinya. Telah menceritakan kepada kami Ali bin Hujr telah bercerita kepada kami Isma'il bin Ayyasy dari Tamim bin Athiyyah berkata: Kebanyakan aku mendengar Mukhul ketika ditanya dia menjawab: Nadanam (bahasa persi artinya tidak tahu)."
    },
    {
        "number": 2431,
        "arab": "حَدَّثَنَا أَبُو مُوسَى مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ عَنْ شُعْبَةَ عَنْ سُلَيْمَانَ الْأَعْمَشِ عَنْ يَحْيَى بْنِ وَثَّابٍ عَنْ شَيْخٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْمُسْلِمُ إِذَا كَانَ مُخَالِطًا النَّاسَ وَيَصْبِرُ عَلَى أَذَاهُمْ خَيْرٌ مِنْ الْمُسْلِمِ الَّذِي لَا يُخَالِطُ النَّاسَ وَلَا يَصْبِرُ عَلَى أَذَاهُمْ قَالَ أَبُو عِيسَى قَالَ ابْنُ أَبِي عَدِيٍّ كَانَ شُعْبَةُ يَرَى أَنَّهُ ابْنُ عُمَرَ",
        "id": "Telah menceritakan kepada kami Abu Musa Muhammad bin Al Mutsanna telah bercerita kepada kami Ibnu Abi 'Adi dari Syu'bah dari Sulaiman Al A'masy dari Yahya bin Watsab dari seorang syeikh salah seorang sahabat Rasulullah Shallallahu 'alaihi wa Salam dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Jika seorang muslim bergaul (berinteraksi sosial) dengan orang lain dan bersabar atas gangguan mereka, adalah lebih baik daripada seorang muslim yang tidak bergaul (tidak berinteraksi sosial) dengan orang lain dan tidak bersabar atas gangguan mereka.\" Ibnu Abi Adi berkata: Syu'bah berpendapat syeikh itu adalah Ibnu Umar."
    },
    {
        "number": 2432,
        "arab": "حَدَّثَنَا أَبُو يَحْيَى مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ الْبَغْدَادِيُّ حَدَّثَنَا مُعَلَّى بْنُ مَنْصُورٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الْمَخْرَمِيُّ هُوَ مِنْ وَلَدِ الْمِسْوَرِ بْنِ مَخْرَمَةَ عَنْ عُثْمَانَ بْنِ مُحَمَّدٍ الْأَخْنَسِيِّ عَنْ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِيَّاكُمْ وَسُوءَ ذَاتِ الْبَيْنِ فَإِنَّهَا الْحَالِقَةُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَمَعْنَى قَوْلِهِ وَسُوءَ ذَاتِ الْبَيْنِ إِنَّمَا يَعْنِي الْعَدَاوَةَ وَالْبَغْضَاءَ وَقَوْلُهُ الْحَالِقَةُ يَقُولُ إِنَّهَا تَحْلِقُ الدِّينَ",
        "id": "Telah menceritakan kepada kami Abu Yahya Muhammad bin Abdur Rahim Al Baghdadi telah bercerita kepada kami Mu'alla bin Manshur telah bercerita kepada kami Abdullah bin Ja'far Al Makhzumi dia adalah anak Al Miswar bin Makhramah, dari 'Utsman bin Muhammad Al Ahnasi dari Sa'id Al Maqburi dari Abu Hurairah bahwa Nabi Shallallahu 'alaihi wa Salam bersabda: \"Jauhilah oleh kalian interaksi social yang buruk, karena bisa menjadi penghancur.\" Abu Isa berkata: Hadits ini shahih gharib dari jalur sanad ini, adapun makna sabda beliau: \" Interaksi sosial yang buruk\" maksudnya adalah permusuhan dan kebencian, sedangkan yang dimaksud haliqah adalah bahwa interaksi social yang buruk itu dapat memangkas agama seseorang."
    },
    {
        "number": 2433,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ عَمْرِو بْنِ مُرَّةَ عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ عَنْ أُمِّ الدَّرْدَاءِ عَنْ أَبِي الدَّرْدَاءِ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَلَا أُخْبِرُكُمْ بِأَفْضَلَ مِنْ دَرَجَةِ الصِّيَامِ وَالصَّلَاةِ وَالصَّدَقَةِ قَالُوا بَلَى قَالَ صَلَاحُ ذَاتِ الْبَيْنِ فَإِنَّ فَسَادَ ذَاتِ الْبَيْنِ هِيَ الْحَالِقَةُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ وَيُرْوَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ هِيَ الْحَالِقَةُ لَا أَقُولُ تَحْلِقُ الشَّعَرَ وَلَكِنْ تَحْلِقُ الدِّينَ",
        "id": "Telah menceritakan kepada kami Hannad telah menceritakan kepada kami Abu Mu'awiyah dari Al A'masy dari Amru bin Murrah dari Salim bin Abu Al Ja'ad dari Ummu Ad Darda` dari Abu Darda' berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Maukah kalian aku beritahu yang lebih utama daripada derajat puasa, shalat dan sedekah?\" mereka menjawab: Ya. Beliau bersabda: \"Yaitu interaksi sosial yang baik, karena interaksi sosial yang buruk itu memangkas.\" Berkata Abu Isa: Hadits ini shahih dan diriwayatkan dari nabi Shallallahu 'alaihi wa Salam, beliau bersabda: \"Aku tidak mengatakan: memangkas rambut, tapi memangkas agama.\""
    },
    {
        "number": 2434,
        "arab": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ عَنْ حَرْبِ بْنِ شَدَّادٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ يَعِيشَ بْنِ الْوَلِيدِ أَنَّ مَوْلَى الزُّبَيْرِ حَدَّثَهُ أَنَّ الزُّبَيْرَ بْنَ الْعَوَّامِ حَدَّثَهُ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ دَبَّ إِلَيْكُمْ دَاءُ الْأُمَمِ قَبْلَكُمْ الْحَسَدُ وَالْبَغْضَاءُ هِيَ الْحَالِقَةُ لَا أَقُولُ تَحْلِقُ الشَّعَرَ وَلَكِنْ تَحْلِقُ الدِّينَ وَالَّذِي نَفْسِي بِيَدِهِ لَا تَدْخُلُوا الْجَنَّةَ حَتَّى تُؤْمِنُوا وَلَا تُؤْمِنُوا حَتَّى تَحَابُّوا أَفَلَا أُنَبِّئُكُمْ بِمَا يُثَبِّتُ ذَاكُمْ لَكُمْ أَفْشُوا السَّلَامَ بَيْنَكُمْ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ قَدْ اخْتَلَفُوا فِي رِوَايَتِهِ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ فَرَوَى بَعْضُهُمْ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ يَعِيشَ بْنِ الْوَلِيدِ عَنْ مَوْلَى الزُّبَيْرِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَذْكُرُوا فِيهِ عَنْ الزُّبَيْرِ",
        "id": "Telah menceritakan kepada kami Sufyan bin Waki' telah menceritakan kepada kami Abdurrahman bin Mahdi dari Harb bin Syaddad dari Yahya bin Abu Katsir dari Ya'isy bin Al Walid bahwa budak Az Zubair menceritakan padanya bahwa Az Zubair bin Al 'Awwam menceritakan padanya bahwa nabi Shallallahu 'alaihi wa Salam bersabda: \"Penyakit ummat-ummat sebelum kalian merayap mendatangi kalian: hasad dan kebencian, itu memangkas. Aku tidak mengatakan memangkas rambut tapi memangkas agama. Demi Dzat yang jiwaku ada ditanganNya, kalian tidak masuk surga hingga kalian beriman dan kalian tidak beriman hingga kalian saling menyintai. Maukah kalian aku beritahu yang menguatkan hal itu pada kalian?: Yaitu sebarkanlah salam diantara kalian.\" Berkata Abu Isa: Hadits ini diperselisihkan tentang riwayat Yahya bin Abu Katsir, sebagaiannya meriwayatkan dari Yahya bin Abu Katsir dari Ya'isy bin Al Walid dari budak Az Zubair dari nabi Shallallahu 'alaihi wa Salam, mereka tidak menyebutkan: Dari Az Zubair."
    },
    {
        "number": 2435,
        "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ عُيَيْنَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي بَكْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا مِنْ ذَنْبٍ أَجْدَرُ أَنْ يُعَجِّلَ اللَّهُ لِصَاحِبِهِ الْعُقُوبَةَ فِي الدُّنْيَا مَعَ مَا يَدَّخِرُ لَهُ فِي الْآخِرَةِ مِنْ الْبَغْيِ وَقَطِيعَةِ الرَّحِمِ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami Ali bin Hujr telah mengkhabarkan kepada kami Isma'il bin Ibrahim dari 'Uyainah bin Abdurrahman dari ayahnya dari Abu Bakrah berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Tidak ada suatu dosa yang lebih layak dipercepat hukumannya didunia oleh Allah kepada pelakunya di samping (adzab) yang disimpan baginya di akhirat daripada zina dan memutus silaturrahim. Berkata Abu Isa: Hadits ini hasan shahih."
    },
    {
        "number": 2436,
        "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا ابْنُ الْمُبَارَكِ عَنْ الْمُثَنَّى بْنِ الصَّبَّاحِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ جَدِّهِ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ خَصْلَتَانِ مَنْ كَانَتَا فِيهِ كَتَبَهُ اللَّهُ شَاكِرًا صَابِرًا وَمَنْ لَمْ تَكُونَا فِيهِ لَمْ يَكْتُبْهُ اللَّهُ شَاكِرًا وَلَا صَابِرًا مَنْ نَظَرَ فِي دِينِهِ إِلَى مَنْ هُوَ فَوْقَهُ فَاقْتَدَى بِهِ وَمَنْ نَظَرَ فِي دُنْيَاهُ إِلَى مَنْ هُوَ دُونَهُ فَحَمِدَ اللَّهَ عَلَى مَا فَضَّلَهُ بِهِ عَلَيْهِ كَتَبَهُ اللَّهُ شَاكِرًا صَابِرًا وَمَنْ نَظَرَ فِي دِينِهِ إِلَى مَنْ هُوَ دُونَهُ وَنَظَرَ فِي دُنْيَاهُ إِلَى مَنْ هُوَ فَوْقَهُ فَأَسِفَ عَلَى مَا فَاتَهُ مِنْهُ لَمْ يَكْتُبْهُ اللَّهُ شَاكِرًا وَلَا صَابِرًا أَخْبَرَنَا مُوسَى بْنُ حِزَامٍ الرَّجُلُ الصَّالِحُ حَدَّثَنَا عَلِيُّ بْنُ إِسْحَقَ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا الْمُثَنَّى بْنُ الصَّبَّاحِ عَنْ عَمْرِو بْنِ شُعَيْبٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ قَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَلَمْ يَذْكُرْ سُوَيْدُ بْنُ نَصْرٍ فِي حَدِيثِهِ عَنْ أَبِيهِ",
        "id": "Telah menceritakan kepada kami Suwaid bin Nashr telah bercerita kepada kami Ibnul Mubarak dari Al Mutsanna bin Shabbah dari Amru bin Syu'aib dari kakeknya, Abdullah bin Amru berkata: Aku mendengar Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Ada dua perkara yang barangsiapa memilikinya maka Allah akan mencatat dia sebagai seorang yang pandai bersyukur dan penyabar, dan barangsiapa yang tidak memiliki keduanya maka Allah tidak mencatat dia sebagai seorang yang pandai bersyukur dan penyabar, yaitu barangsiapa yang melihat (mengukur) agamanya dengan orang yang lebih tinggi darinya lalu dia mengikutinya, dan barangsiapa yang melihat (mengukur) dunianya dengan orang yang paling rendah darinya lalu dia memuji Allah atas karunia yang diberikan kepadanya, maka Allah akan mencatat dia sebagai seorang yang pandai bersyukur dan penyabar, namun barangsiapa yang melihat agamanya dengan orang yang lebih rendah darinya dan melihat dunianya dengan orang yang lebih tinggi darinya dan dia bersedih atas dunia yang tidak didapatkannya, maka Allah tidak mencatatnya sebagai seorang yang pandai bersyukur dan penyabar.\" Telah menceritakan kepada kami Musa bin Hizam seorang yang shalih, telah mengkhabarkan kepada kami Ali bin Ishaq telah bercerita kepada kami Abdullah bin Al Mubarak telah mengkhabarkan kepada kami Al Mutsanna bin As Shabbah dari Amru bin Syu'aib dari bapaknya dari kakeknya dari Nabi Shallallahu 'alaihi wa Salam dengan hadits yang semakna dengannya Berkata Abu Isa: Hadits ini hasan gharib, sementara Suwaid bin Nashr tidak menyebut dalam haditsnya lafadz: Dari bapaknya."
    },
    {
        "number": 2437,
        "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ وَوَكِيعٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ انْظُرُوا إِلَى مَنْ هُوَ أَسْفَلَ مِنْكُمْ وَلَا تَنْظُرُوا إِلَى مَنْ هُوَ فَوْقَكُمْ فَإِنَّهُ أَجْدَرُ أَنْ لَا تَزْدَرُوا نِعْمَةَ اللَّهِ عَلَيْكُمْ هَذَا حَدِيثٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami Abu Kuraib telah menceritakan kepada kami Abu Mu'awiyah dan Waki' dari Al A'masy dari Abu Shalih dari Abu Hurairah berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Lihatlah orang yang ada di bawah dari kalian, jangan melihat yang ada di atas kalian, karena yang demikian lebih mendorong untuk tidak mengurangi nikmat Allah atasmu.\" Hadits ini shahih."
    },
    {
        "number": 2438,
        "arab": "حَدَّثَنَا بِشْرُ بْنُ هِلَالٍ الْبَصْرِيُّ حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ عَنْ سَعِيدٍ الْجُرَيْرِيِّ قَالَ ح و حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ الْبَزَّازُ حَدَّثَنَا سَيَّارٌ حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ عَنْ سَعِيدٍ الْجُرَيْرِيِّ الْمَعْنَى وَاحِدٌ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ حَنْظَلَةَ الْأُسَيِّدِيِّ وَكَانَ مِنْ كُتَّابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ مَرَّ بِأَبِي بَكْرٍ وَهُوَ يَبْكِي فَقَالَ مَا لَكَ يَا حَنْظَلَةُ قَالَ نَافَقَ حَنْظَلَةُ يَا أَبَا بَكْرٍ نَكُونُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُذَكِّرُنَا بِالنَّارِ وَالْجَنَّةِ كَأَنَّا رَأْيَ عَيْنٍ فَإِذَا رَجَعْنَا إِلَى الْأَزْوَاجِ وَالضَّيْعَةِ نَسِينَا كَثِيرًا قَالَ فَوَاللَّهِ إِنَّا لَكَذَلِكَ انْطَلِقْ بِنَا إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَانْطَلَقْنَا فَلَمَّا رَآهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَا لَكَ يَا حَنْظَلَةُ قَالَ نَافَقَ حَنْظَلَةُ يَا رَسُولَ اللَّهِ نَكُونُ عِنْدَكَ تُذَكِّرُنَا بِالنَّارِ وَالْجَنَّةِ كَأَنَّا رَأْيَ عَيْنٍ فَإِذَا رَجَعْنَا عَافَسْنَا الْأَزْوَاجَ وَالضَّيْعَةَ وَنَسِينَا كَثِيرًا قَالَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ تَدُومُونَ عَلَى الْحَالِ الَّذِي تَقُومُونَ بِهَا مِنْ عِنْدِي لَصَافَحَتْكُمْ الْمَلَائِكَةُ فِي مَجَالِسِكُمْ وَفِي طُرُقِكُمْ وَعَلَى فُرُشِكُمْ وَلَكِنْ يَا حَنْظَلَةُ سَاعَةً وَسَاعَةً وَسَاعَةً وَسَاعَةً قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami Bisyr bin Hilal Al Bashri telah menceritakan kepada kami Ja'far bin Sulaiman dari Sa'id Al Jurairi berkata dan telah menceritakan kepada kami Harun bin Abdullah Al Bazzar telah menceritakan kepada kami Sayyar telah menceritakan kepada kami Ja'far bin Sulaiman dari Sa'id Al Jurairi -artinya sama- dari Abu 'Utsman An Nahdi dari Hanzhalah Al Usaidi salah satu sekretaris nabi Shallallahu 'alaihi wa Salam, ia melintasi Abu Bakar, ia tengah menangis lalu Abu Bakar bertanya: Ada apa kamu, hai Hanzhalah? Hanzhalah menjawab: Hanzhalah, berbunat nifaq wahai Abu Bakar. Jika kami berada di dekat Rasulullah Shallallahu 'alaihi wa Salam, beliau mengingatkan kami terhadap neraka dan surge, hingga sepertinya kami melihatnya tapi saat kami kembali ke istri-istri kami dan penghidupan kami, kami sering lupa. Berkata Abu Bakar: Demi Allah, kami juga seperti itu, mari kita pergi menemui Rasulullah Shallallahu 'alaihi wa Salam. Kami pun pergi, saat Rasulullah Shallallahu 'alaihi wa Salam melihatnya, beliau bertanya: \"Kenapa kamu, wahai Hanzhalah?\" ia menjawab: Hanzhalah telah berbuat nifaq wahai Rasulullah, Hanzhalah telah berbuat nifaq wahai Rasulullah. Saat kami berada di dekat baginda, baginda mengingatkan kami kepada neraka dan surga, hingga sepertinya kami melihatnya, tapi bila kami kembali, kami bermain-main dengan istri dan penghidupan kami, kami sering lupa.\" Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Andai kalian terus diatas kondisi saat kalian ada didekatku, niscaya para malaikat akan menyalami kalian di majlis-majlis kalian, di jalanan kalian dan di atas tempat tidur kalian, tapi hai Hanzhalah, tetap luangkanlah waktu untuk itu, tetap luangkanlah waktu untuk itu.\" Berkata Abu Isa: Hadits ini hasan shahih."
    },
    {
        "number": 2439,
        "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ شُعْبَةَ عَنْ قَتَادَةَ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ قَالَ هَذَا حَدِيثٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami Suwaid bin Nashr telah mengkhabarkan kepada kami Abdullah bin Al Mubarak dari Syu'bah dari Qatadah dari Anas dari nabi Shallallahu 'alaihi wa Salam bersabda: \"Salah seorang dari kalian tidak dianggap beriman hingga mencintai untuk saudaranya seperti yang ia mencintai untuk dirinya sendiri.\" Berkata Abu Isa: Hadits ini shahih."
    },
    {
        "number": 2440,
        "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ مُوسَى أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا لَيْثُ بْنُ سَعْدٍ وَابْنُ لَهِيعَةَ عَنْ قَيْسِ بْنِ الْحَجَّاجِ قَالَ ح و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا أَبُو الْوَلِيدِ حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ حَدَّثَنِي قَيْسُ بْنُ الْحَجَّاجِ الْمَعْنَى وَاحِدٌ عَنْ حَنَشٍ الصَّنْعَانِيِّ عَنْ ابْنِ عَبَّاسٍ قَالَ كُنْتُ خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا فَقَالَ يَا غُلَامُ إِنِّي أُعَلِّمُكَ كَلِمَاتٍ احْفَظْ اللَّهَ يَحْفَظْكَ احْفَظْ اللَّهَ تَجِدْهُ تُجَاهَكَ إِذَا سَأَلْتَ فَاسْأَلْ اللَّهَ وَإِذَا اسْتَعَنْتَ فَاسْتَعِنْ بِاللَّهِ وَاعْلَمْ أَنَّ الْأُمَّةَ لَوْ اجْتَمَعَتْ عَلَى أَنْ يَنْفَعُوكَ بِشَيْءٍ لَمْ يَنْفَعُوكَ إِلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ لَكَ وَلَوْ اجْتَمَعُوا عَلَى أَنْ يَضُرُّوكَ بِشَيْءٍ لَمْ يَضُرُّوكَ إِلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ عَلَيْكَ رُفِعَتْ الْأَقْلَامُ وَجَفَّتْ الصُّحُفُ قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami Ahmad bin Muhammad bin Musa telah mengkhabarkan kepada kami Abdullah bin Al Mubarak telah mengkhabarkan kepada kami Laits bin Sa'ad dan Ibnu Lahi'ah dari Qais bin Al Hajjaj berkata: dan telah menceritakan kepada kami Abdullah bin Abdurrahman telah mengkhabarkan kepada kami Abu Al Walid telah menceritakan kepada kami Laits bin Sa'ad telah menceritakan kepadaku Qais bin Al Hajjaj -artinya sama- dari Hanasy Ash Shan'ani dari Ibnu Abbas berkata: Aku pernah berada di belakang Rasulullah Shallallahu 'alaihi wa Salam pada suatu hari, beliau bersabda: \"Hai 'nak, sesungguhnya aku akan mengajarimu beberapa kalimat: jagalah Allah niscaya Ia menjagamu, jagalah Allah niscaya kau menemui-Nya dihadapanmu, bila kau meminta, mintalah pada Allah dan bila kau meminta pertolongan, mintalah kepada Allah, ketahuilah sesungguhnya seandainya ummat bersatu untuk memberimu manfaat, mereka tidak akan memberi manfaat apa pun selain yang telah ditakdirkan Allah untukmu dan seandainya bila mereka bersatu untuk membahayakanmu, mereka tidak akan membahayakanmu sama sekali kecuali yang telah ditakdirkan Allah padamu, pena-pena telah diangkat dan lembaran-lembaran telah kering. (maksudnya takdir telah ditetapkan) \" Berkata Abu Isa: Hadits ini hasan shahih."
    },
    {
        "number": 2441,
        "arab": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ حَدَّثَنَا الْمُغِيرَةُ بْنُ أَبِي قُرَّةَ السَّدُوسِيُّ قَال سَمِعْتُ أَنَسَ بْنَ مَالِكٍ يَقُولُ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَعْقِلُهَا وَأَتَوَكَّلُ أَوْ أُطْلِقُهَا وَأَتَوَكَّلُ قَالَ اعْقِلْهَا وَتَوَكَّلْ قَالَ عَمْرُو بْنُ عَلِيٍّ قَالَ يَحْيَى وَهَذَا عِنْدِي حَدِيثٌ مُنْكَرٌ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ أَنَسٍ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَقَدْ رُوِيَ عَنْ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ هَذَا",
        "id": "Telah menceritakan kepada kami Amru bin Ali telah bercerita kepada kami Yahya bin Sa'id Al Qattan telah bercerita kepada kami Al Mughirah bin Abu Qurrah As Sadusi berkata: Aku mendengar Anas bin Malik berkata: Ada seorang lelaki yang bertanya: Wahai Rasulullah apakah aku harus mengikat untaku kemudian bertawakkal atau aku melepaskannya saja kemudian bertawakkal? beliau menjawab: Ikatlah untamu kemudian bertawakkallah.\" Amru bin Ali berkata bahwa Yahya berkata: Menurut saya hadits ini munkar.\" Abu Isa berkata: Hadits ini gharib dari hadits Anas, kami tidak mengetahuinya kecuali dari jalur sanad ini, dan telah diriwayatkan dari Amr bin Umayyah Ad Domri dari Nabi Shallallahu 'alaihi wa Salam hadits yang semakna."
    },
    {
        "number": 2442,
        "arab": "حَدَّثَنَا أَبُو مُوسَى الْأَنْصَارِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ حَدَّثَنَا شُعْبَةُ عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ عَنْ أَبِي الْحَوْرَاءِ السَّعْدِيِّ قَالَ قُلْتُ لِلْحَسَنِ بْنِ عَلِيٍّ مَا حَفِظْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حَفِظْتُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ دَعْ مَا يَرِيبُكَ إِلَى مَا لَا يَرِيبُكَ فَإِنَّ الصِّدْقَ طُمَأْنِينَةٌ وَإِنَّ الْكَذِبَ رِيبَةٌ وَفِي الْحَدِيثِ قِصَّةٌ قَالَ وَأَبُو الْحَوْرَاءِ السَّعْدِيُّ اسْمُهُ رَبِيعَةُ بْنُ شَيْبَانَ قَالَ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ حَدَّثَنَا بُنْدَارٌ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ بُرَيْدٍ فَذَكَرَ نَحْوَهُ",
        "id": "Telah menceritakan kepada kami Abu Musa Al Anshari telah menceritakan kepada kami Abdullah bin Idris telah menceritakan kepada kami Syu'bah dari Buraid bin Abu Maryam dari Abu Al Haura` As Sa'di berkata: Aku bertanya kepada Al Hasan bin Ali: Apa yang kau hafal dari Rasulullah Shallallahu 'alaihi wa Salam? Ia menjawab: Aku menghafal dari Rasulullah Shallallahu 'alaihi wa Salam: \"Tinggalkan yang meragukanmu kepada sesuatu yang tidak meragukanmu karena kejujuran itu ketenangan dan dusta itu keraguan.\" Dalam hadits ini ada kisahnya. Abu Al Haura` As Sa'di namanya Rabi'ah bin Syaiban. Berkata Abu Isa: Hadits ini hasan shahih. Telah menceritakan kepada kami Bundar telah menceritakan kepada kami Muhammad bin Ja'far telah menceritakan kepada kami Syu'bah dari Buraid ia menyebut sepertinya."
    },
    {
        "number": 2443,
        "arab": "حَدَّثَنَا زَيْدُ بْنُ أَخْزَمَ الطَّائِيُّ الْبَصْرِيُّ حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي الْوَزِيرِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ الْمَخْرَمِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نُبَيْهٍ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ عَنْ جَابِرٍ قَالَ ذُكِرَ رَجُلٌ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِعِبَادَةٍ وَاجْتِهَادٍ وَذُكِرَ عِنْدَهُ آخَرُ بِرِعَةٍ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُعْدَلُ بِالرِّعَةِ وَعَبْدُ اللَّهِ بْنُ جَعْفَرٍ هُوَ مِنْ وَلَدِ الْمِسْوَرِ بْنِ مَخْرَمَةَ وَهُوَ مَدَنِيٌّ ثِقَةٌ عِنْدَ أَهْلِ الْحَدِيثِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ",
        "id": "Telah menceritakan kepada kami Zaid bin Akhzam At Tha'I Al Bashri telah bercerita kepada kami Ibrahim bin Abul Wazir telah bercerita kepada kami Abdullah bin Ja'far Al Makhzumi dari Muhammad bin Abdurrahman bin Nubaih dari Muhammad bin Al Munkadir dari Jabir berkata: Ada seorang lelaki yang disebut sebut di sisi Nabi Shallallahu 'alaihi wa Salam dengan ibadah dan kesungguhannya kemudian disebut juga seorang lelaki lain di sisi beliau dengan sifat wara'nya, Nabi Shallallahu 'alaihi wa Salam bersabda: \"sifat wara' tidak ada bandingannya.\" Dan Abdullah bin Ja'far dia adalah anak Al Miswar bin Makhramah, dia adalah orang Madinah yang tsiqah menurut para ahli hadits. Abu Isa berkata: Hadits ini hasan gharib, kami tidak mengetahuinya kecuali dari jalur sanad ini."
    },
    {
        "number": 2444,
        "arab": "حَدَّثَنَا هَنَّادٌ وَأَبُو زُرْعَةَ وَغَيْرُ وَاحِدٍ قَالُوا أَخْبَرَنَا قَبِيصَةُ عَنْ إِسْرَائِيلَ عَنْ هِلَالِ بْنِ مِقْلَاصٍ الصَّيْرَفِيِّ عَنْ أَبِي بِشْرٍ عَنْ أَبِي وَائِلٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ أَكَلَ طَيِّبًا وَعَمِلَ فِي سُنَّةٍ وَأَمِنَ النَّاسُ بَوَائِقَهُ دَخَلَ الْجَنَّةَ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ إِنَّ هَذَا الْيَوْمَ فِي النَّاسِ لَكَثِيرٌ قَالَ وَسَيَكُونُ فِي قُرُونٍ بَعْدِي قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ إِسْرَائِيلَ حَدَّثَنَا عَبَّاسٌ الدُّورِيُّ حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ عَنْ إِسْرَائِيلَ وَسَأَلْتُ مُحَمَّدَ بْنَ إِسْمَعِيلَ عَنْ هَذَا الْحَدِيثِ فَلَمْ يَعْرِفْهُ إِلَّا مِنْ حَدِيثِ إِسْرَائِيلَ وَلَمْ يَعْرِفْ اسْمَ أَبِي بِشْرٍ",
        "id": "Telah menceritakan kepada kami Hannad, Abu Zur'ah dan yang lainnya telah bercerita kepada kami mereka berkata: telah menceritakan kepada kami Qabishah dari Isra'Il dari Hilal bin Miqlash Ash Shairafi dari Abu Bisyr dari Abu Wa`il dari Abu Sa'id Al Khudri berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Barangsiapa yang memakan makanan yang baik, beramal sesuai dengan sunnah dan orang orang aman dari kejahatannya maka dia akan masuk surga, \" berkata seseorang: Wahai Rasulullah, sesungguhnya saat ini hal itu sangat banyak ditengah orang-orang, beliau bersabda: \"Dan akan ada orang seperti ini pada masa masa setelahku.\" Abu Isa berkata: Hadits ini gharib, kami tidak mengetahuinya kecuali dari jalur sanad ini dari hadits Isra'il. Telah menceritakan kepada kami Abbas Ad Duri telah bercerita kepada kami Yahya bin Abu Katsir dari Isra'il, aku bertanya kepada Muhammad bin Isma'il tentang hadits ini namun dia tidak mengetahuinya kecuali dari hadits Isra'il, dia tidak mengenal nama Abu Bisyr."
    },
    {
        "number": 2445,
        "arab": "حَدَّثَنَا عَبَّاسٌ الدُّورِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ عَنْ أَبِي مَرْحُومٍ عَبْدِ الرَّحِيمِ بْنِ مَيْمُونٍ عَنْ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ الْجُهَنِيِّ عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَعْطَى لِلَّهِ وَمَنَعَ لِلَّهِ وَأَحَبَّ لِلَّهِ وَأَبْغَضَ لِلَّهِ وَأَنْكَحَ لِلَّهِ فَقَدْ اسْتَكْمَلَ إِيمَانَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ مُنْكَرٌ",
        "id": "Telah menceritakan kepada kami Abbas Ad Duri telah menceritakan kepada kami Abdullah bin Yazid telah menceritakan kepada kami Sa'id bin Abu Ayyub dari Abu Marhum 'Abdur Rahim bin Maimun dari Sahal bin Mu'adz bin Anas Al Juhani dari ayahnya, Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Barangsiapa memberi karena Allah, mencegah karena Allah, marah karena Allah dan menikah karena Allah berarti sempurnalah keimanannya.\" Berkata Abu Isa: Hadits ini munkar."
    }
  ]
}