{
    "kategori": "Kitab Sifat Jahannam",
  "hadits": [
    {
        "number": 2496,
        "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ حَدَّثَنَا أَبِي عَنْ الْعَلَاءِ بْنِ خَالِدٍ الْكَاهِلِيِّ عَنْ شَقِيقِ بْنِ سَلَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُؤْتَى بِجَهَنَّمَ يَوْمَئِذٍ لَهَا سَبْعُونَ أَلْفَ زِمَامٍ مَعَ كُلِّ زِمَامٍ سَبْعُونَ أَلْفَ مَلَكٍ يَجُرُّونَهَاقَالَ عَبْدُ اللَّهِ وَالثَّوْرِيُّ لَا يَرْفَعُهُ حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ عَمْرٍو أَبُو عَامِرٍ الْعَقَدِيُّ عَنْ سُفْيَانَ عَنْ الْعَلَاءِ بْنِ خَالِدٍ بِهَذَا الْإِسْنَادِ نَحْوَهُ وَلَمْ يَرْفَعْهُ",
        "id": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman] telah bercerita kepada kami [Umar bin Hafs bin Ghiyats] telah mengkhabarkan kepada kami [bapakku] dari [Al Ala' bin Khalid Al Kahili] dari [Syaqiq bin Salamah] dari [Abdullah bin Mas'ud] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Pada hari itu, neraka Jahannam di datangkan, ia memiliki tujuh puluh ribu tali, pada tiap tali ada tujuh puluh ribu malaikat menyeretnya.\" Abdullah berkata: Ats Tsauri tidak menyambungkannya sampai kepada Nabi. Telah menceritakan kepada kami Abdu bin Humaid telah bercerita kepada kami Abdul Malik bin Amru dan Abu Amir Al Aqadi dari Sufyan dari Al Ala' bin Khlid dengan sanad ini sepertinya namun tidak memarfu'kannya."
    },
    {
        "number": 2497,
        "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُعَاوِيَةَ الْجُمَحِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَخْرُجُ عُنُقٌ مِنْ النَّارِ يَوْمَ الْقِيَامَةِ لَهَا عَيْنَانِ تُبْصِرَانِ وَأُذُنَانِ تَسْمَعَانِ وَلِسَانٌ يَنْطِقُ يَقُولُ إِنِّي وُكِّلْتُ بِثَلَاثَةٍ بِكُلِّ جَبَّارٍ عَنِيدٍ وَبِكُلِّ مَنْ دَعَا مَعَ اللَّهِ إِلَهًا آخَرَ وَبِالْمُصَوِّرِينَوَفِي الْبَاب عَنْ أَبِي سَعِيدٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ وَقَدْ رَوَاهُ بَعْضُهُمْ عَنْ الْأَعْمَشِ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَ هَذَا وَرَوَى أَشْعَثُ بْنُ سَوَّارٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
        "id": "Telah menceritakan kepada kami [Abdullah bin Muawiyah Al Juhami] telah menceritakan kepada kami [Abdul Aziz bin Muslim] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \" Pada hari kiamat nanti, ada Leher keluar dari neraka, ia memiliki dua mata yang melihat, dua telinga yang mendengar dan lisan yang berbicara, ia berkata: Aku diberi kuasa pada setiap orang sombong lagi membangkang, pada orang yang menyeru tuhan lain bersama Allah dan pada orang-orang yang membuat gambar.\" Dalam hal ini ada hadits serupa dari Abu Sa'id. Abu Isa berkata: Hadits ini hasan gharib shahih. Sebagian meriwayatkan hadits ini dari [Al A'masy] dari [Athiyah] dari [Abu Sa'id] dari nabi Shallallahu 'alaihi wa Salam seperti ini. [Asy'ats bin Sawwar] meriwayatkan dari [Athiyah] dari [Abu Sa'id Al Khudri] dari nabi Shallallahu 'alaihi wa Salam sepertinya."
    },
    {
        "number": 2498,
        "arab": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ الْجُعْفِيُّ عَنْ فُضَيْلِ بْنِ عِيَاضٍ عَنْ هِشَامٍ عَنْ الْحَسَنِ قَالَ قَالَ عُتْبَةُ بْنُ غَزْوَانَ عَلَى مِنْبَرِنَا هَذَا مِنْبَرِ الْبَصْرَةِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الصَّخْرَةَ الْعَظِيمَةَ لَتُلْقَى مِنْ شَفِيرِ جَهَنَّمَ فَتَهْوِي فِيهَا سَبْعِينَ عَامًا وَمَا تُفْضِي إِلَى قَرَارِهَاقَالَ وَكَانَ عُمَرُ يَقُولُ أَكْثِرُوا ذِكْرَ النَّارِ فَإِنَّ حَرَّهَا شَدِيدٌ وَإِنَّ قَعْرَهَا بَعِيدٌ وَإِنَّ مَقَامِعَهَا حَدِيدٌ قَالَ أَبُو عِيسَى لَا نَعْرِفُ لِلْحَسَنِ سَمَاعًا مِنْ عُتْبَةَ بْنِ غَزْوَانَ وَإِنَّمَا قَدِمَ عُتْبَةُ بْنُ غَزْوَانَ الْبَصْرَةَ فِي زَمَنِ عُمَرَ وَوُلِدَ الْحَسَنُ لِسَنَتَيْنِ بَقِيَتَا مِنْ خِلَافَةِ عُمَرَ",
        "id": "Telah menceritakan kepada kami [Abd bin Humaid] telah menceritakan kepada kami [Husain bin Ali Al Ju'fi] dari [Fudlail bin Iyadl] dari [Hisyam] dari [Al Hasan] berkata: [Utbah bin Ghazwan] berkhutbah di atas mimbar Bashrah, dari nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Sesungguhnya batu besar di lemparkan dari tepi neraka jahanam lalu jatuh ke dalamnya selama tujuhpuluh tahun dan tidak juga sampai ke dasarnya.\" Berkata Al Hasan: Ibnu Umar berkata: Sering-seringlah mengingat neraka karena panasnya amat sangat, jurangnya jauh dan palu-palunya terbuat dari besi. Abu Isa berkata: Kami tidak mengetahui Al Hasan mendengar dari Utbah bin Ghazwan, Utbah bin Ghazwan hanya datang ke Bashrah di masa Umar, sementara Al Hasan lahir dua tahun di sisa masa khilafah Umar."
    },
    {
        "number": 2499,
        "arab": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى عَنْ ابْنِ لَهِيعَةَ عَنْ دَرَّاجٍ عَنْ أَبِي الْهَيْثَمِ عَنْ أَبِي سَعِيدٍعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الصَّعُودُ جَبَلٌ مِنْ نَارٍ يَتَصَعَّدُ فِيهِ الْكَافِرُ سَبْعِينَ خَرِيفًا وَيَهْوِي فِيهِ كَذَلِكَ أَبَدًاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ مَرْفُوعًا إِلَّا مِنْ حَدِيثِ ابْنِ لَهِيعَةَ",
        "id": "Telah menceritakan kepada kami [Abd bin Humaid] telah menceritakan kepada kami [Al Hasan bin Musa] dari [Ibnu Lahi'ah] dari [Darraj] dari [Abu Al Hutsaim] dari [Abu Sa'id] dari Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Sha'ud adalah salah satu gunung neraka, orang kafir menaikinya selama empatpuluh tahun lalu terjun di dalamnya seperti itu juga selama itu selama-lamanya. Abu Isa berkata: Hadits ini gharib, kemarfu'annya hanya kami ketahui dari hadits Ibnu Lahi'ah."
    },
    {
        "number": 2500,
        "arab": "حَدَّثَنَا عَبَّاسٌ الدُّورِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى أَخْبَرَنَا شَيْبَانُ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ غِلَظَ جِلْدِ الْكَافِرِ اثْنَانِ وَأَرْبَعُونَ ذِرَاعًا وَإِنَّ ضِرْسَهُ مِثْلُ أُحُدٍ وَإِنَّ مَجْلِسَهُ مِنْ جَهَنَّمَ كَمَا بَيْنَ مَكَّةَ وَالْمَدِينَةِهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ حَدِيثِ الْأَعْمَشِ",
        "id": "Telah menceritakan kepada kami [Abbas Ad Duri] telah menceritakan kepada kami [Ubaidullah bin Musa] telah mengkhabarkan kepada kami [Syaiban] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dari nabi Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya kulit orang kafir itu setebal empatpuluh dua hasta, gigi gerahamnya seperti Uhud dan tempatnya di neraka jahanam seluas antara Makkah dan Madinah.\" Hadits ini hasan shahih gharib dari hadits Al A'masy."
    },
    {
        "number": 2501,
        "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا مُحَمَّدُ بْنُ عَمَّارٍ حَدَّثَنِي جَدِّي مُحَمَّدُ بْنُ عَمَّارٍ وَصَالِحٌ مَوْلَى التَّوْأَمَةِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضِرْسُ الْكَافِرِ يَوْمَ الْقِيَامَةِ مِثْلُ أُحُدٍ وَفَخِذُهُ مِثْلُ الْبَيْضَاءِ وَمَقْعَدُهُ مِنْ النَّارِ مَسِيرَةُ ثَلَاثٍ مِثْلُ الرَّبَذَةِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَمِثْلُ الرَّبَذَةِ كَمَا بَيْنَ الْمَدِينَةِ وَالرَّبَذَةِ وَالْبَيْضَاءُ جَبَلٌ مِثْلُ أُحُدٍ",
        "id": "Telah menceritakan kepada kami [Ali bin Hujr] telah mengabarkan kepada kami [Muhammad bin Ammar] telah menceritakan kepadaku [kakekku, Muhammad bin Ammar] dan [Shalih maula at-Tau`amah] dari [Abu Hurairah], dia berkata, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Gigi orang kafir pada hari kiamat seperti gunung Uhud, pahanya seperti gunung al Baidha', dan tempat duduknya dari api neraka sejarak tiga (malam) seperti ar Rabadzah.\" Abu Isa berkata; Ini hadits hasan gharib. Sedangkan kalimat, 'Seperti ar Rabadzah' adalah seperti jarak antara Madinah dan ar Rabazdah. Kata 'Al Baidha' adalah nama gunung sebagaimana Uhud."
    },
    {
        "number": 2502,
        "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا مُصْعَبُ بْنُ الْمِقْدَامِ عَنْ فُضَيْلِ بْنِ غَزْوَانَ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَرَفَعَهُ قَالَ ضِرْسُ الْكَافِرِ مِثْلُ أُحُدٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَأَبُو حَازِمٍ هُوَ الْأَشْجَعِيُّ اسْمُهُ سَلْمَانُ مَوْلَى عَزَّةَ الْأَشْجَعِيَّةِ",
        "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Mush'ab bin al Miqdam] dari [Fudhail bin Ghazwan] dari [Abu Hazim] dari [Abu Hurairah] dia menyatakannya marfu', beliau bersabda; \"Geraham orang kafir seperti gunung Uhud.\" Abu Isa berkata; 'Ini hadits hasan. Sedangkan Abu Hazim adalah (bermarga) al Asyja'i, namanya Salman maula 'Azzah al Asyja'iyyah.\""
    },
    {
        "number": 2503,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ الْفَضْلِ بْنِ يَزِيدَ عَنْ أَبِي الْمُخَارِقِ عَنْ ابْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ الْكَافِرَ لَيُسْحَبُ لِسَانُهُ الْفَرْسَخَ وَالْفَرْسَخَيْنِ يَتَوَطَّؤُهُ النَّاسُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ إِنَّمَا نَعْرِفُهُ مِنْ هَذَا الْوَجْهِ وَالْفَضْلُ بْنُ يَزِيدَ هُوَ كُوفِيٌّ قَدْ رَوَى عَنْهُ غَيْرُ وَاحِدٍ مِنْ الْأَئِمَّةِ وَأَبُو الْمُخَارِقِ لَيْسَ بِمَعْرُوفٍ",
        "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Ali bin Mushir] dari [al Fadhl bin Yazid] dari [Abu al Mukhariq] dari [Ibnu Umar] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya lisan orang kafir akan diseret sejarak satu farsakh dan dua farsakh, dan diinjak-injak oleh manusia.\" Abu Isa berkata; 'Ini hadits gharib. Kami hanya mengetahuinya dari jalur ini saja. Sedangkan Fadhl bin Yazid adalah seorang kufah. Bukan hanya satu imam yang meriwayatkan darinya. Sedangkan Abu al Mukhariq tidak dikenal.'"
    },
    {
        "number": 2504,
        "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ دَرَّاجٍ عَنْ أَبِي الْهَيْثَمِ عَنْ أَبِي سَعِيدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِهِ{ كَالْمُهْلِ }قَالَ كَعَكَرِ الزَّيْتِ فَإِذَا قَرَّبَهُ إِلَى وَجْهِهِ سَقَطَتْ فَرْوَةُ وَجْهِهِ فِيهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ رِشْدِينَ بْنِ سَعْدٍ وَرِشْدِينُ قَدْ تُكُلِّمَ فِيهِ",
        "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Risydin bin Sa'd] dari [Amru bin al Harits] dari [Darraj] dari [Abu al Haitsam] dari [Abu Sa'id] dari Nabi shallallahu 'alaihi wasallam dalam menjelaskan firman Nya, \"Seperti besi yang mendidih.\" Beliau bersabda: \"Maksudnya seperti endapan minyak. Maka apabila (orang yang bermaksiat) mendekatkannya kepada wajahnya, niscaya kulit mukanya akan jatuh mengelupas ke dalamnya.\" Abu Isa berkata; 'Ini hadits yang mana kita tidak mengenalnya kecuali dari hadits Risydin bin Sa'd, sedangkan Risydin kredibilitasnya diperbincangkan.'"
    },
    {
        "number": 2505,
        "arab": "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا سَعِيدُ بْنُ يَزِيدَ عَنْ أَبِي السَّمْحِ عَنْ ابْنِ حُجَيْرَةَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْحَمِيمَ لَيُصَبُّ عَلَى رُءُوسِهِمْ فَيَنْفُذُ الْحَمِيمُ حَتَّى يَخْلُصَ إِلَى جَوْفِهِ فَيَسْلِتُ مَا فِي جَوْفِهِ حَتَّى يَمْرُقَ مِنْ قَدَمَيْهِ وَهُوَ الصَّهْرُ ثُمَّ يُعَادُ كَمَا كَانَوَسَعِيدُ بْنُ يَزِيدَ يُكْنَى أَبَا شُجَاعٍ وَهُوَ مِصْرِيٌّ وَقَدْ رَوَى عَنْهُ اللَّيْثُ بْنُ سَعْدٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ وَابْنُ حُجَيْرَةَ هُوَ عَبْدُ الرَّحْمَنِ بْنُ حُجَيْرَةَ الْمِصْرِيُّ",
        "id": "Telah menceritakan kepada kami [Suwaid] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Sa'id bin Yazid] dari [Abu as Samh] dari [Ibnu Hujairah] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Sesungguhnya air yang panas tersebut pasti akan dituangkan ke atas kepala mereka, maka air panas tersebut menembus hingga masuk ke dalam perutnya dan memotong segala sesuatu yang berada dalam perutnya hingga keluar dari kedua telapak kakinya dalam bentuk cairan. Kemudian dia dikembalikan (utuh) sebagaimana sebelumnya.\" Sa'id bin Yazid diberi kunyah Abu Syuja', dia seorang Mesir. Al Laits bin Sa'd telah meriwayatkan darinya. Abu Isa berkata; 'Ini hadits hasan shahih gharib. Sedangkan Ibnu Hujairah adalah Abdurrahman bin Hujairah al Mishri.'"
    },
    {
        "number": 2506,
        "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا صَفْوَانُ بْنُ عَمْرٍو عَنْ عُبَيْدِ اللَّهِ بْنِ بُسْرٍ عَنْ أَبِي أُمَامَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِهِ{ وَيُسْقَى مِنْ مَاءٍ صَدِيدٍ يَتَجَرَّعُهُ }قَالَ يُقَرَّبُ إِلَى فِيهِ فَيَكْرَهُهُ فَإِذَا أُدْنِيَ مِنْهُ شَوَى وَجْهَهُ وَوَقَعَتْ فَرْوَةُ رَأْسِهِ فَإِذَا شَرِبَهُ قَطَّعَ أَمْعَاءَهُ حَتَّى تَخْرُجَ مِنْ دُبُرِهِ يَقُولُ اللَّهُ{ وَسُقُوا مَاءً حَمِيمًا فَقَطَّعَ أَمْعَاءَهُمْ }وَيَقُولُ{ وَإِنْ يَسْتَغِيثُوا يُغَاثُوا بِمَاءٍ كَالْمُهْلِ يَشْوِي الْوُجُوهَ بِئْسَ الشَّرَابُ }قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَهَكَذَا قَالَ مُحَمَّدُ بْنُ إِسْمَعِيلَ عَنْ عُبَيْدِ اللَّهِ بْنِ بُسْرٍ وَلَا نَعْرِفُ عُبَيْدَ اللَّهِ بْنَ بُسْرٍ إِلَّا فِي هَذَا الْحَدِيثِ وَقَدْ رَوَى صَفْوَانُ بْنُ عَمْرٍو عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ صَاحِبِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيْرَ هَذَا الْحَدِيثِ وَعَبْدُ اللَّهِ بْنُ بُسْرٍ لَهُ أَخٌ قَدْ سَمِعَ مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأُخْتُهُ قَدْ سَمِعَتْ مِنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعُبَيْدُ اللَّهِ بْنُ بُسْرٍ الَّذِي رَوَى عَنْهُ صَفْوَانُ بْنُ عَمْرٍو هَذَا الْحَدِيثَ رَجُلٌ آخَرُ لَيْسَ بِصَاحِبٍ",
        "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Shafwan bin Amru] dari [Ubaidillah bin Busr] dari [Abu Umamah] dari Nabi shallallahu 'alaihi wasallam dalam menjelaskan firman Nya, \"Dan dia akan diberi minuman dengan air nanah, lalu dia minum air nanah itu.\" Beliau menjelaskan; '(Minuman itu) didekatkan kepada (orang yang bermaksiat tersebut), maka dia tidak menyukainya, ketika didekatkan kepadanya, minuman itu membakar wajahnya, maka kulit kepalanya jatuh mengelupas. Ketika dia meminumnya, minuman itu memutuskan lambungnya hingga keluar (cairan) dari duburnya. Allah berfirman: 'Dan mereka diberi minuman dengan air yang mendidih sehingga memotong ususnya.' Dan Allah berfirman: 'Dan jika mereka meminta minum, niscaya mereka akan diberi minum dengan air seperti besi yang mendidih yang menghanguskan muka. Itulah minuman yang paling buruk dan tempat istirahat yang paling jelek'.\" Abu Isa berkata; 'Ini hadits gharib. Demikianlah yang dikatakan Muhammad bin Isma'il dari Ubaidullah bin Busr. Dan kami tidak mengetahui Ubaidullah bin Busr kecuali dalam hadits ini. Shafwan telah meriwayatkan dari Amru dari Abdullah bin Busr, sahabat Nabi shallallahu 'alaihi wasallam selain hadits ini. Abdullah bin Busr mempunyai saudara yang telah mendengarkan (hadits) dari Nabi shallallahu 'alaihi wasallam, dan saudarinya juga telah mendengar dari Nabi shallallahu 'alaihi wasallam. Sedangkan Ubaidullah bin Busr yang mana Shafwan bin Amru meriwayatkan hadits ini darinya adalah laki-laki lain yang tidak termasuk kalangan shahabat.'"
    },
    {
        "number": 2507,
        "arab": "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا رِشْدِينُ بْنُ سَعْدٍ حَدَّثَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ دَرَّاجٍ عَنْ أَبِي الْهَيْثَمِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ{ كَالْمُهْلِ }كَعَكَرِ الزَّيْتِ فَإِذَا قُرِّبَ إِلَيْهِ سَقَطَتْ فَرْوَةُ وَجْهِهِ فِيهِ",
        "id": "Telah menceritakan kepada kami [Suwaid] telah mengabarkan kepada kami [Abdullah bin Al Mubarak] telah mengabarkan kepada kami [Risydin bin Sa'ad] telah menceritakan kepadaku [Amru bin Al Harits] dari [Darraj] dari [Abul Haitsam] dari [Abu Sa'id Al Khudri] dari Nabi shallallahu 'alaihi wasallam, beliau menjelaskan firmanNya; \"Seperti besi yang mendidih\" yaitu seperti endapan minyak, apabila didekatkan maka wajahnya (penghuni neraka) niscaya jatuh mengelupas ke dalamnya\"."
    },
    {
        "number": 2508,
        "arab": "وَبِهَذَا الْإِسْنَادِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِسُرَادِقِ النَّارِ أَرْبَعَةُ جُدُرٍ كِثَفُ كُلِّ جِدَارٍ مِثْلُ مَسِيرَةِ أَرْبَعِينَ سَنَةً",
        "id": "Dan dengan sanad ini (Yaitu; Telah menceritakan kepada kami [Suwaid] telah mengabarkan kepada kami [Abdullah bin Al Mubarak] telah mengabarkan kepada kami [Risydin bin Sa'ad] telah menceritakan kepadaku [Amru bin Al Harits] dari [Darraj] dari [Abul Haitsam] dari [Abu Sa'id Al Khudri]), dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Tenda neraka memiliki empat dinding yang tebal. Setiap dinding memiliki ketebalan semisal jarak empat puluh tahun.\""
    },
    {
        "number": 2509,
        "arab": "وَبِهَذَا الْإِسْنَادِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ أَنَّ دَلْوًا مِنْ غَسَّاقٍ يُهَرَاقُ فِي الدُّنْيَا لَأَنْتَنَ أَهْلَ الدُّنْيَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ رِشْدِينَ بْنِ سَعْدٍ وَفِي رِشْدِينَ مَقَالٌ وَقَدْ تُكُلِّمَ فِيهِ مِنْ قِبَلِ حِفْظِهِ وَمَعْنَى قَوْلِهِ كِثَفُ كُلِّ جِدَارٍ يَعْنِي غِلَظَهُ",
        "id": "Dan dengan sanad ini pula, (Yaitu; Telah menceritakan kepada kami [Suwaid] telah mengabarkan kepada kami [Abdullah bin Al Mubarak] telah mengabarkan kepada kami [Risydin bin Sa'ad] telah menceritakan kepadaku [Amru bin Al Harits] dari [Darraj] dari [Abul Haitsam] dari [Abu Sa'id Al Khudri]) dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Kalau seandainya satu timba dari nanah ahli neraka ditumpahkan ke dunia, niscaya penduduk dunia akan basi.\" Abu Isa berkata; 'Hadits ini hanya kami kenal dari hadits Risydin bin Sa'd. Namun pada (kredibilitas) Risydin terdapat perbincangan. Dia diperbincangkan pada hafalannya. Sedangkan makna sabdanya, 'Katsifu Kulli Jidar' maksudnya adalah ketebalan dindingnya."
    },
    {
        "number": 2510,
        "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ أَخْبَرَنَا شُعْبَةُ عَنْ الْأَعْمَشِ عَنْ مُجَاهِدٍ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ هَذِهِ الْآيَةَ{ اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلَا تَمُوتُنَّ إِلَّا وَأَنْتُمْ مُسْلِمُونَ }قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ أَنَّ قَطْرَةً مِنْ الزَّقُّومِ قُطِرَتْ فِي دَارِ الدُّنْيَا لَأَفْسَدَتْ عَلَى أَهْلِ الدُّنْيَا مَعَايِشَهُمْ فَكَيْفَ بِمَنْ يَكُونُ طَعَامَهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Daud] telah menceritakan kepada kami [Syu'bah] dari [al A'masy] dari [Mujahid] dari [Ibnu Abbas] bahwa Rasulullah shallallahu 'alaihi wasallam membaca ayat, \"Bertakwalah kamu sekalian kepada Allah dengan sebenar benarnya takwa, dan janganlah kamu sekalian meninggal melainkan kalian dalam keadaan muslim.\" Maka Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalau seandainya setetes Zaqqum (nama pohon di neraka) menetes ke kampung dunia, niscaya akan merusakkan kehidupan penduduk dunia. Lalu bagaimana dengan (keadaan) orang-orang yang menjadikan zaqqum sebagai makanannya?\" Abu Isa berkata; 'Ini hadits hasan shahih.\""
    },
    {
        "number": 2511,
        "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا عَاصِمُ بْنُ يُوسُفَ حَدَّثَنَا قُطْبَةُ بْنُ عَبْدِ الْعَزِيزِ عَنْ الْأَعْمَشِ عَنْ شِمْرِ بْنِ عَطِيَّةَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أُمِّ الدَّرْدَاءِ عَنْ أَبِي الدَّرْدَاءِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُلْقَى عَلَى أَهْلِ النَّارِ الْجُوعُ فَيَعْدِلُ مَا هُمْ فِيهِ مِنْ الْعَذَابِ فَيَسْتَغِيثُونَ فَيُغَاثُونَ بِطَعَامٍ مِنْ ضَرِيعٍ لَا يُسْمِنُ وَلَا يُغْنِي مِنْ جُوعٍ فَيَسْتَغِيثُونَ بِالطَّعَامِ فَيُغَاثُونَ بِطَعَامٍ ذِي غُصَّةٍ فَيَذْكُرُونَ أَنَّهُمْ كَانُوا يُجِيزُونَ الْغَصَصَ فِي الدُّنْيَا بِالشَّرَابِ فَيَسْتَغِيثُونَ بِالشَّرَابِ فَيُرْفَعُ إِلَيْهِمْ الْحَمِيمُ بِكَلَالِيبِ الْحَدِيدِ فَإِذَا دَنَتْ مِنْ وُجُوهِهِمْ شَوَتْ وُجُوهَهُمْ فَإِذَا دَخَلَتْ بُطُونَهُمْ قَطَّعَتْ مَا فِي بُطُونِهِمْ فَيَقُولُونَ ادْعُوا خَزَنَةَ جَهَنَّمَ فَيَقُولُونَ أَلَمْ{ تَكُ تَأْتِيكُمْ رُسُلُكُمْ بِالْبَيِّنَاتِ قَالُوا بَلَى قَالُوا فَادْعُوا وَمَا دُعَاءُ الْكَافِرِينَ إِلَّا فِي ضَلَالٍ }قَالَ فَيَقُولُونَ ادْعُوا مَالِكًا فَيَقُولُونَ{ يَا مَالِكُ لِيَقْضِ عَلَيْنَا رَبُّكَ }قَالَ فَيُجِيبُهُمْ{ إِنَّكُمْ مَاكِثُونَ }قَالَ الْأَعْمَشُ نُبِّئْتُ أَنَّ بَيْنَ دُعَائِهِمْ وَبَيْنَ إِجَابَةِ مَالِكٍ إِيَّاهُمْ أَلْفَ عَامٍ قَالَ فَيَقُولُونَ ادْعُوا رَبَّكُمْ فَلَا أَحَدَ خَيْرٌ مِنْ رَبِّكُمْ فَيَقُولُونَ{ رَبَّنَا غَلَبَتْ عَلَيْنَا شِقْوَتُنَا وَكُنَّا قَوْمًا ضَالِّينَ رَبَّنَا أَخْرِجْنَا مِنْهَا فَإِنْ عُدْنَا فَإِنَّا ظَالِمُونَ }قَالَ فَيُجِيبُهُمْ{ اخْسَئُوا فِيهَا وَلَا تُكَلِّمُونِ }قَالَ فَعِنْدَ ذَلِكَ يَئِسُوا مِنْ كُلِّ خَيْرٍ وَعِنْدَ ذَلِكَ يَأْخُذُونَ فِي الزَّفِيرِ وَالْحَسْرَةِ وَالْوَيْلِقَالَ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ وَالنَّاسُ لَا يَرْفَعُونَ هَذَا الْحَدِيثَ قَالَ أَبُو عِيسَى إِنَّمَا نَعْرِفُ هَذَا الْحَدِيثَ عَنْ الْأَعْمَشِ عَنْ شِمْرِ بْنِ عَطِيَّةَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أُمِّ الدَّرْدَاءِ عَنْ أَبِي الدَّرْدَاءِ قَوْلَهُ وَلَيْسَ بِمَرْفُوعٍ وَقُطْبَةُ بْنُ عَبْدِ الْعَزِيزِ هُوَ ثِقَةٌ عِنْدَ أَهْلِ الْحَدِيثِ",
        "id": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman] telah mengabarkan kepada kami ['Ashim bin Yusuf] telah menceritakan kepada kami [Quthbah bin Abdul Aziz] dari [Al A'masy] dari [Syimir bin Athiyyah] dari [Syahr bin Hausyab] dari [Ummu Ad Darda'] dari [Abu Ad Darda'] dia berkata, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan dicampakkan kepada penghuni neraka rasa lapar yang sebanding dengan siksa yang mereka alami, lalu mereka memohon pertolongan, kemudian mereka ditolong dengan diberi makanan dari \"dhari\" (pohon yang berduri) Yang tidak menggemukkan dan tidak pula menghilangkan lapar, kemudian mereka memohon diberikan makanan lalu mereka diberi makanan yang menyumbat di kerongkongan, kemudian mereka teringat bahwa dahulu di dunia mereka mengobati tersumbatnya kerongkongan mereka dengan minuman, maka mereka memohon untuk diberi minuman, lalu dituangkanlah air mendidih kepada mereka dengan \"Al Kalalib\" (besi yang bengkok ujungnya digunakan untuk mengangkat daging dari kendi) yang apabila telah dekat ke wajah mereka menjadi gosonglah wajah mereka, dan apabila masuk ke dalam perut mereka niscaya akan memotong motong organ yang ada dalam perut mereka, lalu mereka berkata sesama mereka; 'Memohonlah kepada penjaga neraka Jahannam' namun mereka membacakan ayat 'Dan apakah belum datang kepada kamu rasul-rasulmu dengan membawa keterangan keterangan' Mereka menjawab: 'Benar, sudah datang.' penjaga-penjaga Jahannam berkata: 'Berdoalah kamu.' Dan doa orang-orang kafir itu hanyalah sia-sia belaka\". (QS Ghafir: 50) Rasulullah berkata; \"Lalu mereka berkata; 'Memohonlah kepada Malaikat Malik, ' maka mereka berkata; (Hai Malik Biarlah Tuhanmu membunuh kami saja) \". QS Az-Zukhrf: 77. Nabi berkata: \"Dia menjawab; 'Kamu akan tetap tinggal (di neraka ini) '.\" -Al A'masy berkata; 'Aku diberi tahu bahwa jarak antara permohonan mereka dengan jawaban Malaikat Malik kepada mereka adalah seribu tahun, '- Nabi berkata: \"Lalu mereka saling berkata; 'Mohonlah kepada Rabb kalian karena tidak ada seorang pun yang lebih baik daripada Rabb kalian'. Lalu mereka memohon; 'Ya Tuhan kami, kami telah dikuasai oleh kejahatan kami, dan dahulu kami adalah orang-orang yang sesat. Ya Tuhan kami, keluarkanlah kami dari padanya (dan kembalikanlah kami ke dunia), maka jika kami kembali (juga kepada kekafiran), maka sesungguhnya kami adalah orang-orang yang zhalim.'\" QS Al Mukminun: 106-107. Nabi berkata: \"Lalu Allah menjawab kepada mereka; 'Tinggallah dengan hina di dalamnya, dan janganlah kamu berbicara dengan Aku'.\" QS Al Mukminun: 108. Nabi berkata: \"Maka ketika itu mereka putus asa dari segala kebaikan, dan ketika itu juga mereka meringkik dan menyesal serta celaka.\" Abdullah bin Abdurrahman berkata; \"Orang-orang tidak merafa'kan (menyambungkan sampai kepada Nabi) hadits ini\". Abu Isa berkata; 'Kami mengetahui hadits ini hanya dari Al A'masy dari Syimir bin Athiyyah dari Syahr bin Hasyab dari Ummu Ad Darda' dari perkataan Abu Ad Darda', dan ia tidak marfu'. Adapun Qutbah bin Abdul Aziz, maka dia adalah seorang yang tsiqah menurut para ahli hadits\"."
    },
    {
        "number": 2512,
        "arab": "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ سَعِيدِ بْنِ يَزِيدَ أَبِي شُجَاعٍ عَنْ أَبِي السَّمْحِ عَنْ أَبِي الْهَيْثَمِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ{ وَهُمْ فِيهَا كَالِحُونَ }قَالَ تَشْوِيهِ النَّارُ فَتَقَلَّصُ شَفَتُهُ الْعُلْيَا حَتَّى تَبْلُغَ وَسَطَ رَأْسِهِ وَتَسْتَرْخِي شَفَتُهُ السُّفْلَى حَتَّى تَضْرِبَ سُرَّتَهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ وَأَبُو الْهَيْثَمِ اسْمُهُ سُلَيْمَانُ بْنُ عَمْرِو بْنِ عَبْدٍ الْعُتْوَارِيُّ وَكَانَ يَتِيمًا فِي حِجْرِ أَبِي سَعِيدٍ",
        "id": "Telah menceritakan kepada kami [Suwaid] telah mengabarkan kepada kami [Abdullah bin al Mubarak] dari [Sa'id bin Yazid Abu Syuja'] dari [Abu as Samh] dari [Abu al Haitsam] dari [Abu Sa'id al Khudzri] dari Nabi shallallahu 'alaihi wasallam, beliau menjelaskan firmanNya: \"Dan mereka di dalam neraka itu dalam keadaan cacat.\" Beliau bersabda: \"Orang kafir dibakar oleh api neraka, maka bibir atasnya mengkerut (ke atas) sehingga mencapai pertengahan kepalanya, sedangkan bibir bawahnya menjulur hingga mendekati pusarnya.\" Abu Isa berkata; 'Ini hadits hasan shahih gharib. Dan Abu al Haitsam namanya adalah Sulaiman bin Amru bin Murrah bin Abd al Utwari. Dia adalah seorang yatim yang berada pada naungan Abu Sa'id.'"
    },
    {
        "number": 2513,
        "arab": "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا سَعِيدُ بْنُ يَزِيدَ عَنْ أَبِي السَّمْحِ عَنْ عِيسَى بْنِ هِلَالٍ الصَّدَفِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِي قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ أَنَّ رَصَاصَةً مِثْلَ هَذِهِ وَأَشَارَ إِلَى مِثْلِ الْجُمْجُمَةِ أُرْسِلَتْ مِنْ السَّمَاءِ إِلَى الْأَرْضِ هِيَ مَسِيرَةُ خَمْسِ مِائَةِ سَنَةٍ لَبَلَغَتْ الْأَرْضَ قَبْلَ اللَّيْلِ وَلَوْ أَنَّهَا أُرْسِلَتْ مِنْ رَأْسِ السِّلْسِلَةِ لَسَارَتْ أَرْبَعِينَ خَرِيفًا اللَّيْلَ وَالنَّهَارَ قَبْلَ أَنْ تَبْلُغَ أَصْلَهَا أَوْ قَعْرَهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ إِسْنَادُهُ حَسَنٌ صَحِيحٌ وَسَعِيدُ بْنُ يَزِيدَ هُوَ مِصْرِيٌّ وَقَدْ رَوَى عَنْهُ اللَّيْثُ بْنُ سَعْدٍ وَغَيْرُ وَاحِدٍ مِنْ الْأَئِمَّةِ",
        "id": "Telah menceritakan kepada kami [Suwaid] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Sa'id bin Yazid] dari [Abu as Samh] dari [Isa bin Hilal ash Shadafi] dari [Abdullah bin Amru bin al 'Ash] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Kalau seandainya timah seperti ini -dan beliau menunjuk seperti wadah kecil- dikirim dari langit menuju ke bumi yang jaraknya sepanjang perjalanan lima ratus tahun, niscaya ia akan sampai di bumi sebelum malam, dan kalau seandainya ia dikirim dari puncak 'rantai', niscaya akan (memerlukan) perjalanan empat puluh tahun siang dan malam sebelum mencapai dasarnya atau keraknya.\" Abu Isa berkata; 'Hadits ini sanadnya hasan shahih. Dan Sa'id bin Yazid adalah seorang Mesir. Al Laits bin Sa'id dan bukan satu imam saja yang telah meriwayatkan hadits darinya.\""
    },
    {
        "number": 2514,
        "arab": "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَارُكُمْ هَذِهِ الَّتِي تُوقِدُونَ جُزْءٌ وَاحِدٌ مِنْ سَبْعِينَ جُزْءًا مِنْ حَرِّ جَهَنَّمَ قَالُوا وَاللَّهِ إِنْ كَانَتْ لَكَافِيَةً يَا رَسُولَ اللَّهِ قَالَ فَإِنَّهَا فُضِّلَتْ بِتِسْعَةٍ وَسِتِّينَ جُزْءًا كُلُّهُنَّ مِثْلُ حَرِّهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَهَمَّامُ بْنُ مُنَبِّهٍ هُوَ أَخُو وَهْبِ بْنِ مُنَبِّهٍ وَقَدْ رَوَى عَنْهُ وَهْبٌ",
        "id": "Telah menceritakan kepada kami [Suwaid] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Api kalian ini yang kalian gunakan untuk membakar adalah salah satu bagian dari tujuh puluh bagian panasnya api neraka.\" Mereka bertanya; \"Demi Allah, apabila api ini sungguh sudah cukup (panas untuk mengadzab orang yang bermaksiat, lalu mengapa harus ditambah panasnya) wahai Rasulullah?\" Beliau menjawab: \"Panasnya api neraka melebihi (panasnya api dunia) sembilan puluh sembilan bagian. Semua bagian api (yang berjumlah sembilan puluh sembilan) panasnya adalah seperti panas api neraka.\" (maksud jawaban Rasulullah adalah adzab Allah harus lebih besar daripada adzab manusia). Abu Isa berkata; 'Hadits ini hadits hasan shahih. Dan Hammam bin Munabbih adalah saudara Wahb bin Munabbih. Dan Wahb telah meriwayatkan hadits darinya.\""
    },
    {
        "number": 2515,
        "arab": "حَدَّثَنَا الْعَبَّاسُ الدُّورِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى حَدَّثَنَا شَيْبَانُ عَنْ فِرَاسٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ نَارُكُمْ هَذِهِ جُزْءٌ مِنْ سَبْعِينَ جُزْءًا مِنْ نَارِ جَهَنَّمَ لِكُلِّ جُزْءٍ مِنْهَا حَرُّهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ حَدِيثِ أَبِي سَعِيدٍ",
        "id": "Telah menceritakan kepada kami [Al Abbas Ad Duri al Baghdadi] telah menceritakan kepada kami [Ubaidullah bin Musa] telah menceritakan kepada kami [Syaiban] dari [Firas] dari [Athiyyah] dari [Abu Sa'id] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Api kalian ini adalah satu bagian dari tujuh puluh bagian api neraka Jahannam, panas dari semua bagian adalah sama dengan panas api neraka\". Abu Isa berkata; 'Hadits ini hasan gharib dari hadits Abu Sa'id.'"
    },
    {
        "number": 2516,
        "arab": "حَدَّثَنَا عَبَّاسٌ الدُّورِيُّ الْبَغْدَادِيُّ حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ حَدَّثَنَا شَرِيكٌ عَنْ عَاصِمٍ هُوَ ابْنُ بَهْدَلَةَ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُوقِدَ عَلَى النَّارِ أَلْفَ سَنَةٍ حَتَّى احْمَرَّتْ ثُمَّ أُوقِدَ عَلَيْهَا أَلْفَ سَنَةٍ حَتَّى ابْيَضَّتْ ثُمَّ أُوقِدَ عَلَيْهَا أَلْفَ سَنَةٍ حَتَّى اسْوَدَّتْ فَهِيَ سَوْدَاءُ مُظْلِمَةٌحَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ شَرِيكٍ عَنْ عَاصِمٍ عَنْ أَبِي صَالِحٍ أَوْ رَجُلٍ آخَرَ عَنْ أَبِي هُرَيْرَةَ نَحْوَهُ وَلَمْ يَرْفَعْهُ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ فِي هَذَا مَوْقُوفٌ أَصَحُّ وَلَا أَعْلَمُ أَحَدًا رَفَعَهُ غَيْرَ يَحْيَى بْنِ أَبِي بُكَيْرٍ عَنْ شَرِيكٍ",
        "id": "Telah menceritakan kepada kami [Abbas Ad Duri Al Baghdadi] telah menceritakan kepada kami [Yahya bin Abu Bukair] telah menceritakan kepada kami [Syarik] dari ['Ashim, yaitu Ibnu Bahdalah] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Bara api neraka jahannam itu dipanaskan selama seribu tahun sampai menjadi merah, kemudian dipanaskan lagi selama seribu tahun sampai menjadi putih, kemudian dipanaskan lagi selama seribu tahun sampai menjadi hitam, maka dia menjadi hitam gelap\". Telah menceritakan kepada kami Suwaid telah mengabarkan kepada kami Abdullah bin Al Mubarak dari Syarik dari 'Ashim dari Abu Shalih atau seorang lelaki yang lain dari Abu Hurairah dengan hadits yang semakna namun dia tidak merafa'kannya. Abu Isa berkata; 'Hadits Abu Hurairah dalam masalah ini yang lebih shahih adalah hadits mauquf, dan saya tidak mengetahui seorang pun yang merafa'kannya selain Yahya bin Abu Bukair dari Syarik.'"
    },
    {
        "number": 2517,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُمَرَ بْنِ الْوَلِيدِ الْكِنْدِيُّ الْكُوفِيُّ حَدَّثَنَا الْمُفَضَّلُ بْنُ صَالِحٍ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اشْتَكَتْ النَّارُ إِلَى رَبِّهَا وَقَالَتْ أَكَلَ بَعْضِي بَعْضًا فَجَعَلَ لَهَا نَفَسَيْنِ نَفَسًا فِي الشِّتَاءِ وَنَفَسًا فِي الصَّيْفِ فَأَمَّا نَفَسُهَا فِي الشِّتَاءِ فَزَمْهَرِيرٌ وَأَمَّا نَفَسُهَا فِي الصَّيْفِ فَسَمُومٌقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ قَدْ رُوِيَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ غَيْرِ وَجْهٍ وَالْمُفَضَّلُ بْنُ صَالِحٍ لَيْسَ عِنْدَ أَهْلِ الْحَدِيثِ بِذَلِكَ الْحَافِظِ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Umar bin al Walid al Kindi al Kufi] telah menceritakan kepada kami [al Mufadhdhal bin Shalih] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Neraka mengadu kepada Rabbnya seraya berkata; 'Sebagian anggotaku memakan sebagian anggota lainnya.' Lalu Allah menjadikan dua nafas untuknya, satu nafas di musim panas dan satu nafas di musim dingin. Adapun nafasnya di musim dingin maka (disebut) zamharir (angin dingin), sedangkan nafasnya di musim panas maka (disebut) samum (angin panas).\" Abu Isa berkata; 'Hadits ini hadits shahih, ia telah diriwayatkan dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam dari bukan satu jalur. Sedangkan al Mufadhdhal bin Shalih menurut ahli hadits pada jalur tersebut bukanlah hafidz.'"
    },
    {
        "number": 2518,
        "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا شُعْبَةُ وَهِشَامٌ عَنْ قَتَادَةَ عَنْ أَنَسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَخْرُجُ مِنْ النَّارِ وَقَالَ شُعْبَةُ أَخْرِجُوا مِنْ النَّارِ مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ وَكَانَ فِي قَلْبِهِ مِنْ الْخَيْرِ مَا يَزِنُ شَعِيرَةً أَخْرِجُوا مِنْ النَّارِ مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ وَكَانَ فِي قَلْبِهِ مِنْ الْخَيْرِ مَا يَزِنُ بُرَّةً أَخْرِجُوا مِنْ النَّارِ مَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ وَكَانَ فِي قَلْبِهِ مِنْ الْخَيْرِ مَا يَزِنُ ذَرَّةًو قَالَ شُعْبَةُ مَا يَزِنُ ذُرَةً مُخَفَّفَةً وَفِي الْبَاب عَنْ جَابِرٍ وَأَبِي سَعِيدٍ وَعِمْرَانَ بْنِ حُصَيْنٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kamu [Abu Daud] telah menceritakan kepada kami [Syu'bah] dan [Hisyam] dari [Qatadah] dari [Anas] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Akan keluar dari neraka -sedangkan Syu'bah mengungkapkan; 'Keluarkanlah dari neraka'- orang yang mengucapkan, La Ilaha illa Allah (tidak ada tuhan yang berhak disembah selain Allah) sedangkan di dalam hatinya terdapat sebagian dari kebaikan yang setara dengan biji gandum (sya'irah). Keluarkanlah dari neraka orang yang mengucapkan, La Ilaha illa Allah (tidak ada tuhan yang berhak disembah selain Allah) sedangkan di dalam hatinya terdapat sebagian dari kebaikan yang setara dengan biji gandum (burrah). Keluarkanlah dari neraka orang yang mengucapkan, La Ilaha illa Allah (tidak ada tuhan yang berhak disembah selain Allah) sedangkan di dalam hatinya terdapat sebagian dari kebaikan yang setara dengan biji gandum (dzarrah).\" Syu'bah berkata; \"Sesuatu yang setara dengan timbangan dzurrah yang ringan.\" Dan dalam bab tersebut dari Jabir dan Abu Sa'id serta Imran bin Hushain, Abu Isa berkata; 'Ini hadits hasan shahih.\""
    },
    {
        "number": 2519,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا أَبُو دَاوُدَ عَنْ مُبَارَكِ بْنِ فَضَالَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي بَكْرِ بْنِ أَنَسٍ عَنْ أَنَسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَقُولُ اللَّهُ أَخْرِجُوا مِنْ النَّارِ مَنْ ذَكَرَنِي يَوْمًا أَوْ خَافَنِي فِي مَقَامٍقَالَ هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Rafi'] telah menceritakan kepada [Abu Daud] dari [Mubarak bin Fadlalah] dari [Ubaidullah bin Abu Bakar bin Anas] dari [Anas] dari Nabi shallallahu 'alaihi wasallam beliau berkata: \"Allah berfirman: 'Keluarkanlah dari neraka orang yang mengingat-Ku pada suatu hari atau takut kepada-Ku pada suatu tempat\". Dia berkata; \"Hadits ini hasan gharib\"."
    },
    {
        "number": 2520,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ إِبْرَاهِيمَ عَنْ عَبِيدَةَ السَّلْمَانِيِّ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَأَعْرِفُ آخِرَ أَهْلِ النَّارِ خُرُوجًا رَجُلٌ يَخْرُجُ مِنْهَا زَحْفًا فَيَقُولُ يَا رَبِّ قَدْ أَخَذَ النَّاسُ الْمَنَازِلَ قَالَ فَيُقَالُ لَهُ انْطَلِقْ فَادْخُلْ الْجَنَّةَ قَالَ فَيَذْهَبُ لِيَدْخُلَ فَيَجِدُ النَّاسَ قَدْ أَخَذُوا الْمَنَازِلَ فَيَرْجِعُ فَيَقُولُ يَا رَبِّ قَدْ أَخَذَ النَّاسُ الْمَنَازِلَ قَالَ فَيُقَالُ لَهُ أَتَذْكُرُ الزَّمَانَ الَّذِي كُنْتَ فِيهِ فَيَقُولُ نَعَمْ فَيُقَالُ لَهُ تَمَنَّ قَالَ فَيَتَمَنَّى فَيُقَالُ لَهُ فَإِنَّ لَكَ مَا تَمَنَّيْتَ وَعَشْرَةَ أَضْعَافِ الدُّنْيَا قَالَ فَيَقُولُ أَتَسْخَرُ بِي وَأَنْتَ الْمَلِكُ قَالَ فَلَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Abu Mu'awiyah] dari [al A'masy] dari [Ibrahim] dari [Abidah as Salmani] dari [Abdullah bin Mas'ud] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya aku mengetahui penduduk neraka yang paling terakhir keluar, dia adalah seorang laki-laki yang keluar darinya dalam keadaan merangkak seraya berkata; 'Wahai Rabbku manusia telah mengambil tempat-tempatnya'.\" Rasulullah berkata; \"Lalu diperintahkan kepadanya; 'Pergilah, lalu masuklah surga'. Lalu dia pergi untuk masuk surga, dan dia mendapatkan manusia telah mengambil tempat-tempat mereka. Maka dia kembali seraya berkata; 'Wahai Rabbku, manusia telah mengambil tempat-tempatnya (sedangkan saya tidak memiliki tempat).' Lalu diperintahkan kepadanya; 'Apakah kamu mengingat zaman yang mana kamu berada di masanya.' Dia menjawab; 'Ya'. Lalu dikatakan kepadanya; 'Berangan anganlah (untuk tempatmu).' Maka dia mengangan angankannya. Kemudian dikatakan kepadanya; 'Sesungguhnya kamu mendapatkan sesuatu yang telah kamu angan angankan dan sepuluh kali lipat dunia.' Maka dia berkata; 'Apakah Engkau mengejekku (dengan pahala yang melimpah ini), sedangkan Engkau adalah Raja Diraja.'\" Perawi berkata; 'Sungguh aku telah melihat Rasulullah shallallahu 'alaihi wasallam tertawa sehingga tampaklah gigi gerahamnya.\" Abu Isa berkata; 'Hadits ini adalah hadits hasan shahih.\""
    },
    {
        "number": 2521,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ الْمَعْرُورِ بْنِ سُوَيْدٍ عَنْ أَبِي ذَرٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنِّي لَأَعْرِفُ آخِرَ أَهْلِ النَّارِ خُرُوجًا مِنْ النَّارِ وَآخِرَ أَهْلِ الْجَنَّةِ دُخُولًا الْجَنَّةَ يُؤْتَى بِرَجُلٍ فَيَقُولُ سَلُوا عَنْ صِغَارِ ذُنُوبِهِ وَاخْبَئُوا كِبَارَهَا فَيُقَالُ لَهُ عَمِلْتَ كَذَا وَكَذَا يَوْمَ كَذَا وَكَذَا عَمِلْتَ كَذَا وَكَذَا فِي يَوْمِ كَذَا وَكَذَا قَالَ فَيُقَالُ لَهُ فَإِنَّ لَكَ مَكَانَ كُلِّ سَيِّئَةٍ حَسَنَةً قَالَ فَيَقُولُ يَا رَبِّ لَقَدْ عَمِلْتُ أَشْيَاءَ مَا أَرَاهَا هَا هُنَا قَالَ فَلَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Abu Mu'awiyah] dari [al A'masy] dari [al Ma'rur bin Suwaid] dari [Abu Dzarr] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: Sesungguhnya aku mengetahui penduduk neraka yang paling terakhir keluar dari neraka dan penduduk surga yang paling terakhir masuk surga. (Pada hari kiamat) seorang laki-laki didatangkan, lalu Dia berfirman; 'Tanyakanlah kepadanya tentang dosa-dosa kecilnya, dan sembunyikanlah dosa-dosa besarnya.' Maka ditanyakan kepadanya; '(Apakah) kamu mengetahui peristiwa demikian dan demikian pada hari demikian dan demikian, (Apakah) kamu mengetahui peristiwa demikian dan demikian pada hari demikian dan demikian? ' Lalu dikatakan kepadanya; 'Sesungguhnya kamu mendapatkan pahala tempat segala kejelekan diganti menjadi kebaikan.' Lelaki tersebut berkata; '(benar) wahai Rabbku, sungguh saya telah mengetahui berbagai hal yang telah saya lihat di sini.'\" Perawi berkata; 'Sungguh aku telah melihat Rasulullah shallallahu 'alaihi wasallam tertawa sehingga tampaklah gigi gerahamnya.\" Abu Isa berkata; 'Hadits ini adalah hadits hasan shahih.\""
    },
    {
        "number": 2522,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُعَذَّبُ نَاسٌ مِنْ أَهْلِ التَّوْحِيدِ فِي النَّارِ حَتَّى يَكُونُوا فِيهَا حُمَمًا ثُمَّ تُدْرِكُهُمْ الرَّحْمَةُ فَيُخْرَجُونَ وَيُطْرَحُونَ عَلَى أَبْوَابِ الْجَنَّةِ قَالَ فَيَرُشُّ عَلَيْهِمْ أَهْلُ الْجَنَّةِ الْمَاءَ فَيَنْبُتُونَ كَمَا يَنْبُتُ الْغُثَاءُ فِي حِمَالَةِ السَّيْلِ ثُمَّ يَدْخُلُونَ الْجَنَّةَقَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ جَابِرٍ",
        "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Abu Mu'awiyah] dari [al A'masy] dari [Abu Sufyan] dari [Jabir] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Segolongan orang dari ahli tauhid diadzab di neraka sehingga mereka menjadi abu, kemudian mereka mendapatkan rahmat, lalu mereka dikeluarkan dan diletakkan di depan pintu surga.' Rasulullah berkata; 'Lalu penduduk surga menyiramkan air kepada mereka, maka mereka tumbuh kembali sebagaimana buih tumbuh dalam sesuatu yang dibawa aliran air, kemudian mereka masuk surga.\" Abu Isa berkata; 'Hadits ini hadits hasan shahih, ia telah diriwayatkan dari berbagai jalur dari Jabir.'"
    },
    {
        "number": 2523,
        "arab": "حَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُخْرَجُ مِنْ النَّارِ مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ ذَرَّةٍ مِنْ الْإِيمَانِقَالَ أَبُو سَعِيدٍ فَمَنْ شَكَّ فَلْيَقْرَأْ{ إِنَّ اللَّهَ لَا يَظْلِمُ مِثْقَالَ ذَرَّةٍ }قَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Salamah bin Syabib] telah menceritakan kepada kami [Abdurrazzaq] telah mengabarkan kepada kami [Ma'mar] dari [Zaid bin Aslam] dari [Atha' bin Yasar] dari [Abu Sa'id al Khudzri] bahwa Nabi shallallahu 'alaihi wasallam bersabda: \"Akan keluar dari neraka, orang yang di dalam hatinya terdapat iman seberat gandum.\" Abu Sa'id berkata; \"Barangsiapa yang ragu-ragu maka hendaklah dia membaca, 'Sesungguhnya Allah tidak akan menzhalimi (walaupun kebaikan) seberat biji gandum.\" Abu Isa berkata; 'Hadits ini hadits hasan shahih.'"
    },
    {
        "number": 2524,
        "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا رِشْدِينُ حَدَّثَنِي ابْنُ أَنْعُمَ عَنْ أَبِي عُثْمَانَ أَنَّهُ حَدَّثَهُ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ رَجُلَيْنِ مِمَّنْ دَخَلَ النَّارَ اشْتَدَّ صِيَاحُهُمَا فَقَالَ الرَّبُّ عَزَّ وَجَلَّ أَخْرِجُوهُمَا فَلَمَّا أُخْرِجَا قَالَ لَهُمَا لِأَيِّ شَيْءٍ اشْتَدَّ صِيَاحُكُمَا قَالَا فَعَلْنَا ذَلِكَ لِتَرْحَمَنَا قَالَ إِنَّ رَحْمَتِي لَكُمَا أَنْ تَنْطَلِقَا فَتُلْقِيَا أَنْفُسَكُمَا حَيْثُ كُنْتُمَا مِنْ النَّارِ فَيَنْطَلِقَانِ فَيُلْقِي أَحَدُهُمَا نَفْسَهُ فَيَجْعَلُهَا عَلَيْهِ بَرْدًا وَسَلَامًا وَيَقُومُ الْآخَرُ فَلَا يُلْقِي نَفْسَهُ فَيَقُولُ لَهُ الرَّبُّ عَزَّ وَجَلَّ مَا مَنَعَكَ أَنْ تُلْقِيَ نَفْسَكَ كَمَا أَلْقَى صَاحِبُكَ فَيَقُولُ يَا رَبِّ إِنِّي لَأَرْجُو أَنْ لَا تُعِيدَنِي فِيهَا بَعْدَ مَا أَخْرَجْتَنِي فَيَقُولُ لَهُ الرَّبُّ لَكَ رَجَاؤُكَ فَيَدْخُلَانِ جَمِيعًا الْجَنَّةَ بِرَحْمَةِ اللَّهِقَالَ أَبُو عِيسَى إِسْنَادُ هَذَا الْحَدِيثِ ضَعِيفٌ لِأَنَّهُ عَنْ رِشْدِينَ بْنِ سَعْدٍ وَرِشْدِينُ بْنُ سَعْدٍ هُوَ ضَعِيفٌ عِنْدَ أَهْلِ الْحَدِيثِ عَنْ ابْنِ أَنْعُمَ وَهُوَ الْأَفْرِيقِيُّ وَالْأَفْرِيقِيُّ ضَعِيفٌ عِنْدَ أَهْلِ الْحَدِيثِ",
        "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengabarkan kepada kami [Abdullah] telah mengabarkan kepada kami [Risydin] telah menceritakan kepadaku [Ibnu An'um] dari [Abu Utsman] bahwa dia menceritakan kepadanya dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam; \"Sesunguhnya ada dua orang yang masuk ke dalam neraka, keduanya menjerit dengan suara keras, maka Rabb 'azza wajalla memerintahkan (kepada Malaikat Zabaniyah): 'Keluarkanlah keduanya! ' Setelah keduanya dikeluarkan, maka Allah bertanya kepada keduanya: 'Untuk apa kalian berdua menjerit dengan suara keras? ' Keduanya menjawab; 'Kami melakukan demikian agar supaya Engkau mengasihani kami, ' kemudian Allah berfirman, 'Sesungguhnya rahmat-Ku untuk kalian berdua, hendaklah kalian berdua pergi lalu menceburkan diri kalian di tempat kalian dahulu berada dalam neraka, ' maka keduanya pergi, dan salah seorang dari keduanya menceburkan dirinya ke dalam neraka, namun Allah menjadikannya dingin dan selamat atasnya, sedangkan yang lain tetap berdiri dan tidak menceburkan dirinya, kemudian Allah 'azza wajalla bertanya kepadanya; 'Apa yang menghalangimu untuk menceburkan dirimu sebagaimana temanmu telah menceburkan dirinya? ' dia menjawab; 'Wahai Rabbku sesungguhnya aku sangat mengharap agar supaya Engkau tidak mengembalikanku ke dalamnya (neraka) setelah Engkau keluarkan aku darinya.' Maka Allah berfirman: 'Kamu mendapatkan apa yang kamu harapkan.' Kemudian keduanya masuk Surga dengan rahmat Allah\". Abu Isa berkata; 'Isnad hadits ini lemah, karena ia berasal dari Risydin bin Sa'ad. Sedangkan Risydin bin Sa'ad adalah seorang yang dhaif (lemah) menurut ahli hadits dari Ibnu An'um, karena dia seorang warga Afrika, sedangkan orang Afrika adalah dhaif menurut ahli hadits.'"
    },
    {
        "number": 2525,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا الْحَسَنُ بْنُ ذَكْوَانَ عَنْ أَبِي رَجَاءٍ الْعُطَارِدِيِّ عَنْ عِمْرَانَ بْنِ حُصَيْنٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَيَخْرُجَنَّ قَوْمٌ مِنْ أُمَّتِي مِنْ النَّارِ بِشَفَاعَتِي يُسَمَّوْنَ الْجَهَنَّمِيُّونَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَأَبُو رَجَاءٍ الْعُطَارِدِيُّ اسْمُهُ عِمْرَانُ بْنُ تَيْمٍ وَيُقَالُ ابْنُ مِلْحَانَ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Yahya bin Sa'id] telah menceritakan kepada kami [Al Hasan bin Dzakwan] dari [Abu Raja' Al 'Utharidi] dari [Imran bin Hushain] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Suatu kaum dari Ummatku pasti akan keluar dari neraka dengan Syafa'atku, mereka dinamakan al Jahannamiyyun (orang-orang neraka jahannam) \". Abu Isa berkata; 'Hadits ini hasan shahih, adapun Abu Raja' al 'Utharidi namanya adalah Imran bin Taim, dan dinamakan juga Ibnu Milhan.'"
    },
    {
        "number": 2526,
        "arab": "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ عَنْ يَحْيَى بْنِ عُبَيْدِ اللَّهِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا رَأَيْتُ مِثْلَ النَّارِ نَامَ هَارِبُهَا وَلَا مِثْلَ الْجَنَّةِ نَامَ طَالِبُهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ إِنَّمَا نَعْرِفُهُ مِنْ حَدِيثِ يَحْيَى بْنِ عُبَيْدِ اللَّهِ وَيَحْيَى بْنُ عُبَيْدِ اللَّهِ ضَعِيفٌ عِنْدَ أَكْثَرِ أَهْلِ الْحَدِيثِ تَكَلَّمَ فِيهِ شُعْبَةُ وَيَحْيَى بْنُ عُبَيْدِ اللَّهِ هُوَ ابْنُ مَوْهَبٍ وَهُوَ مَدَنِيٌّ",
        "id": "Telah menceritakan kepada kami [Suwaid] telah mengabarkan kepada kami [Abdullah] dari [Yahya bin Ubaidillah] dari [bapaknya] dari [Abu Hurairah] dia berkata Rasulullah shallallahu 'alaihi wasallam bersabda: \"Aku tidak melihat seperti (ketakutan yang berlebihan terhadap) api neraka (membuat) tidur orang yang ingin lari darinya. Dan aku tidak melihat seperti (kesungguhan menuju) surga membuat tidur orang yang mencari surga.\" Abu Isa berkata; 'Kami hanya mengetahui hadits ini dari hadits Yahya bin Ubaidillah, sedangkan Yahya bin Ubaidillah adalah lemah menurut kebanyakan ahli hadits di mana Syu'bah telah membicarakannya, dan Yahya bin Ubaidillah adalah Ibnu Mauhab, dan dia orang Madinah\"."
    },
    {
        "number": 2527,
        "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ حَدَّثَنَا أَيُّوبُ عَنْ أَبِي رَجَاءٍ الْعُطَارِدِيِّ قَال سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اطَّلَعْتُ فِي الْجَنَّةِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا الْفُقَرَاءَ وَاطَّلَعْتُ فِي النَّارِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ",
        "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Ismail bin Ibrahim] telah menceritakan kepada kami [Ayyub] dari [Abu Raja' al Utharidi], dia berkata, aku mendengar [Ibnu Abbas] berkata, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya memperhatikan surga, maka saya melihat mayoritas penduduknya adalah kaum fakir, dan saya memeriksa neraka, maka saya melihat mayoritas penduduknya adalah kaum wanita.\""
    },
    {
        "number": 2528,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ وَمُحَمَّدُ بْنُ جَعْفَرٍ وَعَبْدُ الْوَهَّابِ الثَّقَفِيُّ قَالُوا حَدَّثَنَا عَوْفٌ هُوَ ابْنُ أَبِي جَمِيلَةَ عَنْ أَبِي رَجَاءٍ الْعُطَارِدِيِّ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اطَّلَعْتُ فِي النَّارِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا النِّسَاءَ وَاطَّلَعْتُ فِي الْجَنَّةِ فَرَأَيْتُ أَكْثَرَ أَهْلِهَا الْفُقَرَاءَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَهَكَذَا يَقُولُ عَوْفٌ عَنْ أَبِي رَجَاءٍ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ وَيَقُولُ أَيُّوبُ عَنْ أَبِي رَجَاءٍ عَنْ ابْنِ عَبَّاسٍ وَكِلَا الْإِسْنَادَيْنِ لَيْسَ فِيهِمَا مَقَالٌ وَيُحْتَمَلُ أَنْ يَكُونَ أَبُو رَجَاءٍ سَمِعَ مِنْهُمَا جَمِيعًا وَقَدْ رَوَى غَيْرُ عَوْفٍ أَيْضًا هَذَا الْحَدِيثَ عَنْ أَبِي رَجَاءٍ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Ibnu Abi 'Adi] dan [Muhammad bin Ja'far] serta [Abdul Wahhab ats Tsaqafi] mereka berkata, telah menceritakan kepada kami [Auf], dan dia adalah Ibnu Abi Jamilah, dari [Abu Raja' al Utharidi] dari [Imran bin Hushain] dia berkata, Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saya memperhatikan neraka, maka saya melihat mayoritas penduduknya adalah kaum wanita, dan saya memmperhatikan surga, maka saya melihat mayoritas penduduknya adalah kaum fakir.\" Abu Isa berkata; 'Ini hadits hasan shahih. Demikianlah Auf berkata dari Abu Raja' dari Imran bin Hushain. Dan [Ayyub] berkata dari [Abu Raja'] dari [Ibnu Abbas]. Dan kedua sanadnya tidak terdapat pembicaraan di dalamnya. Dan mengandung kemungkinan bahwa Abu Raja' mendengar hadits tersebut dari kedua jalur itu semua. Selain Auf juga telah meriwayatkan hadits ini dari Abu Raja' dari Imran bin Hushain.'"
    },
    {
        "number": 2529,
        "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ عَنْ شُعْبَةَ عَنْ أَبِي إِسْحَقَ عَنْ النُّعْمَانِ بْنِ بَشِيرٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَهْوَنَ أَهْلِ النَّارِ عَذَابًا يَوْمَ الْقِيَامَةِ رَجُلٌ فِي أَخْمَصِ قَدَمَيْهِ جَمْرَتَانِ يَغْلِي مِنْهُمَا دِمَاغُهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْبَاب عَنْ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ وَأَبِي سَعِيدٍ الْخُدْرِيِّ وَأَبِي هُرَيْرَةَ",
        "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Wahab bin Jarir] dari [Syu'bah] dari [Abu Ishaq] dari [an Nu'man bin Basyir] bahwa Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya penduduk neraka yang adzabnya paling ringan pada hari kiamat adalah seorang laki-laki di mana pada tumit kedua kakinya terdapat dua bara api yang membuat otoknya mendidih disebabkan keduanya.\"Abu Isa berkata; 'Ini hadits hasan shahih. Dan dalam bab tersebut (juga diriwayatkan) dari al Abbas bin Abdul Muththalib dan Abu Sa'id al Khudri, serta Abu Hurairah.'"
    },
    {
        "number": 2530,
        "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو نُعَيْمٍ حَدَّثَنَا سُفْيَانُ عَنْ مَعْبَدِ بْنِ خَالِدٍ قَال سَمِعْتُ حَارِثَةَ بْنَ وَهْبٍ الْخُزَاعِيَّ يَقُولُسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ أَلَا أُخْبِرُكُمْ بِأَهْلِ الْجَنَّةِ كُلُّ ضَعِيفٍ مُتَضَعِّفٍ لَوْ أَقْسَمَ عَلَى اللَّهِ لَأَبَرَّهُ أَلَا أُخْبِرُكُمْ بِأَهْلِ النَّارِ كُلُّ عُتُلٍّ جَوَّاظٍ مُتَكَبِّرٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Nu'aim] telah menceritakan kepada kami [Sufyan] dari [Ma'bad bin Khalid] dia berkata, 'Saya mendengar [Haritsah bin Wahb al Khuza'i] berkata; Saya mendengar Nabi Shallallahu 'Alaihi Wasalam bersabda: \"Maukah kalian aku kabarkan tentang penduduk surga, yaitu setiap orang yang lemah lagi dilemahkan (diremehkan), kalau dia bersumpah (dengan nama Allah atas sesuatu) kepada Allah, niscaya Dia akan membaikinya (mengabulkannya). Maukah kalian aku beritahukan tentang penduduk neraka, yaitu setiap orang yang zhalim, keras lagi sombong.\" Abu Isa berkata; 'Ini hadits hasan shahih.'"
    }
  ]
}