{
    "kategori": "Kitab Sifat Surga",
  "hadits": [
    {
        "number": 2446,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ إِنَّ فِي الْجَنَّةِ لَشَجَرَةً يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ سَنَةٍوَفِي الْبَاب عَنْ أَنَسٍ وَأَبِي سَعِيدٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari [Sa'id bin Abu Sa'id Al Maqbari] dari [ayahnya] dari [Abu Hurairah] dari Rasulullah Shallallahu 'alaihi wa Salam, beliau bersabda: \"Sesungguhnya di surga ada pohon, seorang pengendara berjalan di dalam naungannya selama seratus tahun.\" Dalam hal ini ada hadits serupa dari Anas dan Abu Sa'id. Berkata Abu Isa: Hadits ini shahih."
    },
    {
        "number": 2447,
        "arab": "حَدَّثَنَا عَبَّاسٌ الدُّورِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى عَنْ شَيْبَانَ عَنْ فِرَاسٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْجَنَّةِ شَجَرَةٌ يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ عَامٍ لَا يَقْطَعُهَا وَقَالَ ذَلِكَ الظِّلُّ الْمَمْدُودُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مَنْ حَدِيثِ أَبِي سَعِيدٍ",
        "id": "Telah menceritakan kepada kami [Abbas Ad Duri] telah bercerita kepada kami [Ubaidullah bin Musa] dari [Syaiban] dari [Firas] dari ['Athiyyah] dari [Abu Sa'id Al Khudri] dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Di dalam syurga ada pohon (yang panjangnya sejauh) seorang pengendara berjalan di bawah naungannya selama seratus tahun dan tidak bisa menyelesaikannya, \" dan beliau berkata: Itulah maksud naungan yang terbentang luas.\" Abu Isa berkata: Hadits ini hasan gharib dari hadits Abu Sa'id."
    },
    {
        "number": 2448,
        "arab": "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا زِيَادُ بْنُ الْحَسَنِ بْنِ الْفُرَاتِ الْقَزَّازُ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ أَبِي حَازِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا فِي الْجَنَّةِ شَجَرَةٌ إِلَّا وَسَاقُهَا مِنْ ذَهَبٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami [Abu Sa'id Al Asyaj] telah bercerita kepada kami [Ziyad bin Al Hasan bin Al Furath Al Qazzaz] dari [bapaknya] dari [kakeknya] dari [Abu Hazim] dari [Abu Hurairah] berkata Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Tidak ada pohon di surga kecuali dahannya terbuat dari emas.\" Abu Isa berkata: Hadits ini hasan gharib."
    },
    {
        "number": 2449,
        "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ حَمْزَةَ الزَّيَّاتِ عَنْ زِيَادٍ الطَّائِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَقُلْنَا يَا رَسُولَ اللَّهِ مَا لَنَا إِذَا كُنَّا عِنْدَكَ رَقَّتْ قُلُوبُنَا وَزَهِدْنَا فِي الدُّنْيَا وَكُنَّا مِنْ أَهْلِ الْآخِرَةِ فَإِذَا خَرَجْنَا مِنْ عِنْدِكَ فَآنَسْنَا أَهَالِينَا وَشَمَمْنَا أَوْلَادَنَا أَنْكَرْنَا أَنْفُسَنَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَوْ أَنَّكُمْ تَكُونُونَ إِذَا خَرَجْتُمْ مِنْ عِنْدِي كُنْتُمْ عَلَى حَالِكُمْ ذَلِكَ لَزَارَتْكُمْ الْمَلَائِكَةُ فِي بُيُوتِكُمْ وَلَوْ لَمْ تُذْنِبُوا لَجَاءَ اللَّهُ بِخَلْقٍ جَدِيدٍ كَيْ يُذْنِبُوا فَيَغْفِرَ لَهُمْ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مِمَّ خُلِقَ الْخَلْقُ قَالَ مِنْ الْمَاءِ قُلْنَا الْجَنَّةُ مَا بِنَاؤُهَا قَالَ لَبِنَةٌ مِنْ فِضَّةٍ وَلَبِنَةٌ مِنْ ذَهَبٍ وَمِلَاطُهَا الْمِسْكُ الْأَذْفَرُ وَحَصْبَاؤُهَا اللُّؤْلُؤُ وَالْيَاقُوتُ وَتُرْبَتُهَا الزَّعْفَرَانُ مَنْ دَخَلَهَا يَنْعَمُ لَا يَبْأَسُ وَيَخْلُدُ لَا يَمُوتُ لَا تَبْلَى ثِيَابُهُمْ وَلَا يَفْنَى شَبَابُهُمْ ثُمَّ قَالَ ثَلَاثَةٌ لَا تُرَدُّ دَعْوَتُهُمْ الْإِمَامُ الْعَادِلُ وَالصَّائِمُ حِينَ يُفْطِرُ وَدَعْوَةُ الْمَظْلُومِ يَرْفَعُهَا فَوْقَ الْغَمَامِ وَتُفَتَّحُ لَهَا أَبْوَابُ السَّمَاءِ وَيَقُولُ الرَّبُّ عَزَّ وَجَلَّ وَعِزَّتِي لَأَنْصُرَنَّكِ وَلَوْ بَعْدَ حِينٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَيْسَ إِسْنَادُهُ بِذَاكَ الْقَوِيِّ وَلَيْسَ هُوَ عِنْدِي بِمُتَّصِلٍ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ بِإِسْنَادٍ آخَرَ عَنْ أَبِي مُدِلَّةَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
        "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Muhammad bin Fudlail] dari [Hamzah Az Zayyat] dari [Ziyad Ath Tho`i] dari [Abu Hurairah] berkata: Kami berkata: Wahai Rasulullah, kenapa kami bila berada di dekat baginda, hati kami melunak, kami zuhud di dunia dan kami termasuk ahli akhirat, tapi bila kami bergegas meninggalkan baginda lalu kami bergaul dengan keluargaku, mencium anak-anak kami, kami mengingkari diri kami sendiri (maksudnya agamis seperti semula). Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Andai kalian bila pergi meninggalkanku berada dalam kondisi kalian seperti itu, niscaya para malaikat mengunjungi kalian di rumah-rumah kalian dan seandainya kalian tidak berbuat dosa, niscaya Allah menciptakan makhluk baru agar mereka berbuat dosa lalu Allah akan mengampuni mereka.\" Berkata Abu Hurairah: Aku berkata: Wahai Rasulullah, dari apa makhluk diciptakan? Rasulullah Shallallahu 'alaihi wa Salam menjawab: \"Dari air.\" Kami bertanya: Surga, apa bangunanya? Beliau menjawab: Bata dari perak dan bata dari emas, semennya minyak kesturi yang harum, tanahnya mutiara dan permata, debunya za'faran, barangsiapa memasukinya, ia bersenang-senang dengan tidak jemu, kekal, tidak mati, baju mereka tidak usang, kemudaan mereka tidak lenyap.\" Setelah itu beliau bersabda: \"Tiga orang yang doanya tidak tertolak; imam adil, orang puasa saat berbuka dan doa orang yang terzhalimi, doanya diangkat diatas awan dan pintu-pintu langit dibukakan, Rabb 'azza wajalla berfirman: Demi keperkasaanKu, aku akan menolongmu meski setelah selang berapa lama.\" Berkata Abu Isa: Hadits ini sanadnya tidak kuat dan menurutku tidak tersambung. Hadits ini diriwayatkan dengan sanad lain dari [Abu Mudillah] dari [Abu Hurairah] dari nabi Shallallahu 'alaihi wa Salam."
    },
    {
        "number": 2450,
        "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ عَنْ النُّعْمَانِ بْنِ سَعْدٍ عَنْ عَلِيٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ فِي الْجَنَّةِ لَغُرَفًا يُرَى ظُهُورُهَا مِنْ بُطُونِهَا وَبُطُونُهَا مِنْ ظُهُورِهَا فَقَامَ إِلَيْهِ أَعْرَابِيٌّ فَقَالَ لِمَنْ هِيَ يَا رَسُولَ اللَّهِ قَالَ هِيَ لِمَنْ أَطَابَ الْكَلَامَ وَأَطْعَمَ الطَّعَامَ وَأَدَامَ الصِّيَامَ وَصَلَّى لِلَّهِ بِاللَّيْلِ وَالنَّاسُ نِيَامٌقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَقَدْ تَكَلَّمَ بَعْضُ أَهْلِ الْعِلْمِ فِي عَبْدِ الرَّحْمَنِ بْنِ إِسْحَقَ هَذَا مِنْ قِبَلِ حِفْظِهِ وَهُوَ كُوفِيٌّ وَعَبْدُ الرَّحْمَنِ بْنُ إِسْحَقَ الْقُرَشِيُّ مَدَنِيٌّ وَهُوَ أَثْبَتُ مِنْ هَذَا",
        "id": "Telah menceritakan kepada kami [Ali bin Hujr] telah menceritakan kepada kami [Ali bin Mashir] dari [Abdurrahman bin Ishaq] dari [An Nu'man bin Sa'ad] dari [Ali] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya di surga ada kamar-kamar, luarnya terlihat dari dalam dan dalamnya terlihat dari luar.\" Seorang badui menghampiri beliau, ia bertanya: Itu untuk siapa, wahai Rasulullah? Beliau menjawab: \"Bagi yang membiasakan ucapannya baik, memberi makan, puasa secara kontinyu, shalat malam untuk Allah saat orang-orang tidur.\" Berkata Abu Isa: Hadits ini gharib. Sebagian ahlul ilmi membicarakan Abdurrahman bin Ishaq dari sisi hafalannya, ia orang Kufah, sementara Abdurrahman bin Ishaq Al Qurasy, orang Madinah, lebih kuat hafalannya dari dia."
    },
    {
        "number": 2451,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ الصَّمَدِ أَبُو عَبْدِ الصَّمَدِ الْعَمِّيُّ عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اللَّهِ بْنِ قَيْسٍ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي الْجَنَّةِ جَنَّتَيْنِ آنِيَتُهُمَا وَمَا فِيهِمَا مِنْ فِضَّةٍ وَجَنَّتَيْنِ آنِيَتُهُمَا وَمَا فِيهِمَا مِنْ ذَهَبٍ وَمَا بَيْنَ الْقَوْمِ وَبَيْنَ أَنْ يَنْظُرُوا إِلَى رَبِّهِمْ إِلَّا رِدَاءُ الْكِبْرِيَاءِ عَلَى وَجْهِهِ فِي جَنَّةِ عَدْنٍوَبِهَذَا الْإِسْنَادِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي الْجَنَّةِ لَخَيْمَةً مِنْ دُرَّةٍ مُجَوَّفَةٍ عَرْضُهَا سِتُّونَ مِيلًا فِي كُلِّ زَاوِيَةٍ مِنْهَا أَهْلٌ مَا يَرَوْنَ الْآخَرِينَ يَطُوفُ عَلَيْهِمْ الْمُؤْمِنُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَأَبُو عِمْرَانَ الْجَوْنِيُّ اسْمُهُ عَبْدُ الْمَلِكِ بْنُ حَبِيبٍ وَأَبُو بَكْرِ بْنُ أَبِي مُوسَى قَالَ أَحْمَدُ بْنُ حَنْبَلٍ لَا يُعْرَفُ اسْمُهُ وَأَبُو مُوسَى الْأَشْعَرِيُّ اسْمُهُ عَبْدُ اللَّهِ بْنُ قَيْسٍ وَأَبُو مَالِكٍ الْأَشْعَرِيُّ اسْمُهُ سَعْدُ بْنُ طَارِقِ بْنِ أَشْيَمَ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abdul Aziz bin Abdush Shamad Abu Abdush Shamad Al 'Ammi] dari [Abu 'Imran Al Jauni] dari [Abu Bakar bin Abdullah bin Qais] dari [ayahnya] dari nabi Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya di surga ada dua taman, wadah-wadahnya dan segala isinya terbuat dari perak, dua taman lain wadah-wadahnya dan segala isinya terbuat dari emas, tidak ada yang menghalangi kaum untuk melihat Rabb mereka kecuali selendang kesombongan yang ada di wajahNya di surga 'Aden.\" Dengan sanad ini dari nabi Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya di surga ada kemah dari mutiara-luasnya enampuluh mil, disetiap sisinya ada penghuninya, mereka tidak melihat yang lain, mereka dikelilingi orang mu`min.\" Berkata Abu Isa: Hadits ini hasan shahih. Abu 'Imran Al Jauni namanya 'Abdul Malik bin Hubaib dan Abu Bakar bin Abu Musa. Ahmad bin Hambal berkata: Namanya tidak dikenal dan Abu Musa Al Asy'ari namanya Abdullah bin Qais sementara Abu Malik Al Asy'ari namanya Sa'ad bin Thariq bin Asyam."
    },
    {
        "number": 2452,
        "arab": "حَدَّثَنَا عَبَّاسٌ الْعَنْبَرِيُّ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا شَرِيكٌ عَنْ مُحَمَّدِ بْنِ جُحَادَةَ عَنْ عَطَاءٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْجَنَّةِ مِائَةُ دَرَجَةٍ مَا بَيْنَ كُلِّ دَرَجَتَيْنِ مِائَةُ عَامٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami [Abbas Al Anbari] telah bercerita kepada kami [Yazid bin Harun] telah bercerita kepada kami [Syarik] dari [Muhammad bin Juhadah] dari ['Atho'] dari [Abu Hurairah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Di dalam syurga ada seratus tingkatan, jarak di antara satu tingkatan dengan yang lain adalah seratus tahun.\" Abu Isa berkata: Hadits ini hasan gharib."
    },
    {
        "number": 2453,
        "arab": "حَدَّثَنَا قُتَيْبَةُ وَأَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ الْبَصْرِيُّ قَالَا حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ مُعَاذِ بْنِ جَبَلٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ صَامَ رَمَضَانَ وَصَلَّى الصَّلَوَاتِ وَحَجَّ الْبَيْتَ لَا أَدْرِي أَذَكَرَ الزَّكَاةَ أَمْ لَا إِلَّا كَانَ حَقًّا عَلَى اللَّهِ أَنْ يَغْفِرَ لَهُ إِنْ هَاجَرَ فِي سَبِيلِ اللَّهِ أَوْ مَكَثَ بِأَرْضِهِ الَّتِي وُلِدَ بِهَا قَالَ مُعَاذٌ أَلَا أُخْبِرُ بِهَذَا النَّاسَ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَرْ النَّاسَ يَعْمَلُونَ فَإِنَّ فِي الْجَنَّةِ مِائَةَ دَرَجَةٍ مَا بَيْنَ كُلِّ دَرَجَتَيْنِ كَمَا بَيْنَ السَّمَاءِ وَالْأَرْضِ وَالْفِرْدَوْسُ أَعْلَى الْجَنَّةِ وَأَوْسَطُهَا وَفَوْقَ ذَلِكَ عَرْشُ الرَّحْمَنِ وَمِنْهَا تُفَجَّرُ أَنْهَارُ الْجَنَّةِ فَإِذَا سَأَلْتُمُ اللَّهَ فَسَلُوهُ الْفِرْدَوْسَقَالَ أَبُو عِيسَى هَكَذَا رُوِيَ هَذَا الْحَدِيثُ عَنْ هِشَامِ بْنِ سَعْدٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ مُعَاذِ بْنِ جَبَلٍ وَهَذَا عِنْدِي أَصَحُّ مِنْ حَدِيثِ هَمَّامٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ عُبَادَةَ بْنِ الصَّامِتِ وَعَطَاءٌ لَمْ يُدْرِكْ مُعَاذَ بْنَ جَبَلٍ وَمُعَاذٌ قَدِيمُ الْمَوْتِ مَاتَ فِي خِلَافَةِ عُمَرَ",
        "id": "Telah menceritakan kepada kami [Qutaibah] dan [Ahmad bin 'Abdah Adl Dlabyi Al Bashri] keduanya berkata: Telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Zaid bin Aslam] dari ['Atho` bin Yasar] dari [Mu'adz bin Jabal], Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Barangsiapa puasa ramadlon, shalat lima waktu, haji ke baitullah -aku tidak tahu apakah beliau menyebut zakat atau tidak- kecuali laik bagi Allah untuk mengampuninya bila ia berhijrah di jalan Allah atau tinggal di kawasan tempat tinggalnya.\" Berkata Mu'adz: Bolehkah aku memberitahukannya kepada orang-orang? Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Biarkan mereka beramal karena sesungguhnya di surga ada seratus tingkat, masing-masing tingkat jaraknya antara langit dan bumi, dan Firdaus adalah surga tertinggi, tengah-tengahnya dan diatasnya 'arsy Ar Rahman, darinya sungai-sungai surga memancar. Bila kalian meminta pada Allah, mintalah Firdaus.\" Berkata Abu Isa: Seperti itulah hadits ini diriwayatkan dari Hisyam bin Sa'ad dari Zaid bin Aslam dari 'Atho bin Yasar dari Mu'adz bin Jabal dan menurutku ini lebih shahih dari hadits Hammam dari Zaid bin Aslam dari Atho bin Yasar dari Ubadah bin Ash Shamit. 'Atho` tidak bertemu Mu'adz bin Jabal, Mu'adz lebih dahulu meninggal dimasa khilafah Umar."
    },
    {
        "number": 2454,
        "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا هَمَّامٌ حَدَّثَنَا زَيْدُ بْنُ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ عُبَادَةَ بْنِ الصَّامِتِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْجَنَّةِ مِائَةُ دَرَجَةٍ مَا بَيْنَ كُلِّ دَرَجَتَيْنِ كَمَا بَيْنَ الْأَرْضِ وَالسَّمَاءِ وَالْفِرْدَوْسُ أَعْلَاهَا دَرَجَةً وَمِنْهَا تُفَجَّرُ أَنْهَارُ الْجَنَّةِ الْأَرْبَعَةُ وَمِنْ فَوْقِهَا يَكُونُ الْعَرْشُ فَإِذَا سَأَلْتُمُ اللَّهَ فَسَلُوهُ الْفِرْدَوْسَحَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ حَدَّثَنَا هَمَّامٌ عَنْ زَيْدِ بْنِ أَسْلَمَ نَحْوَهُ",
        "id": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman] telah mengkhabarkan kepada kami [Yazid bin Harun] telah mengkhabarkan kepada kami [Hammam] telah menceritakan kepada kami [Zaid bin Aslam] dari ['Atho` bin Yasar] dari ['Ubadah bin Ash Shamit] Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Di surga ada seratus tingkat, jarak antara masing-masing tingkat seperti antara bumi dan langit dan Firdaus adalah surga tertinggi, darinya empat sungai surga memancar, di atasnya 'arsy, bila kalian meminta kepada Allah, mintalah Firdaus.\" Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Yazid bin Harun] telah menceritakan kepada kami [Hammam] dari [Zaid bin Aslam] sepertinya."
    },
    {
        "number": 2455,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ دَرَّاجٍ عَنْ أَبِي الْهَيْثَمِ عَنْ أَبِي سَعِيدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي الْجَنَّةِ مِائَةَ دَرَجَةٍ لَوْ أَنَّ الْعَالَمِينَ اجْتَمَعُوا فِي إِحْدَاهُنَّ لَوَسِعَتْهُمْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Ibnu Lahi'ah] dari [Darraj] dari [Abu Al Haitsam] dari [Abu Sa'id] dari nabi Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya di surga ada seratus tingkat, seandainya seluruh alam berkumpul di salah satunya pasti memuat mereka.\" Berkata Abu Isa: Hadits ini gharib."
    },
    {
        "number": 2456,
        "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ حَدَّثَنَا فَرْوَةُ بْنُ أَبِي الْمَغْرَاءِ أَخْبَرَنَا عَبِيدَةُ بْنُ حُمَيْدٍ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ الْمَرْأَةَ مِنْ نِسَاءِ أَهْلِ الْجَنَّةِ لَيُرَى بَيَاضُ سَاقِهَا مِنْ وَرَاءِ سَبْعِينَ حُلَّةً حَتَّى يُرَى مُخُّهَا وَذَلِكَ بِأَنَّ اللَّهَ يَقُولُ{ كَأَنَّهُنَّ الْيَاقُوتُ وَالْمَرْجَانُ }فَأَمَّا الْيَاقُوتُ فَإِنَّهُ حَجَرٌ لَوْ أَدْخَلْتَ فِيهِ سِلْكًا ثُمَّ اسْتَصْفَيْتَهُ لَأُرِيتَهُ مِنْ وَرَائِهِحَدَّثَنَا هَنَّادٌ حَدَّثَنَا عَبِيدَةُ بْنُ حُمَيْدٍ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ عَطَاءِ بْنِ السَّائِبِ عَنْ عَمْرِو بْنِ مَيْمُونٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ نَحْوَهُ بِمَعْنَاهُ وَلَمْ يَرْفَعْهُ وَهَذَا أَصَحُّ مِنْ حَدِيثِ عَبِيدَةَ بْنِ حُمَيْدٍ وَهَكَذَا رَوَى جَرِيرٌ وَغَيْرُ وَاحِدٍ عَنْ عَطَاءِ بْنِ السَّائِبِ وَلَمْ يَرْفَعُوهُ حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا جَرِيرٌ عَنْ عَطَاءِ بْنِ السَّائِبِ نَحْوَ حَدِيثِ أَبِي الْأَحْوَصِ وَلَمْ يَرْفَعْهُ أَصْحَابُ عَطَاءٍ وَهَذَا أَصَحُّ",
        "id": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman] telah bercerita kepada kami [Farwah bin Abul Maghra'] telah bercerita kepada kami ['Abidah bin Humaid] dari ['Atho' bin As Sa'ib] dari [Amru bin Maimun] dari [Abdullah bin Mas'ud] dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Sesungguhnya putih betisnya seorang wanita penghuni syurga akan tampak kelihatan dari balik tujuh puluh kalin sampai terlihat tulangnya yang jernih, yang demikian itu karena Allah telah berfirman \"Seakan-akan bidadari itu permata yakut dan marjan.\" (Ar-Rahmaan: 58) adapun permata yaqutnya terbuat dari batu yang jika di masukkan kabel ke dalamnya kemudian kamu bersihkan, niscaya kamu akan dapat melihat dari belakangnya.\" Telah menceritakan kepada kami [Hannad] telah bercerita kepada kami ['Abidah bin Humaid] dari ['Atho` bin As Sa'ib] dari [Amru bin Maimun] dari [Abdullah bin Mas'ud] dari Nabi Shallallahu 'alaihi wa Salam dengan hadits yang semakna. Telah menceritakan kepada kami [Hannad] telah bercerita kepada kami [Abu Al Ahwas] dari [Atho' bin As Sa'ib] dari [Amru bin Maimun] dari [Abdullah bin Mas'ud] dengan hadits yang semakna dengannya namun tidak memarfu'kanya dan ini lebih shahih dari hadits 'Abidah bin Humaid, demikianlah Jarir dan yang lainnya meriwayatkan dari 'Atho` bin As Sa'ib dan mereka tidak memarfu'kannya. Telah menceritakan kepada kami [Qutaibah] telah bercerita kepada kami [Jarir] dari ['Atho` bin As Sa'ib] yang semakna dengan hadits Abul Ahwas namun sahabat 'Atho' tidak memarfu'kannya dan ini yang lebih shahih."
    },
    {
        "number": 2457,
        "arab": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا أَبِي عَنْ فُضَيْلِ بْنِ مَرْزُوقٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَوَّلَ زُمْرَةٍ يَدْخُلُونَ الْجَنَّةَ يَوْمَ الْقِيَامَةِ ضَوْءُ وُجُوهِهِمْ عَلَى مِثْلِ ضَوْءِ الْقَمَرِ لَيْلَةَ الْبَدْرِ وَالزُّمْرَةُ الثَّانِيَةُ عَلَى مِثْلِ أَحْسَنِ كَوْكَبٍ دُرِّيٍّ فِي السَّمَاءِ لِكُلِّ رَجُلٍ مِنْهُمْ زَوْجَتَانِ عَلَى كُلِّ زَوْجَةٍ سَبْعُونَ حُلَّةً يُرَى مُخُّ سَاقِهَا مِنْ وَرَائِهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Sufyan bin Waki'] telah menceritakan kepada kami [ayahku] dari [Fudlail bin Marzuq] dari ['Athiyah] dari [Abu Sa'id] dari nabi Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya golongan pertama yang masuk surga pada hari kiamat (adalah yang) mukanya bersinar seperti sinar bulan di malam purnama dan golongan kedua seperti bintang bersinar terang terindah dilangit, setiap lelaki di antara mereka mendapatkan dua istri, setiap istri mengenakan tujuhpuluh perhiasan, sungsumnya terlihat dari belakang.\" Berkata Abu Isa: Hadits ini hasan shahih."
    },
    {
        "number": 2458,
        "arab": "حَدَّثَنَا الْعَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى أَخْبَرَنَا شَيْبَانُ عَنْ فِرَاسٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أَوَّلُ زُمْرَةٍ تَدْخُلُ الْجَنَّةَ عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ وَالثَّانِيَةُ عَلَى لَوْنِ أَحْسَنِ كَوْكَبٍ دُرِّيٍّ فِي السَّمَاءِ لِكُلِّ رَجُلٍ مِنْهُمْ زَوْجَتَانِ عَلَى كُلِّ زَوْجَةٍ سَبْعُونَ حُلَّةً يَبْدُو مُخُّ سَاقِهَا مِنْ وَرَائِهَاقَالَ هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Al Abbas bin Muhammad Ad Dauri] telah menceritakan kepada kami ['Ubaidullah bin Musa] telah mengkhabarkan kepada kami [Syaiban] dari [Firas] dari ['Athiyah] dari [Abu Sa'id Al Khudri] dari nabi Shallallahu 'alaihi wa Salam bersabda: \"Golongan pertama yang masuk surga mereka bagaikan bulan di malam purnama dan golongan kedua seperti warna bintang bersinar terang terindah dilangit, setiap lelaki di antara mereka mendapatkan dua istri, setiap istri mengenakan tujuhpuluh perhiasan, sungsumnya terlihat dari belakang.\" Berkata Abu Isa: Hadits ini hasan shahih."
    },
    {
        "number": 2459,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَمَحْمُودُ بْنُ غَيْلَانَ قَالَا حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ عَنْ عِمْرَانَ الْقَطَّانِ عَنْ قَتَادَةَ عَنْ أَنَسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُعْطَى الْمُؤْمِنُ فِي الْجَنَّةِ قُوَّةَ كَذَا وَكَذَا مِنْ الْجِمَاعِ قِيلَ يَا رَسُولَ اللَّهِ أَوَ يُطِيقُ ذَلِكَ قَالَ يُعْطَى قُوَّةَ مِائَةٍوَفِي الْبَاب عَنْ زَيْدِ بْنِ أَرْقَمَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ غَرِيبٌ لَا نَعْرِفُهُ مِنْ حَدِيثِ قَتَادَةَ عَنْ أَنَسٍ إِلَّا مِنْ حَدِيثِ عِمْرَانَ الْقَطَّانِ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] dan [Mahmud bin Ghailan] keduanya berkata: telah menceritakan kepada kami [Abu Daud Ath Thayalisi] dari ['Imran Al Qattan] dari [Qatadah] dari [Anas] dari Nabi Shallallahu 'alaihi wa Salam beliau bersabda: \"Orang beriman kelak di syurga diberi kekuatan bersetubuh seperti ini dan seperti ini, \" ada yang bertanya: Wahai Rasulullah apakah mampu seperti itu? beliau menjawab: \"Mereka diberi kekuatan jima' sampai seratus kali lipat.\" Dan dalam bab ini ada hadits dari Zaid bin Arqam, Abu Isa berkata: Hadits ini shahih gharib, kami tidak mengetahuinya dari hadits Qotadah dari Anas kecuali dari hadits Imran Al Qattan."
    },
    {
        "number": 2460,
        "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا مَعْمَرٌ عَنْ هَمَّامِ بْنِ مُنَبِّهٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَوَّلُ زُمْرَةٍ تَلِجُ الْجَنَّةَ صُورَتُهُمْ عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ لَا يَبْصُقُونَ فِيهَا وَلَا يَمْخُطُونَ وَلَا يَتَغَوَّطُونَ آنِيَتُهُمْ فِيهَا الذَّهَبُ وَأَمْشَاطُهُمْ مِنْ الذَّهَبِ وَالْفِضَّةِ وَمَجَامِرُهُمْ مِنْ الْأُلُوَّةِ وَرَشْحُهُمْ الْمِسْكُ وَلِكُلِّ وَاحِدٍ مِنْهُمْ زَوْجَتَانِ يُرَى مُخُّ سُوقِهِمَا مِنْ وَرَاءِ اللَّحْمِ مِنْ الْحُسْنِ لَا اخْتِلَافَ بَيْنَهُمْ وَلَا تَبَاغُضَ قُلُوبُهُمْ قَلْبُ رَجُلٍ وَاحِدٍ يُسَبِّحُونَ اللَّهَ بُكْرَةً وَعَشِيًّاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ وَالْأُلُوَّةُ هُوَ الْعُودُ",
        "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Abdullah bin Al Mubarak] telah mengkhabarkan kepada kami [Ma'mar] dari [Hammam bin Munabbih] dari [Abu Hurairah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Golongan pertama yang masuk surga pada hari kiamat wujud mereka seperti sinar bulan di malam purnama, mereka tidak meludah didalamnya, tidak beringus dan tidak buang hajat, di surga, wadah-wadah mereka terbuat dari emas, sisir mereka terbuat dari emas dan perak, dupa mereka dari kayu cendana (uluwwah) dan keringat mereka kesturi, masing-masing dari mereka mendapat dua istri, sungsum keduanya terlihat dari balik daging karena indahnya, tidak ada sengketa di antara mereka dan hati mereka tidak saling murka, satu hati, mereka memahasucikan Allah dipagi dan disore hari.\" Berkata Abu Isa: Hadits ini shahih dan uluwwah adalah kayu cendana."
    },
    {
        "number": 2461,
        "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا ابْنُ الْمُبَارَكِ أَخْبَرَنَا ابْنُ لَهِيعَةَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ دَاوُدَ بْنِ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ أَبِيهِ عَنْ جَدِّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَوْ أَنَّ مَا يُقِلُّ ظُفُرٌ مِمَّا فِي الْجَنَّةِ بَدَا لَتَزَخْرَفَتْ لَهُ مَا بَيْنَ خَوَافِقِ السَّمَوَاتِ وَالْأَرْضِ وَلَوْ أَنَّ رَجُلًا مِنْ أَهْلِ الْجَنَّةِ اطَّلَعَ فَبَدَا أَسَاوِرُهُ لَطَمَسَ ضَوْءَ الشَّمْسِ كَمَا تَطْمِسُ الشَّمْسُ ضَوْءَ النُّجُومِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ بِهَذَا الْإِسْنَادِ إِلَّا مِنْ حَدِيثِ ابْنِ لَهِيعَةَ وَقَدْ رَوَى يَحْيَى بْنُ أَيُّوبَ هَذَا الْحَدِيثَ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ وَقَالَ عَنْ عُمَرَ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
        "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Ibnu Al Mubarak] telah mengkhabarkan kepada kami [Ibnu Lahi'ah] dari [Yazid bin Abu Habib] dari [Dawud bin 'Amir bin Sa'ad bin Abi Waqqash] dari [ayahnya] dari [kakeknya] dari nabi Shallallahu 'alaihi wa Salam bersabda: \"Andai yang dibawa kuku dalam surga terlihat niscaya antara sisi-sisi langit dan bumi akan terhiasi karenanya, andai seorang penghuni surga muncul lalu gelang-gelangnya terlihat niscaya padamlah matahari seperti matahari melenyapkan cahaya bintang-bintang. Berkata Abu Isa: Hadits ini gharib, kami hanya mengetahui sanad ini dari hadits Ibnu Lahi'ah. [Yahya bin Ayyub] meriwayatkan hadits ini dari [Yazid bin Abu Habib] dan berkata: Dari [Umar bin Sa'ad bin Abi Waqqash] dari nabi Shallallahu 'alaihi wa Salam."
    },
    {
        "number": 2462,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَأَبُو هِشَامٍ الرِّفَاعِيُّ قَالَا حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ عَنْ أَبِيهِ عَنْ عَامِرٍ الْأَحْوَلِ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهْلُ الْجَنَّةِ جُرْدٌ مُرْدٌ كُحْلٌ لَا يَفْنَى شَبَابُهُمْ وَلَا تَبْلَى ثِيَابُهُمْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] dan [Abu Hisyam Ar Rifa'i] keduanya berkata: Telah menceritakan kepada kami [Mu'adz bin Hisyam] dari [ayahnya] dari ['Amir Al Ahwal] dari [Syahr bin Hausyab] dari [Abu Hurairah] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Penghuni surga itu tidak berbulu, tidak berjenggot, mengenakan calak mata, kemudaan mereka tidak hilang dan baju mereka tidak pernah usang.\" Berkata Abu Isa: Hadits ini hasan gharib."
    },
    {
        "number": 2463,
        "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ دَرَّاجٍ أَبِي السَّمْحِ عَنْ أَبِي الْهَيْثَمِ عَنْ أَبِي سَعِيدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِهِ{ وَفُرُشٍ مَرْفُوعَةٍ }قَالَ ارْتِفَاعُهَا لَكَمَا بَيْنَ السَّمَاءِ وَالْأَرْضِ مَسِيرَةَ خَمْسِ مِائَةِ سَنَةٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ رِشْدِينَ بْنِ سَعْدٍ و قَالَ بَعْضُ أَهْلِ الْعِلْمِ فِي تَفْسِيرِ هَذَا الْحَدِيثِ إِنَّ مَعْنَاهُ الْفُرُشَ فِي الدَّرَجَاتِ وَبَيْنَ الدَّرَجَاتِ كَمَا بَيْنَ السَّمَاءِ وَالْأَرْضِ",
        "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Risydin bin Sa'ad] dari [Amru bin Al Harits] dari [Darraj Abu As Samah] dari [Abu Al Haitsam] dari [Abu Sa'id] dari nabi Shallallahu 'alaihi wa Salam tentang firman Allah: \"Dan hamparan-hamparan (permadani-permadani) yang ditinggikan.\" (QS. Alwaqi'ah 64), Beliau bersabda: \"Tingginya sama seperti antara langit dan bumi, perjalanan limaratus tahun.\" Berkata Abu Isa: Hadits ini gharib, kami hanya mengetahuinya dari hadits Risydin bin Sa'ad. Sebagaian ahlul ilmi berkata tentang penafsiran hadits ini, maknanya tingkatan hamparan-hamparan dan jarak masing-masing tingkatan itu seperti antara langit dan bumi."
    },
    {
        "number": 2464,
        "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا يُونُسُ بْنُ بُكَيْرٍ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ يَحْيَى بْنِ عَبَّادِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ عَنْ أَبِيهِ عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ قَالَتْسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ وَذُكِرَ لَهُ سِدْرَةُ الْمُنْتَهَى قَالَ يَسِيرُ الرَّاكِبُ فِي ظِلِّ الْفَنَنِ مِنْهَا مِائَةَ سَنَةٍ أَوْ يَسْتَظِلُّ بِظِلِّهَا مِائَةُ رَاكِبٍ شَكَّ يَحْيَى فِيهَا فِرَاشُ الذَّهَبِ كَأَنَّ ثَمَرَهَا الْقِلَالُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami [Abu Kuraib] telah bercerita kepada kami [Yunus bin Bukair] dari [Muhammad bin Ishaq] dari [Yahya bin 'Abbad bin Abdullah bin Az Zubair] dari [bapaknya] dari [Asma' binti Abu Bakar] berkata: Aku mendengar Rasulullah Shallallahu 'alaihi wa Salam bersabda ketika disebutkan kepadanya Sidrotul Muntaha beliau bersabda: \"Seorang pengendara berjalan di bawah naungan dahan pohonnya selama seratus tahun atau seratus orang pengendara bernaung di bawahnya ---(Yahya ragu) kepastian redaksinya-yang dalam naungan itu sarat dengan anai anai dari emas, buahnya seperti tempayan.\" Abu Isa berkata: Hadits ini hasan shahih gharib."
    },
    {
        "number": 2465,
        "arab": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ مُسْلِمٍ عَنْ أَبِيهِ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَسُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا الْكَوْثَرُ قَالَ ذَاكَ نَهْرٌ أَعْطَانِيهِ اللَّهُ يَعْنِي فِي الْجَنَّةِ أَشَدُّ بَيَاضًا مِنْ اللَّبَنِ وَأَحْلَى مِنْ الْعَسَلِ فِيهَا طَيْرٌ أَعْنَاقُهَا كَأَعْنَاقِ الْجُزُرِ قَالَ عُمَرُ إِنَّ هَذِهِ لَنَاعِمَةٌ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَكَلَتُهَا أَحْسَنُ مِنْهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ مُسْلِمٍ هُوَ ابْنُ أَخِي ابْنِ شِهَابٍ الزُّهْرِيِّ وَعَبْدُ اللَّهِ بْنُ مُسْلِمٍ قَدْ رَوَى عَنْ ابْنِ عُمَرَ وَأَنَسِ بْنِ مَالِكٍ",
        "id": "Telah menceritakan kepada kami [Abd bin Humaid] telah mengkhabarkan kepada kami [Abdullah bin Maslamah] dari [Muhammad bin Abdullah bin Muslim] dari [bapaknya] dari [Anas bin Malik] berkata: Suatu ketika Rasulullah Shallallahu 'alaihi wa Salam ditanya: Apa artinya KAUTSAR? beliau menjawab: Itu adalah sungai yang Allah berikan kepadaku, yaitu di surga, warnanya lebih putih dari air susu dan rasanya lebih manis dari madu, di dalamnya ada burung yang lehernya seperti leher onta.\" Umar berkata: Sesungguhnya ini adalah benar benar kenikmatan, Rasulullah Shallallahu 'alaihi wa Salam bersabda: Aku telah memakan yang lebih baik darinya.\" Abu Isa berkata: Hadits ini hasan gharib, adapun Muhammad bin Abdullah bin Muslim dia adalah anak saudara Ibnu Syihab Az Zuhri, dan Abdullah bin Muslim meriwayatkan dari Ibnu Umar dan Anas bin Malik."
    },
    {
        "number": 2466,
        "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ قَالَ أَخْبَرَنَا عَاصِمُ بْنُ عَلِيٍّ حَدَّثَنَا الْمَسْعُودِيُّ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنْ أَبِيهِأَنَّ رَجُلًا سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ هَلْ فِي الْجَنَّةِ مِنْ خَيْلٍ قَالَ إِنْ اللَّهُ أَدْخَلَكَ الْجَنَّةَ فَلَا تَشَاءُ أَنْ تُحْمَلَ فِيهَا عَلَى فَرَسٍ مِنْ يَاقُوتَةٍ حَمْرَاءَ يَطِيرُ بِكَ فِي الْجَنَّةِ حَيْثُ شِئْتَ قَالَ وَسَأَلَهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ هَلْ فِي الْجَنَّةِ مِنْ إِبِلٍ قَالَ فَلَمْ يَقُلْ لَهُ مِثْلَ مَا قَالَ لِصَاحِبِهِ قَالَ إِنْ يُدْخِلْكَ اللَّهُ الْجَنَّةَ يَكُنْ لَكَ فِيهَا مَا اشْتَهَتْ نَفْسُكَ وَلَذَّتْ عَيْنُكَحَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ عَنْ سُفْيَانَ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَابِطٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ بِمَعْنَاهُ وَهَذَا أَصَحُّ مِنْ حَدِيثِ الْمَسْعُودِيِّ",
        "id": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman] berkata: Telah mengkhabarkan kepada kami ['Ashim bin Ali] telah menceritakan kepada kami [Al Mas'udi] dari ['Alqamah bin Murtsid] dari [Sulaiman bin Buraidah] dari [ayahnya], seseorang bertanya kepada Rasulullah Shallallahu 'alaihi wa Salam: Wahai Rasulullah, apakah di surga ada kuda? Beliau menjawab: Bila Allah memasukkanmu ke surga, kau akan dibawa di atas kuda dari permata merah di surga yang membawamu terbang di surga semaumu.\" Orang lain bertanya pada beliau: Wahai Rasulullah, apakah di surga ada unta? Beliau tidak menjawab seperti yang dikatakan kepada temannya, beliau bersabda: \"Bila Allah memasukkanmu ke surga, didalamnya ada segala yang diinginkan oleh jiwamu dan dipandang nikmat oleh matamu.\" Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Abdullah bin Al Mubarak] dari [Sufyan] dari ['Alqamah bin Murtsid] dari [Abdurrahman bin Sabith] dari nabi Shallallahu 'alaihi wa Salam sepertinya dengan maknanya dan ini lebih shahih dari hadits Al Mas'udi."
    },
    {
        "number": 2467,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ بْنِ سَمُرَةَ الْأَحْمَسِيُّ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ وَاصِلٍ هُوَ ابْنُ السَّائِبِ عَنْ أَبِي سَوْرَةَ عَنْ أَبِي أَيُّوبَ قَالَأَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْرَابِيٌّ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي أُحِبُّ الْخَيْلَ أَفِي الْجَنَّةِ خَيْلٌ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنْ أُدْخِلْتَ الْجَنَّةَ أُتِيتَ بِفَرَسٍ مِنْ يَاقُوتَةٍ لَهُ جَنَاحَانِ فَحُمِلْتَ عَلَيْهِ ثُمَّ طَارَ بِكَ حَيْثُ شِئْتَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَيْسَ إِسْنَادُهُ بِالْقَوِيِّ وَلَا نَعْرِفُهُ مِنْ حَدِيثِ أَبِي أَيُّوبَ إِلَّا مِنْ هَذَا الْوَجْهِ وَأَبُو سَوْرَةَ هُوَ ابْنُ أَخِي أَبِي أَيُّوبَ يُضَعَّفُ فِي الْحَدِيثِ ضَعَّفَهُ يَحْيَى بْنُ مَعِينٍ جِدًّا قَالَ و سَمِعْت مُحَمَّدَ بْنَ إِسْمَعِيلَ يَقُولُ أَبُو سَوْرَةَ هَذَا مُنْكَرُ الْحَدِيثِ يَرْوِي مَنَاكِيرَ عَنْ أَبِي أَيُّوبَ لَا يُتَابَعُ عَلَيْهَا",
        "id": "Telah menceritakan kepada kami [Muhammad bin Isma'il bin Samurah Al Ahmasi] telah bercerita kepada kami [Abu Mu'awiyah] dari [Washil bin As Sa'ib] dari [Abu Saurah] dari [Abu Ayyub] berkata: Seorang badui datang kepada Nabi Shallallahu 'alaihi wa Salam lalu berkata: Wahai Rasulullah sesungguhnya aku menyukai kuda apakah di syurga ada kuda? Rasulullah Shallallahu 'alaihi wa Salam menjawab: Jika kamu di masukkan ke dalam syurga maka kamu akan diberi kuda dari yaqut yang mempunyai dua sayap dan kamu akan dibawa kemudian terbang kemana saja yang kamu sukai.\" Abu Isa berkata: Hadits ini sanadnya tidak sedemikian kuat, kami tidak mengetahuinya dari hadits Abu Ayyub kecuali dari jalur sanad ini, adapun Abu Saurah dia adalah anak saudaranya Abu Ayyub, dia dilemahkan dalam masalah hadits, Yahya bin Ma'in telah melemahkannya sama sekali. Dia berkata: Aku mendengar Muhammad bin Isma'il berkata: Abu Saurah ini haditsnya munkar, dia banyak meriwayatkan hadits hadits munkar dari Abu Ayyub dan tidak ada yang mengikuti riwatatnya."
    },
    {
        "number": 2468,
        "arab": "حَدَّثَنَا أَبُو هُرَيْرَةَ مُحَمَّدُ بْنُ فِرَاسٍ الْبَصْرِيُّ حَدَّثَنَا أَبُو دَاوُدَ حَدَّثَنَا عِمْرَانُ أَبُو الْعَوَّامِ عَنْ قَتَادَةَ عَنْ شَهْرِ بْنِ حَوْشَبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ غَنْمٍ عَنْ مُعَاذِ بْنِ جَبَلٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَدْخُلُ أَهْلُ الْجَنَّةِ الْجَنَّةَ جُرْدًا مُرْدًا مُكَحَّلِينَ أَبْنَاءَ ثَلَاثِينَ أَوْ ثَلَاثٍ وَثَلَاثِينَ سَنَةًقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَبَعْضُ أَصْحَابِ قَتَادَةَ رَوَوْا هَذَا عَنْ قَتَادَةَ مُرْسَلًا وَلَمْ يُسْنِدُوهُ",
        "id": "Telah menceritakan kepada kami [Abu Hurairah Muhammad bin Firas Al Bashri] telah menceritakan kepada kami [Abu Dawud] telah menceritakan kepada kami ['Imran Abu Al 'Awwam] dari [Qatadah] dari [Syahr bin Hausyab] dari [Abdurrahman bin Ghanm] dari [Mu'adz bin Jabal] nabi Shallallahu 'alaihi wa Salam bersabda: \"Penghuni surga masuk surga dalam keadaan tidak berbulu, tidak berjenggot, mengenakan calak mata, berumur tigapuluh atau tigapuluh tiga tahun.\" Berkata Abu Isa: Hadits ini hasan gharib dan sebagian sahabat Qatadah meriwayatkan hadits ini dari Qatadah secara mursal, mereka tidak menyandarkannya."
    },
    {
        "number": 2469,
        "arab": "حَدَّثَنَا حُسَيْنُ بْنُ يَزِيدَ الطَّحَّانُ الْكُوفِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ ضِرَارِ بْنِ مُرَّةَ عَنْ مُحَارِبِ بْنِ دِثَارٍ عَنْ ابْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَهْلُ الْجَنَّةِ عِشْرُونَ وَمِائَةُ صَفٍّ ثَمَانُونَ مِنْهَا مِنْ هَذِهِ الْأُمَّةِ وَأَرْبَعُونَ مِنْ سَائِرِ الْأُمَمِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا وَمِنْهُمْ مَنْ قَالَ عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ وَحَدِيثُ أَبِي سِنَانٍ عَنْ مُحَارِبِ بْنِ دِثَارٍ حَسَنٌ وَأَبُو سِنَانٍ اسْمُهُ ضِرَارُ بْنُ مُرَّةَ وَأَبُو سِنَانٍ الشَّيْبَانِيُّ اسْمُهُ سَعِيدُ بْنُ سِنَانٍ وَهُوَ بَصْرِيٌّ وَأَبُو سِنَانٍ الشَّامِيُّ اسْمُهُ عِيسَى بْنُ سِنَانٍ هُوَ الْقَسْمَلِيُّ",
        "id": "Telah menceritakan kepada kami [Husain bin Yazid Ath Thahhan Al Kufi] telah menceritakan kepada kami [Muhammad bin Fudlail] dari [Dlirar bin Murrah] dari [Muharib bin Ditsar] dari [Ibnu Buraidah] dari [ayahnya] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Penghuni surga itu sebanyak seratus duapuluh baris, delapan puluh diantaranya dari ummat ini dan empatpuluhnya dari seluruh ummat.\" Berkata Abu Isa: Hadits ini hasan. Hadits ini diriwayatkan dari ['Alqamah bin Murtsid] dari [Sulaiman bin Buraidah] dari nabi Shallallahu 'alaihi wa Salam secara mursal. Diantara mereka ada yang berkata: Dari Sulaiman bin Buraidah dari ayahnya dan hadits Abu Sinan bin Ditsar adalah hadits hasan, namanya Dlirar bin Murrah dan Abu Sinan Asy Syaibani namanya Sa'id bin Sinan, ia orang Bashrah, Abu Sinan Asy Syami namanya 'Isa bin Sinan adalah orang Qasmali."
    },
    {
        "number": 2470,
        "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ أَنْبَأَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ قَال سَمِعْتُ عَمْرَو بْنَ مَيْمُونٍ يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَكُنَّا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قُبَّةٍ نَحْوًا مِنْ أَرْبَعِينَ فَقَالَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتَرْضَوْنَ أَنْ تَكُونُوا رُبُعَ أَهْلِ الْجَنَّةِ قَالُوا نَعَمْ قَالَ أَتَرْضَوْنَ أَنْ تَكُونُوا ثُلُثَ أَهْلِ الْجَنَّةِ قَالُوا نَعَمْ قَالَ أَتَرْضَوْنَ أَنْ تَكُونُوا شَطْرَ أَهْلِ الْجَنَّةِ إِنَّ الْجَنَّةَ لَا يَدْخُلُهَا إِلَّا نَفْسٌ مُسْلِمَةٌ مَا أَنْتُمْ فِي الشِّرْكِ إِلَّا كَالشَّعْرَةِ الْبَيْضَاءِ فِي جِلْدِ الثَّوْرِ الْأَسْوَدِ أَوْ كَالشَّعْرَةِ السَّوْدَاءِ فِي جِلْدِ الثَّوْرِ الْأَحْمَرِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَفِي الْبَاب عَنْ عِمْرَانَ بْنِ حُصَيْنٍ وَأَبِي سَعِيدٍ الْخُدْرِيِّ",
        "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Dawud] telah memberitakan kepada kami [Syu'bah] dari [Abu Ishaq] berkata: Aku mendengar [Amru bin Maimun] menceritakan dari [Abdullah bin Mas'ud] berkata: Kami bersama nabi Shallallahu 'alaihi wa Salam di kubah sekitar empat puluh orang lalu Rasulullah Shallallahu 'alaihi wa Salam bertanya kepada kami: \"Maukah kalian menjadi seperempat penghuni surga?\" mereka menjawab: Ya. Beliau bertanya: \"Maukah kalian menjadi sepertiga penghuni surga?\" mereka menjawab: Ya.\"Maukah kalian menjadi separuh penghuni surga, sesungguhnya surga hanya dimasuki oleh jiwa yang muslim, tidaklah kalian dalam kesyirikan kecuali seperti bulu putih di kulit kerbau atau seperti bulu hitam di kulit kerbau merah.\" Berkata Abu Isa: Hadits ini hasan shahih. Dalam hal ini ada hadits serupa dari 'Imran bin Hushain dan Abu Sa'id Al Khudri."
    },
    {
        "number": 2471,
        "arab": "حَدَّثَنَا الْفَضْلُ بْنُ الصَّبَّاحِ الْبَغْدَادِيُّ حَدَّثَنَا مَعْنُ بْنُ عِيسَى الْقَزَّازُ عَنْ خَالِدِ بْنِ أَبِي بَكْرٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَابُ أُمَّتِي الَّذِي يَدْخُلُونَ مِنْهُ الْجَنَّةَ عَرْضُهُ مَسِيرَةُ الرَّاكِبِ الْمُجَوِّدِ ثَلَاثًا ثُمَّ إِنَّهُمْ لَيُضْغَطُونَ عَلَيْهِ حَتَّى تَكَادُ مَنَاكِبُهُمْ تَزُولُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ قَالَ سَأَلْتُ مُحَمَّدًا عَنْ هَذَا الْحَدِيثِ فَلَمْ يَعْرِفْهُ و قَالَ لِخَالِدِ بْنِ أَبِي بَكْرٍ مَنَاكِيرُ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ",
        "id": "Telah menceritakan kepada kami [Al Fadlal bin Ash Shabbah Al Baghdadi] telah bercerita kepada kami [Ma'an bin 'Isa Al Fazari] dari [Khalid bin Abu Bakar] dari [Salim bin Abdullah] dari [bapaknya] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Pintu masuk masuk surga ummatku luasnya seperti perjalanan seorang penunggang kuda yang cakap selama tiga, kemudian mereka akan berdesak desakan memasukinya sampai hampir hampir punggung mereka hilang.\" Abu Isa berkata: Hadits ini gharib, dia berkata: Aku bertanya kepada Muhammad tentang hadits ini namun dia tidak mengetahuinya dan berkata: Khalid bin Abu Bakar mempunyai hadits-hadits munkar yang dia riwayatkan dari Salim bin Abdullah."
    },
    {
        "number": 2472,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَعِيلَ حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ حَبِيبِ بْنِ أَبِي الْعِشْرِينَ حَدَّثَنَا الْأَوْزَاعِيُّ حَدَّثَنَا حَسَّانُ بْنُ عَطِيَّةَ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ أَنَّهُ لَقِيَ أَبَا هُرَيْرَةَفَقَالَ أَبُو هُرَيْرَةَ أَسْأَلُ اللَّهَ أَنْ يَجْمَعَ بَيْنِي وَبَيْنَكَ فِي سُوقِ الْجَنَّةِ فَقَالَ سَعِيدٌ أَفِيهَا سُوقٌ قَالَ نَعَمْ أَخْبَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّ أَهْلَ الْجَنَّةِ إِذَا دَخَلُوهَا نَزَلُوا فِيهَا بِفَضْلِ أَعْمَالِهِمْ ثُمَّ يُؤْذَنُ فِي مِقْدَارِ يَوْمِ الْجُمُعَةِ مِنْ أَيَّامِ الدُّنْيَا فَيَزُورُونَ رَبَّهُمْ وَيُبْرِزُ لَهُمْ عَرْشَهُ وَيَتَبَدَّى لَهُمْ فِي رَوْضَةٍ مِنْ رِيَاضِ الْجَنَّةِ فَتُوضَعُ لَهُمْ مَنَابِرُ مِنْ نُورٍ وَمَنَابِرُ مِنْ لُؤْلُؤٍ وَمَنَابِرُ مِنْ يَاقُوتٍ وَمَنَابِرُ مِنْ زَبَرْجَدٍ وَمَنَابِرُ مِنْ ذَهَبٍ وَمَنَابِرُ مِنْ فِضَّةٍ وَيَجْلِسُ أَدْنَاهُمْ وَمَا فِيهِمْ مِنْ دَنِيٍّ عَلَى كُثْبَانِ الْمِسْكِ وَالْكَافُورِ وَمَا يَرَوْنَ أَنَّ أَصْحَابَ الْكَرَاسِيِّ بِأَفْضَلَ مِنْهُمْ مَجْلِسًا قَالَ أَبُو هُرَيْرَةَ قُلْتُ يَا رَسُولَ اللَّهِ وَهَلْ نَرَى رَبَّنَا قَالَ نَعَمْ قَالَ هَلْ تَتَمَارَوْنَ فِي رُؤْيَةِ الشَّمْسِ وَالْقَمَرِ لَيْلَةَ الْبَدْرِ قُلْنَا لَا قَالَ كَذَلِكَ لَا تُمَارَوْنَ فِي رُؤْيَةِ رَبِّكُمْ وَلَا يَبْقَى فِي ذَلِكَ الْمَجْلِسِ رَجُلٌ إِلَّا حَاضَرَهُ اللَّهُ مُحَاضَرَةً حَتَّى يَقُولَ لِلرَّجُلِ مِنْهُمْ يَا فُلَانُ بْنَ فُلَانٍ أَتَذْكُرُ يَوْمَ قُلْتَ كَذَا وَكَذَا فَيُذَكَّرُ بِبَعْضِ غَدْرَاتِهِ فِي الدُّنْيَا فَيَقُولُ يَا رَبِّ أَفَلَمْ تَغْفِرْ لِي فَيَقُولُ بَلَى فَسَعَةُ مَغْفِرَتِي بَلَغَتْ بِكَ مَنْزِلَتَكَ هَذِهِ فَبَيْنَمَا هُمْ عَلَى ذَلِكَ غَشِيَتْهُمْ سَحَابَةٌ مِنْ فَوْقِهِمْ فَأَمْطَرَتْ عَلَيْهِمْ طِيبًا لَمْ يَجِدُوا مِثْلَ رِيحِهِ شَيْئًا قَطُّ وَيَقُولُ رَبُّنَا تَبَارَكَ وَتَعَالَى قُومُوا إِلَى مَا أَعْدَدْتُ لَكُمْ مِنْ الْكَرَامَةِ فَخُذُوا مَا اشْتَهَيْتُمْ فَنَأْتِي سُوقًا قَدْ حَفَّتْ بِهِ الْمَلَائِكَةُ فِيهِ مَا لَمْ تَنْظُرْ الْعُيُونُ إِلَى مِثْلِهِ وَلَمْ تَسْمَعْ الْآذَانُ وَلَمْ يَخْطُرْ عَلَى الْقُلُوبِ فَيُحْمَلُ لَنَا مَا اشْتَهَيْنَا لَيْسَ يُبَاعُ فِيهَا وَلَا يُشْتَرَى وَفِي ذَلِكَ السُّوقِ يَلْقَى أَهْلُ الْجَنَّةِ بَعْضُهُمْ بَعْضًا قَالَ فَيُقْبِلُ الرَّجُلُ ذُو الْمَنْزِلَةِ الْمُرْتَفِعَةِ فَيَلْقَى مَنْ هُوَ دُونَهُ وَمَا فِيهِمْ دَنِيٌّ فَيَرُوعُهُ مَا يَرَى عَلَيْهِ مِنْ اللِّبَاسِ فَمَا يَنْقَضِي آخِرُ حَدِيثِهِ حَتَّى يَتَخَيَّلَ إِلَيْهِ مَا هُوَ أَحْسَنُ مِنْهُ وَذَلِكَ أَنَّهُ لَا يَنْبَغِي لِأَحَدٍ أَنْ يَحْزَنَ فِيهَا ثُمَّ نَنْصَرِفُ إِلَى مَنَازِلِنَا فَيَتَلَقَّانَا أَزْوَاجُنَا فَيَقُلْنَ مَرْحَبًا وَأَهْلًا لَقَدْ جِئْتَ وَإِنَّ بِكَ مِنْ الْجَمَالِ أَفْضَلَ مِمَّا فَارَقْتَنَا عَلَيْهِ فَيَقُولُ إِنَّا جَالَسْنَا الْيَوْمَ رَبَّنَا الْجَبَّارَ وَيَحِقُّنَا أَنْ نَنْقَلِبَ بِمِثْلِ مَا انْقَلَبْنَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَقَدْ رَوَى سُوَيْدُ بْنُ عَمْرٍو عَنْ الْأَوْزَاعِيِّ شَيْئًا مِنْ هَذَا الْحَدِيثِ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Isma'il] telah menceritakan kepada kami [Hisyam bin 'Ammar] telah menceritakan kepada kami [Abdul Hamid bin Habib bin Abu Al 'Isyrin] telah menceritakan kepada kami [Al Auza'i] telah menceritakan kepada kami [Hassan bin 'Athiyah] dari [Sa'id bin Al Musayyib] ia bertemu [Abu Hurairah] lalu Abu Hurairah berkata: Aku meminta kepada Allah semoga menyatukanku denganmu di pasar surga. Sa'id bertanya: Apa disana ada pasar? Abu Hurairah menjawab: Ya, telah menghabarkan kepadaku Rasulullah Shallallahu 'alaihi wa Salam, bahwa penghuni surga bila masuk surga, mereka tinggal di sana karena keutamaan amal-amal mereka, kemudian diizinkan seukuran hari jum'at dari hari-hari dunia lalu mereka mengunjungi Rabb mereka kemudian Rabb menampakkan 'arsyNya pada mereka, salah satu taman surga nampak pada mereka kemudian mimbar-mimbar dari cahaya, mimbar-mimbar dari mutiara, mimbar-mimbar dari yaqut, mimbar-mimbar dari permata, mimbar-mimbar dari emas, mimbar-mimbar dari perak diletakkan untuk mereka, yang paling rendah di antara mereka beserta tingkat kerendahannya duduk di atas gundukan tanah kesturi dan kafur dan mereka beranggapan tempat duduk para pemilik kursi tidak lebih baik dari mereka.\" Abu Hurairah bertanya: Wahai Rasulullah, apakah kita akan melihat Rabb kita? Beliau menjawab: \"Ya.\" Rasulullah Shallallahu 'alaihi wa Salam bertanya: \"Apakah kalian kesulitan saat melihat matahari dan bulan di malam purnama?\" Kami menjawab: Tidak. Beliau bersabda: \"Seperti itu juga kalian tidak kesulitan dalam melihat Rabb kalian. Dan dimajlis itu tidaklah ada seorang pun melainkan Allah mendatanginya dengan sebenarnya hingga Ia bertanya kepada seseorang dari mereka: Hai fulan bin fulan, ingatkah kau saat berkata begini dan begini? Allah mengingatkan sebagian kemaksiatan-kemaksiatannya didunia. Orang itu berkata: Wahai Rabb, apa Kau tidak mengampuniku? Allah menjawab: Ya, luasnya ampunanku sampai pada tempatmu ini. Saat mereka seperti, mega menaungi mereka di atas mereka lalu turun hujan minyak wangi yang baunya sama sekali belum pernah mereka temukan, Rabb kita Tabaaraka wa Ta'ala berfirman: Berdirilah menuju kemuliaan yang telah Aku persiapkan untuk kalian lalu ambillah yang kalian inginkan. Lalu kami mendatangi pasar yang diliputi oleh malaikat, di dalamnya ada yang belum pernah dilihat mata sepertinya, belum pernah terdengar oleh telinga dan tidak terlintas dihati, lalu apa yang kami inginkan dibawakan untuk kami, di sana tidak dijual dan tidak dibeli. Di pasar itu, para penghuni surga saling bertemu satu sama lain.\" Beliau meneruskan: \"Seseorang yang tinggal di flat (derajat tinggi) surga lantas datang lalu bertemu dengan orang yang tingkatnya berada dibawahnya beserta kerendahan yang ada padanya lalu ia kaget terhadap pakaian yang diperlihatkan padanya, akhir kata-katanya belum juga habis hingga ia menghayal yang lebih baik darinya, karenanya tidak layak bagi siapa pun untuk bersedih di surga. Setelah itu kami pulang ke rumah-rumah kami, kami disambut oleh istri-istri kami, mereka berkata: Selamat datang, kau datang dengan keindahan yang lebih baik dari saat kau tinggalkan kami. Ia berkata: Sesungguhnya kami menemani Rabb kami Al Jabbar hari ini, laik bagi kami untuk pulang seperti ini.\" Berkata Abu Isa: Hadits ini hasan gharib, kami hanya mengetahuinya dari jalur sanad ini. [Suwaid bin Amru] meriwayatkan sebagaian hadits ini dari [Al Auza'i]."
    },
    {
        "number": 2473,
        "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ وَهَنَّادٌ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَقَ عَنْ النُّعْمَانِ بْنِ سَعْدٍ عَنْ عَلِيٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ فِي الْجَنَّةِ لَسُوقًا مَا فِيهَا شِرَاءٌ وَلَا بَيْعٌ إِلَّا الصُّوَرَ مِنْ الرِّجَالِ وَالنِّسَاءِ فَإِذَا اشْتَهَى الرَّجُلُ صُورَةً دَخَلَ فِيهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] dan [Hannad] berkata: telah menceritakan kepada kami [Abu Mu'awiyah] telah menceritakan kepada kami [Abdurrahman bin Ishaq] dari [An Nu'man bin Sa'ad] dari [Ali] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya di surga ada pasar, tidak ada jual belinya kecuali foto kaum lelaki dan perempuan, bila seorang lelaki berselera terhadap foto itu, ia langsung bisa masuk ke menemuinya.\" Berkata Abu Isa: Hadits ini gharib."
    },
    {
        "number": 2474,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا وَكِيعٌ عَنْ إِسْمَعِيلَ بْنِ أَبِي خَالِدٍ عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ الْبَجَلِيِّ قَالَكُنَّا جُلُوسًا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَظَرَ إِلَى الْقَمَرِ لَيْلَةَ الْبَدْرِ فَقَالَ إِنَّكُمْ سَتُعْرَضُونَ عَلَى رَبِّكُمْ فَتَرَوْنَهُ كَمَا تَرَوْنَ هَذَا الْقَمَرَ لَا تُضَامُونَ فِي رُؤْيَتِهِ فَإِنْ اسْتَطَعْتُمْ أَنْ لَا تُغْلَبُوا عَلَى صَلَاةٍ قَبْلَ طُلُوعِ الشَّمْسِ وَصَلَاةٍ قَبْلَ غُرُوبِهَا فَافْعَلُوا ثُمَّ قَرَأَ فَ{ سَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ الْغُرُوبِ }قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Waki'] dari [Isma'il bin Abu Khalid] dari [Qais bin Abu Hazim] dari [Jarir bin Abdullah Al Bajali] berkata: Kami dudu di dekat nabi Shallallahu 'alaihi wa Salam, beliau melihat rembulan di malam purnama lalu bersabda: \"Sesungguhnya kalian akan di hadapkan kepada Rabb kalian, kalian melihatNya seperti kalian melihat rembulan ini, kalian tidak berdesakan dalam melihatNya, karena itu bila kalian mampu untuk tidak dikalahkan shalat sebelum terbitnya matahari dan shalat sebelum terbenamnya matahari, lakukanlah.\" Setelah itu beliau membaca: \"Maka mahasucikanlah Rabbmu sebelum terbitnya matahari dan sebelum tenggelamnya (matahari).\" (QS. Qaf 39), Abu Isa berkata: Hadits ini hasan shahih. "
    },
    {
        "number": 2475,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ صُهَيْبٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِهِ{ لِلَّذِينَ أَحْسَنُوا الْحُسْنَى وَزِيَادَةٌ }قَالَ إِذَا دَخَلَ أَهْلُ الْجَنَّةِ الْجَنَّةَ نَادَى مُنَادٍ إِنَّ لَكُمْ عِنْدَ اللَّهِ مَوْعِدًا قَالُوا أَلَمْ يُبَيِّضْ وُجُوهَنَا وَيُنَجِّنَا مِنْ النَّارِ وَيُدْخِلْنَا الْجَنَّةَ قَالُوا بَلَى قَالَ فَيَنْكَشِفُ الْحِجَابُ قَالَ فَوَاللَّهِ مَا أَعْطَاهُمْ شَيْئًا أَحَبَّ إِلَيْهِمْ مِنْ النَّظَرِ إِلَيْهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ إِنَّمَا أَسْنَدَهُ حَمَّادُ بْنُ سَلَمَةَ وَرَفَعَهُ وَرَوَى سُلَيْمَانُ بْنُ الْمُغِيرَةِ وَحَمَّادُ بْنُ زَيْدٍ هَذَا الْحَدِيثَ عَنْ ثَابِتٍ الْبُنَانِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى قَوْلَهُ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Hammad bin Salamah] dari [Tsabit Al Bunani] dari [Abdurrahman bin Abu Laila] dari [Shuhaib] dari nabi Shallallahu 'alaihi wa Salam tentang firmanNya: \"Bagi orang-orang yang berbuat baik, ada pahala yang terbaik (surga) dan tambahannya.\" (Yuunus: 26) beliau bersabda: \"Bila penghuni surga masuk surga, ada yang menyeru: Sesungguhnya kalian memiliki janji disisi Allah. Mereka berkata: Bukankah Ia telah memutihkan wajah-wajah kami, menyelamatkan kami dari neraka dan memasukkan kami ke surga? Mereka menjawab: Benar. Lalu hijab di buka.\" Beliau bersabda: \"Demi Allah, Ia tidak memberi sesuatu pun kepada mereka yang lebih mereka sukai daripada pemberian-Nya agar mereka bisa melihat-Nya.\" Abu Isa berkata: Hadits ini diisnadkan dan dimarfu'kan oleh Hammad bin Salamah. Sulaiman bin Al Mughirah dan Hammad bin Zaid meriwayatkan sabda Rasulullah shallallahu 'alaihi wasallam dalam hadits ini dari Tsabit Al Bannani dari Abdurrahman bin Abu Laila."
    },
    {
        "number": 2476,
        "arab": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ أَخْبَرَنِي شَبَابَةُ عَنْ إِسْرَائِيلَ عَنْ ثُوَيْرٍ قَال سَمِعْتُ ابْنَ عُمَرَ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ أَدْنَى أَهْلِ الْجَنَّةِ مَنْزِلَةً لَمَنْ يَنْظُرُ إِلَى جِنَانِهِ وَأَزْوَاجِهِ وَنَعِيمِهِ وَخَدَمِهِ وَسُرُرِهِ مَسِيرَةَ أَلْفِ سَنَةٍ وَأَكْرَمَهُمْ عَلَى اللَّهِ مَنْ يَنْظُرُ إِلَى وَجْهِهِ غَدْوَةً وَعَشِيَّةً ثُمَّ قَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ{ وُجُوهٌ يَوْمَئِذٍ نَاضِرَةٌ إِلَى رَبِّهَا نَاظِرَةٌ }قَالَ أَبُو عِيسَى وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ وَجْهٍ عَنْ إِسْرَائِيلَ عَنْ ثُوَيْرٍ عَنْ ابْنِ عُمَرَ مَرْفُوعًا وَرَوَاهُ عَبْدُ الْمَلِكِ بْنُ أَبْجَرَ عَنْ ثُوَيْرٍ عَنْ ابْنِ عُمَرَ مَوْقُوفًا وَرَوَى عُبَيْدُ اللَّهِ الْأَشْجَعِيُّ عَنْ سُفْيَانَ عَنْ ثُوَيْرٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عُمَرَ قَوْلَهُ وَلَمْ يَرْفَعْهُ حَدَّثَنَا بِذَلِكَ أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا عُبَيْدُ اللَّهِ الْأَشْجَعِيُّ عَنْ سُفْيَانَ عَنْ ثُوَيْرٍ عَنْ مُجَاهِدٍ عَنْ ابْنِ عُمَرَ نَحْوَهُ وَلَمْ يَرْفَعْهُ",
        "id": "Telah menceritakan kepada kami [Abd bin Humaid] telah mengkhabarkan kepadaku [Syababah] dari [Isra`il] dari [Tsuwair] berkata: Aku mendengar [Ibnu Umar] berkata: Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya tingkatan penghuni surga terendah adalah orang yang memandang taman, istri-istri, kenikmatan, pelayan dan tempat tidurnya sejauh perjalanan seribu tahun dan yang paling mulia dari mereka adalah yang melihat wajahnya dipagi dan sore hari.\" Selanjutnya beliau membaca: \"Wajah-wajah (orang-orang mukmin) pada hari itu berseri-seri. Kepada Tuhan-Nyalah mereka Melihat.\" (Al Qiyaamah: 22-23) Abu Isa berkata: Hadits ini diriwayatkan melalui sanad lain dari Isra`il dari Tsuwair dari Ibnu Umar secara marfu' dan diriwayatkan oleh [Abdul Malik bin Abjar] dari [Tsuwair] dari [Ibnu Umar] secara mauquf. Diriwayatkan oleh [Ubaidullah Al Asyja'i] dari [Sufyan] dari [Tsuwair] dari [Mujahid] dari [Ibnu Umar] tapi ia tidak memarfu'kannya. Telah menceritakan kepada kami seperti itu [Abu Kuraib Muhammad bin Al Ala] telah menceritakan kepada kami [Ubaidullah Al Asyja'i] dari [Sufyan] dari [Tsuwair] dari [Mujahid] dari [Ibnu Umar] sepertinya tapi ia tidak memarfu'kannya."
    },
    {
        "number": 2477,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفٍ الْكُوفِيُّ حَدَّثَنَا جَابِرُ بْنُ نُوحٍ الْحِمَّانِيُّ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَتُضَامُونَ فِي رُؤْيَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ وَتُضَامُونَ فِي رُؤْيَةِ الشَّمْسِ قَالُوا لَا قَالَ فَإِنَّكُمْ سَتَرَوْنَ رَبَّكُمْ كَمَا تَرَوْنَ الْقَمَرَ لَيْلَةَ الْبَدْرِ لَا تُضَامُونَ فِي رُؤْيَتِهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ وَهَكَذَا رَوَى يَحْيَى بْنُ عِيسَى الرَّمْلِيُّ وَغَيْرُ وَاحِدٍ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَوَى عَبْدُ اللَّهِ بْنُ إِدْرِيسَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي سَعِيدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَحَدِيثُ ابْنِ إِدْرِيسَ عَنْ الْأَعْمَشِ غَيْرُ مَحْفُوظٍ وَحَدِيثُ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَحُّ وَهَكَذَا رَوَاهُ سُهَيْلُ بْنُ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ رُوِيَ عَنْ أَبِي سَعِيدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ غَيْرِ هَذَا الْوَجْهِ مِثْلُ هَذَا الْحَدِيثِ وَهُوَ حَدِيثٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Tharif Al Kufi] telah menceritakan kepada kami [Jabir bin Nuh Al Himmanni] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] berkata: Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apakah kalian kesulitan saat melihat rembulan di malam purnama dan (apakah) kalian kesulitan melihat matahari?\" mereka menjawab: Tidak. beliau bersabda: \"Sesungguhnya kalian akan melihat Rabb kalian seperti kalian melihat rembulan di malam purnama, kalian tidak kesulitan saat melihatNya.\" Abu Isa berkata: Hadits ini hasan shahih gharib. Dan seperti ini [Yahya bin Isa Ar Ramli] dan lainnya meriwayatkan dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dari nabi Shallallahu 'alaihi wa Salam. Dan [Abdullah bin Idris] meriwayatkan dari [A'masy] dari [Abu Shalih] dari [Abu Sa'id] dari nabi Shallallahu 'alaihi wa Salam. Hadits Ibnu Idris dari A'masy tidak terjaga dan hadits Abu Shalih dari Abu Hurairah dari nabi Shallallahu 'alaihi wa Salam lebih shahih. Demikian pula yang diriwayatkan oleh [Suhail bin Abu Shalih] dari [ayahnya] dari [Abu Hurairah] dari nabi Shallallahu 'alaihi wa Salam. Abu Sa'id meriwayatkan dari nabi Shallallahu 'alaihi wa Salam melalui sanad lain seperti hadits ini dan hadits itu shahih."
    },
    {
        "number": 2478,
        "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا مَالِكُ بْنُ أَنَسٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ اللَّهَ يَقُولُ لِأَهْلِ الْجَنَّةِ يَا أَهْلَ الْجَنَّةِ فَيَقُولُونَ لَبَّيْكَ رَبَّنَا وَسَعْدَيْكَ فَيَقُولُ هَلْ رَضِيتُمْ فَيَقُولُونَ مَا لَنَا لَا نَرْضَى وَقَدْ أَعْطَيْتَنَا مَا لَمْ تُعْطِ أَحَدًا مِنْ خَلْقِكَ فَيَقُولُ أَنَا أُعْطِيكُمْ أَفْضَلَ مِنْ ذَلِكَ قَالُوا أَيُّ شَيْءٍ أَفْضَلُ مِنْ ذَلِكَ قَالَ أُحِلُّ عَلَيْكُمْ رِضْوَانِي فَلَا أَسْخَطُ عَلَيْكُمْ أَبَدًاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Abdullah bin Al Mubarak] telah mengkhabarkan kepada kami [Malik bin Anas] dari [Zaid bin Aslam] dari [Atho` bin Yasar] dari [Abu Sa'id Al Khudri] bersabda: Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnya Allah berfirman kepada penghuni surga: Wahai penghuni surga! Mereka menjawab: Baik, Rabb kami. Ia bertanya: Apa kalian ridha? Mereka menjawab: Kenapa kami tidak ridha sementara Engkau telah memberi kami sesuatu yang tidak Kau berikan kepada seorang pun dari maklukMu. Ia berfirman: Aku memberi kalian yang lebih baik darinya. Mereka bertanya: Apa yang lebih baik darinya? Ia menjawab: Aku menghalalkan keridhanKu untuk kalian, Aku tidak akan murka kepada kalian selamanya.\" Abu Isa berkata: Hadits ini hasan shahih."
    },
    {
        "number": 2479,
        "arab": "حَدَّثَنَا سُوَيْدُ بْنُ نَصْرٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا فُلَيْحُ بْنُ سُلَيْمَانَ عَنْ هِلَالِ بْنِ عَلِيٍّ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَهْلَ الْجَنَّةِ لَيَتَرَاءَوْنَ فِي الْغُرْفَةِ كَمَا تَتَرَاءَوْنَ الْكَوْكَبَ الشَّرْقِيَّ أَوْ الْكَوْكَبَ الْغَرْبِيَّ الْغَارِبَ فِي الْأُفُقِ وَالطَّالِعَ فِي تَفَاضُلِ الدَّرَجَاتِ فَقَالُوا يَا رَسُولَ اللَّهِ أُولَئِكَ النَّبِيُّونَ قَالَ بَلَى وَالَّذِي نَفْسِي بِيَدِهِ وَأَقْوَامٌ آمَنُوا بِاللَّهِ وَرَسُولِهِ وَصَدَّقُوا الْمُرْسَلِينَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Suwaid bin Nashr] telah mengkhabarkan kepada kami [Abdullah bin Al Mubarak] telah mengkhabarkan kepada kami [Fulaih bin Sulaiman] dari [Hilal bin Ali] dari [Atho` bin Yasar] dari [Abu Hurairah] dari nabi Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya penghuni surga saling melihat dalam kamar-kamar seperti mereka melihat bintang timur atau bintang barat dan bintang yang tinggi karena berbedaan derajat.\" Mereka bertanya: wahai Rasulullah, apakah mereka itu para nabi? Beliau menjawab: \"Benar, demi Dzat yang jiwaku berada ditanganNya, dan para kaum yang beriman kepada Allah dan membenarkan para rasul.\" Abu Isa berkata: Hadits ini hasan shahih."
    },
    {
        "number": 2480,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يَجْمَعُ اللَّهُ النَّاسَ يَوْمَ الْقِيَامَةِ فِي صَعِيدٍ وَاحِدٍ ثُمَّ يَطَّلِعُ عَلَيْهِمْ رَبُّ الْعَالَمِينَ فَيَقُولُ أَلَا يَتْبَعُ كُلُّ إِنْسَانٍ مَا كَانُوا يَعْبُدُونَهُ فَيُمَثَّلُ لِصَاحِبِ الصَّلِيبِ صَلِيبُهُ وَلِصَاحِبِ التَّصَاوِيرِ تَصَاوِيرُهُ وَلِصَاحِبِ النَّارِ نَارُهُ فَيَتْبَعُونَ مَا كَانُوا يَعْبُدُونَ وَيَبْقَى الْمُسْلِمُونَ فَيَطَّلِعُ عَلَيْهِمْ رَبُّ الْعَالَمِينَ فَيَقُولُ أَلَا تَتَّبِعُونَ النَّاسَ فَيَقُولُونَ نَعُوذُ بِاللَّهِ مِنْكَ نَعُوذُ بِاللَّهِ مِنْكَ اللَّهُ رَبُّنَا هَذَا مَكَانُنَا حَتَّى نَرَى رَبَّنَا وَهُوَ يَأْمُرُهُمْ وَيُثَبِّتُهُمْ ثُمَّ يَتَوَارَى ثُمَّ يَطَّلِعُ فَيَقُولُ أَلَا تَتَّبِعُونَ النَّاسَ فَيَقُولُونَ نَعُوذُ بِاللَّهِ مِنْكَ نَعُوذُ بِاللَّهِ مِنْكَ اللَّهُ رَبُّنَا وَهَذَا مَكَانُنَا حَتَّى نَرَى رَبَّنَا وَهُوَ يَأْمُرُهُمْ وَيُثَبِّتُهُمْ قَالُوا وَهَلْ نَرَاهُ يَا رَسُولَ اللَّهِ قَالَ وَهَلْ تُضَارُّونَ فِي رُؤْيَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ قَالُوا لَا يَا رَسُولَ اللَّهِ قَالَ فَإِنَّكُمْ لَا تُضَارُّونَ فِي رُؤْيَتِهِ تِلْكَ السَّاعَةَ ثُمَّ يَتَوَارَى ثُمَّ يَطَّلِعُ فَيُعَرِّفُهُمْ نَفْسَهُ ثُمَّ يَقُولُ أَنَا رَبُّكُمْ فَاتَّبِعُونِي فَيَقُومُ الْمُسْلِمُونَ وَيُوضَعُ الصِّرَاطُ فَيَمُرُّونَ عَلَيْهِ مِثْلَ جِيَادِ الْخَيْلِ وَالرِّكَابِ وَقَوْلُهُمْ عَلَيْهِ سَلِّمْ سَلِّمْ وَيَبْقَى أَهْلُ النَّارِ فَيُطْرَحُ مِنْهُمْ فِيهَا فَوْجٌ ثُمَّ يُقَالُ هَلْ امْتَلَأْتِ فَتَقُولُ هَلْ مِنْ مَزِيدٍ ثُمَّ يُطْرَحُ فِيهَا فَوْجٌ فَيُقَالُ هَلْ امْتَلَأْتِ فَتَقُولُ هَلْ مِنْ مَزِيدٍ حَتَّى إِذَا أُوعِبُوا فِيهَا وَضَعَ الرَّحْمَنُ قَدَمَهُ فِيهَا وَأَزْوَى بَعْضَهَا إِلَى بَعْضٍ ثُمَّ قَالَ قَطْ قَالَتْ قَطْ قَطْ فَإِذَا أَدْخَلَ اللَّهُ أَهْلَ الْجَنَّةِ الْجَنَّةَ وَأَهْلَ النَّارِ النَّارَ قَالَ أُتِيَ بِالْمَوْتِ مُلَبَّبًا فَيُوقَفُ عَلَى السُّورِ بَيْنَ أَهْلِ الْجَنَّةِ وَأَهْلِ النَّارِ ثُمَّ يُقَالُ يَا أَهْلَ الْجَنَّةِ فَيَطَّلِعُونَ خَائِفِينَ ثُمَّ يُقَالُ يَا أَهْلَ النَّارِ فَيَطَّلِعُونَ مُسْتَبْشِرِينَ يَرْجُونَ الشَّفَاعَةَ فَيُقَالُ لِأَهْلِ الْجَنَّةِ وَأَهْلِ النَّارِ هَلْ تَعْرِفُونَ هَذَا فَيَقُولُونَ هَؤُلَاءِ وَهَؤُلَاءِ قَدْ عَرَفْنَاهُ هُوَ الْمَوْتُ الَّذِي وُكِّلَ بِنَا فَيُضْجَعُ فَيُذْبَحُ ذَبْحًا عَلَى السُّورِ الَّذِي بَيْنَ الْجَنَّةِ وَالنَّارِ ثُمَّ يُقَالُ يَا أَهْلَ الْجَنَّةِ خُلُودٌ لَا مَوْتَ وَيَا أَهْلَ النَّارِ خُلُودٌ لَا مَوْتَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رِوَايَاتٌ كَثِيرَةٌ مِثْلُ هَذَا مَا يُذْكَرُ فِيهِ أَمْرُ الرُّؤْيَةِ أَنَّ النَّاسَ يَرَوْنَ رَبَّهُمْ وَذِكْرُ الْقَدَمِ وَمَا أَشْبَهَ هَذِهِ الْأَشْيَاءَ وَالْمَذْهَبُ فِي هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ الْأَئِمَّةِ مِثْلِ سُفْيَانَ الثَّوْرِيِّ وَمَالِكِ بْنِ أَنَسٍ وَابْنِ الْمُبَارَكِ وَابْنِ عُيَيْنَةَ وَوَكِيعٍ وَغَيْرِهِمْ أَنَّهُمْ رَوَوْا هَذِهِ الْأَشْيَاءَ ثُمَّ قَالُوا تُرْوَى هَذِهِ الْأَحَادِيثُ وَنُؤْمِنُ بِهَا وَلَا يُقَالُ كَيْفَ وَهَذَا الَّذِي اخْتَارَهُ أَهْلُ الْحَدِيثِ أَنْ تُرْوَى هَذِهِ الْأَشْيَاءُ كَمَا جَاءَتْ وَيُؤْمَنُ بِهَا وَلَا تُفَسَّرُ وَلَا تُتَوَهَّمُ وَلَا يُقَالُ كَيْفَ وَهَذَا أَمْرُ أَهْلِ الْعِلْمِ الَّذِي اخْتَارُوهُ وَذَهَبُوا إِلَيْهِ وَمَعْنَى قَوْلِهِ فِي الْحَدِيثِ فَيُعَرِّفُهُمْ نَفْسَهُ يَعْنِي يَتَجَلَّى لَهُمْ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Al Ala bin Abdurrahman] dari [ayahnya] dari [Abu Hurairah] Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah mengumpulkan manusia pada hari kiamat di satu tanah lapang kemudian Ia mendatangi mereka, ia berfirman: Ingat, setiap manusia mengikuti apa yang pernah disembahnya. Lalu penyembah salib diperlihatkan penjelmaan salibnya, penyembah patung diperlihatkan penjelmaan patungnya dan penyembah api diperlihatkan penjelmaan apinya lalu mereka mereka mengikuti yang pernah mereka sembah dan kaum muslimin tetap tinggal, setelah itu Rabb semesta alam mendatangi mereka, Ia bertanya: Apa kau tidak mengikuti mereka? Mereka berkata: Kami berlindung diri kepada Allah darimu, kami berlindung diri kepada Allah darimu, Rabb kami ini adalah tempat kami hingga kami melihat Rabb kami. Ia memerintah mereka dan meneguhkan mereka kemudian bersembunyi, setelah itu datang dan bertanya: Apa kau tidak mengikuti mereka? Mereka berkata: Kami berlindung diri pada Allah darimu, kami berlindung diri pada Allah darimu, Rabb kami ini adalah tempat kami hingga kami melihat Rabb kami. Ia memerintah mereka dan meneguhkan mereka.\" Mereka bertanya: Apakah kita melihatNya, wahai Rasulullah? beliau balik bertanya: \"Apakah kalian kesulitan saat melihat rembulan di malam purnama?\" mereka menjawab: Tidak, wahai Rasulullah. beliau bersabda: \"Sesungguhnya kalian tidaklah kesulitan melihatNya saat itu. Setelah itu Dia bersembunyi lalu muncul lalu Dia mengenalkan diriNya kepada mereka, IA berfirman: Aku Rabb kalian, ikutilah aku. Kaum muslimin berdiri, kemudian shirath di letakkan, mereka pun melintasinya seperti kuda-kuda terbaik dan pengendara, kata-kata mereka saat berada di atas shirat: Selamatkan, selamatkan. Setelah itu yang tersisa hanyalah penghuni neraka, di antara mereka ada segolongan besar dilemparkan ke neraka, setelah itu neraka di tanya: Apa kau sudah penuh? Neraka menjawab: Apa ada yang lain? Setelah itu yang tersisa penghuni neraka, di antara mereka ada segolongan besar di lemparkan ke neraka, setelah itu neraka ditanya: Apa kau sudah penuh? Neraka menjawab: Apa ada yang lain? Hingga setelah mereka semua di periksa, Allah Yang Maha Pemurah meletakkan kaki-Nya di neraka dan menghimpitkannya satu sama lain. Ia bertanya: Sudah Cukupkah? Neraka menjawab: Cukup, cukup. Setelah Allah memasukkan penghuni surga ke surga dan penghuni neraka ke neraka, kematian didatangkan dengan diseret kemudian didirikan di atas benteng antara penghuni surga dan penghuni neraka, setelah itu dikatakan kepada penghuni surga: Hai penghuni surga! Mereka melihat dalam keadaan takut. Dan dikatakan kepada penghuni neraka: Wahai penghuni neraka! Mereka melihat dalam keadaan senang, mereka berharap mendapatkan syafaat. Lalu dikatakan kepada penghuni surga dan penghuni neraka: Apa kalian mengetahui ini? mereka menjawab: Kami mengetahuinya, itu adalah kematian yang diserahi untuk (mencabut nyawa) kami. Ia dibaringkan lalu disembelih di atas benteng antara surga dan neraka, setelah itu dikatakan: Wahai penghuni surga, Sekarang tiba saatnya kekekalan, tiada lagi kematian dan wahai penghuni neraka, kalian juga kekal tiada kematian.\" Abu Isa berkata: Hadits ini hasan shahih. Dan banyak sekali riwayat serupa yang diriwayatkan dari nabi Shallallahu 'alaihi wa Salam yang tidak menyebutkan bahwa manusia melihat Rabb mereka, tidak menyebut kedatangkan Rabb dan hal-hal serupa. Madzhab yang benar tentang hal ini menurut ahlul ilmi dari kalangan para imam serperti Sufyan Ats Tsauri, Malik bin Anas, Ibnu Al Mubarak, Ibnu Uyainah, Waki' dan lainnya bahwa mereka (di akhirat) melihat hal-hal tersebut. Mereka berkata: Hadits-hadits ini diriwayatkan dan kami mengimaninya, tidak ditanyakan bagaimananya (tekhnisnya). Inilah madzhab yang dipilih oleh ahli hadits; hal-hal itu akan terlihat seperti yang disebutkan dalam hadits dan seperti yang diimani, tidak ditafsirkan, diduga dan ditanyakan bagaimananya. Inilah pandangan ahlul ilmi yang mereka pilih dan kemukakan. Makna sabda Rasulullah shallallahu 'alaihi wasallam: \"Lalu mengenalkan diriNya pada mereka\" maksudnya menampakkan diri kepada mereka."
    },
    {
        "number": 2481,
        "arab": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا أَبِي عَنْ فُضَيْلِ بْنِ مَرْزُوقٍ عَنْ عَطِيَّةَ عَنْ أَبِي سَعِيدٍيَرْفَعُهُ قَالَ إِذَا كَانَ يَوْمُ الْقِيَامَةِ أُتِيَ بِالْمَوْتِ كَالْكَبْشِ الْأَمْلَحِ فَيُوقَفُ بَيْنَ الْجَنَّةِ وَالنَّارِ فَيُذْبَحُ وَهُمْ يَنْظُرُونَ فَلَوْ أَنَّ أَحَدًا مَاتَ فَرَحًا لَمَاتَ أَهْلُ الْجَنَّةِ وَلَوْ أَنَّ أَحَدًا مَاتَ حُزْنًا لَمَاتَ أَهْلُ النَّارِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Sufyan bin Waki'] telah menceritakan kepada kami [ayahku] dari [Fudlail bin Marzuq] dari [Athiyah] dari [Abu Sa'id] ia memarfu'kannya, ia berkata: Pada hari kiamat, kematian didatangkan seperti domba kelabu lalu didirikan diantara surga dan neraka, setelah itu disembelih dan mereka melihat. Andai ada seseorang meninggal karena senang tentulah para penghuni surga meninggal dan andai ada seseorang meninggal karena sedih, tentulah para penghuni neraka mati. Abu Isa berkata: Hadits ini hasan shahih."
    },
    {
        "number": 2482,
        "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا عَمْرُو بْنُ عَاصِمٍ أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ حُمَيْدٍ وَثَابِتٍ عَنْ أَنَسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ حُفَّتْ الْجَنَّةُ بِالْمَكَارِهِ وَحُفَّتْ النَّارُ بِالشَّهَوَاتِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ مِنْ هَذَا الْوَجْهِ",
        "id": "Telah menceritakan kepada kami [Abdullah bin Abdurrahman] telah mengkhabarkan kepada kami [Amru bin Ashim] telah mengkhabarkan kepada kami [Hammad bin Salamah] dari [Humaid] dan [Tsabit] dari [Anas] Rasulullah shallallahu 'alaihi wasallam bersabda: \"Surga diliputi hal-hal yang tidak menyenangkan dan neraka diliputi syahwat.\" Abu Isa berkata: Hadits ini hasan gharib shahih melalui sanad ini."
    },
    {
        "number": 2483,
        "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو حَدَّثَنَا أَبُو سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لَمَّا خَلَقَ اللَّهُ الْجَنَّةَ وَالنَّارَ أَرْسَلَ جِبْرِيلَ إِلَى الْجَنَّةِ فَقَالَ انْظُرْ إِلَيْهَا وَإِلَى مَا أَعْدَدْتُ لِأَهْلِهَا فِيهَا قَالَ فَجَاءَهَا وَنَظَرَ إِلَيْهَا وَإِلَى مَا أَعَدَّ اللَّهُ لِأَهْلِهَا فِيهَا قَالَ فَرَجَعَ إِلَيْهِ قَالَ فَوَعِزَّتِكَ لَا يَسْمَعُ بِهَا أَحَدٌ إِلَّا دَخَلَهَا فَأَمَرَ بِهَا فَحُفَّتْ بِالْمَكَارِهِ فَقَالَ ارْجِعْ إِلَيْهَا فَانْظُرْ إِلَى مَا أَعْدَدْتُ لِأَهْلِهَا فِيهَا قَالَ فَرَجَعَ إِلَيْهَا فَإِذَا هِيَ قَدْ حُفَّتْ بِالْمَكَارِهِ فَرَجَعَ إِلَيْهِ فَقَالَ وَعِزَّتِكَ لَقَدْ خِفْتُ أَنْ لَا يَدْخُلَهَا أَحَدٌ قَالَ اذْهَبْ إِلَى النَّارِ فَانْظُرْ إِلَيْهَا وَإِلَى مَا أَعْدَدْتُ لِأَهْلِهَا فِيهَا فَإِذَا هِيَ يَرْكَبُ بَعْضُهَا بَعْضًا فَرَجَعَ إِلَيْهِ فَقَالَ وَعِزَّتِكَ لَا يَسْمَعُ بِهَا أَحَدٌ فَيَدْخُلَهَا فَأَمَرَ بِهَا فَحُفَّتْ بِالشَّهَوَاتِ فَقَالَ ارْجِعْ إِلَيْهَا فَرَجَعَ إِلَيْهَا فَقَالَ وَعِزَّتِكَ لَقَدْ خَشِيتُ أَنْ لَا يَنْجُوَ مِنْهَا أَحَدٌ إِلَّا دَخَلَهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abdah bin Sulaiman] dari [Muhammad bin Amru] telah menceritakan kepada kami [Abu Salamah] dari [Abu Hurairah] dari Rasulullah shallallahu 'alaihi wasallam bersabda: \"Saat Allah menciptakan surga dan neraka, Allah mengutus Jibril ke surga. Ia melihatnya dan yang dipersiapkan untuk penghuninya. Setelah itu Jibril mendatangi neraka dan melihatnya serta segala yang dipersiapkan untuk penghuninya. Kemudian Jibril kembali kepada-Nya, ia berkata: Demi keperkasaanMu, tidaklah seseorang mendengarnya (surga) melainkan akan memasukinya. Kemudian Jibril diperintahkan untuk kembali ke surga dan ternyata surga diliputi oleh hal-hal yang tidak menyenangkan. Ia berfirman: Kembalilah ke surga lalu lihatlah apa yang telah Aku persiapkan untuk penghuninya. Jibril kembali ke surga, ternyata surga telah diliputi oleh hal-hal yang tidak menyenangkan. Jibril kembali padaNya, ia berkata: Demi keperkasaanMu, aku khawatir tidak akan ada seorang pun yang memasukinya. Ia berfirman: Pergilah ke neraka dan lihatlah apa yang telah Aku persiapkan untuk penghuninya. Ternyata neraka menumpuk satu sama lain lalu Jibril kembali dan berkata: Demi keperkasaanMu, tidak ada seseorang mendengarnya lalu (kepingin) memasukinya. Lalu Jibril diperintahkan untuk kembali menegok neraka, ternyata neraka diliputi oleh syahwat. Ia berfirman: Kembalilah ke neraka. Jibril kembali ke neraka lalu ia berkata: Demi keperkasaanM, aku khawatir tidak akan ada seorang pun yang selamat darinya melainkan akan memasukinya.\" Abu Isa berkata: Hadits ini hasan shahih."
    },
    {
        "number": 2484,
        "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ احْتَجَّتْ الْجَنَّةُ وَالنَّارُ فَقَالَتْ الْجَنَّةُ يَدْخُلُنِي الضُّعَفَاءُ وَالْمَسَاكِينُ وَقَالَتْ النَّارُ يَدْخُلُنِي الْجَبَّارُونَ وَالْمُتَكَبِّرُونَ فَقَالَ لِلنَّارِ أَنْتِ عَذَابِي أَنْتَقِمُ بِكِ مِمَّنْ شِئْتُ وَقَالَ لِلْجَنَّةِ أَنْتِ رَحْمَتِي أَرْحَمُ بِكِ مَنْ شِئْتُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Abdah bin Sulaiman] dari [Muhammad bin Amru] dari [Abu Salamah] dari [Abu Hurairah] berkata: Rasulullah shallallahu 'alaihi wasallam bersabda: \"Surga dan neraka berbantah-bantahan, surga berkata: Orang-orang lemah dan orang-orang miskin memasukiku. Neraka berkata: Orang-orang congkak dan sombng memasukiku. Lalu Allah berfirman kepada neraka: Kau adalah siksaKu, denganmu Aku menyiksa siapa pun yang Aku kehendaki. Allah berfirman kepada surga: Kau adalah rahmatKu, denganmu Aku merahmati siapa saja yang Aku kehendaki.\" Abu Isa berkata: Hadits ini hasan shahih."
    },
    {
        "number": 2485,
        "arab": "حَدَّثَنَا سُوَيْدٌ أَخْبَرَنَا عَبْدُ اللَّهِ أَخْبَرَنَا رِشْدِينُ بْنُ سَعْدٍ حَدَّثَنِي عَمْرُو بْنُ الْحَارِثِ عَنْ دَرَّاجٍ عَنْ أَبِي الْهَيْثَمِ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَدْنَى أَهْلِ الْجَنَّةِ الَّذِي لَهُ ثَمَانُونَ أَلْفَ خَادِمٍ وَاثْنَتَانِ وَسَبْعُونَ زَوْجَةً وَتُنْصَبُ لَهُ قُبَّةٌ مِنْ لُؤْلُؤٍ وَزَبَرْجَدٍ وَيَاقُوتٍ كَمَا بَيْنَ الْجَابِيَةِ إِلَى صَنْعَاءَ",
        "id": "Telah menceritakan kepada kami [Suwaid] telah mengkhabarkan kepada kami [Abdullah] telah mengkhabarkan kepada kami [Risydin bin Sa'ad] telah menceritakan kepadaku [Amru bin Al Harits] dari [Darraj] dari [Abu Al Haitsam] dari [Abu Sa'id Al Khudri] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Penghuni surga terendah memiliki delapanpuluh ribu pelayan, tujuhpuluh dua istri, untuknya didirikan kubah mutiara, permata dan yaqut yang besarnya seperti (jarak) antara Jabiyah ke Shan'a.\""
    },
    {
        "number": 2486,
        "arab": "وَبِهَذَا الْإِسْنَادِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ مَاتَ مِنْ أَهْلِ الْجَنَّةِ مِنْ صَغِيرٍ أَوْ كَبِيرٍ يُرَدُّونَ أَبْنَاءَ ثَلَاثِينَ فِي الْجَنَّةِ لَا يَزِيدُونَ عَلَيْهَا أَبَدًا وَكَذَلِكَ أَهْلُ النَّارِ وَبِهَذَا الْإِسْنَادِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ عَلَيْهِمْ التِّيجَانَ إِنَّ أَدْنَى لُؤْلُؤَةٍ مِنْهَا لَتُضِيءُ مَا بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ رِشْدِينَ",
        "id": "Dan dengan sanad ini (Yaitu; Telah menceritakan kepada kami [Suwaid] telah mengkhabarkan kepada kami [Abdullah] telah mengkhabarkan kepada kami [Risydin bin Sa'ad] telah menceritakan kepadaku [Amru bin Al Harits] dari [Darraj] dari [Abu Al Haitsam] dari [Abu Sa'id Al Khudri]) dari nabi Shallallahu 'alaihi wa Salam, beliau bersabda: \"Barangsiapa diantara calon penghuni surga yang meninggal dunia, baik yang masih kecil atau sudah besar akan dikembalikan dalam usia tigapuluh tahun di surga, mereka tidak melebihinya selamanya. Demikian juga penghuni neraka.\" Dan dengan sanad ini dari nabi Shallallahu 'alaihi wa Salam, beliau bersabda: \"Sesungguhnya mereka mengenakan mutiara, sesungguhnya mutiara terendahnya menerangi antara timur dan barat.\" Abu Isa berkata: Hadits ini gharib, kami hanya mengetahuinya dari hadits Risydin."
    },
    {
        "number": 2487,
        "arab": "حَدَّثَنَا بُنْدَارٌ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنَا أَبِي عَنْ عَامِرٍ الْأَحْوَلِ عَنْ أَبِي الصِّدِّيقِ النَّاجِيِّ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُؤْمِنُ إِذَا اشْتَهَى الْوَلَدَ فِي الْجَنَّةِ كَانَ حَمْلُهُ وَوَضْعُهُ وَسِنُّهُ فِي سَاعَةٍ كَمَا يَشْتَهِيقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَقَدْ اخْتَلَفَ أَهْلُ الْعِلْمِ فِي هَذَا فَقَالَ بَعْضُهُمْ فِي الْجَنَّةِ جِمَاعٌ وَلَا يَكُونُ وَلَدٌ هَكَذَا رُوِيَ عَنْ طَاوُسٍ وَمُجَاهِدٍ وَإِبْرَاهِيمَ النَّخَعِيِّ و قَالَ مُحَمَّدٌ قَالَ إِسْحَقُ بْنُ إِبْرَاهِيمَ فِي حَدِيثِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اشْتَهَى الْمُؤْمِنُ الْوَلَدَ فِي الْجَنَّةِ كَانَ فِي سَاعَةٍ وَاحِدَةٍ كَمَا يَشْتَهِي وَلَكِنْ لَا يَشْتَهِي قَالَ مُحَمَّدٌ وَقَدْ رُوِيَ عَنْ أَبِي رَزِينٍ الْعُقَيْلِيِّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ أَهْلَ الْجَنَّةِ لَا يَكُونُ لَهُمْ فِيهَا وَلَدٌ وَأَبُو الصِّدِّيقِ النَّاجِيِّ اسْمُهُ بَكْرُ بْنُ عَمْرٍو وَيُقَالُ بَكْرُ بْنُ قَيْسٍ أَيْضًا",
        "id": "Telah menceritakan kepada kami [Bundar] telah bercerita kepada kami [Mu'adz bin Hisyam] telah bercerita kepada kami [bapakku] dari [Amir Al Ahwal] dari [Abu Ash Shiddiq An Naji] dari [Abu Sa'id Al Khudri] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Apabila seorang mukmin menginginkan anak di surga, maka kehamilannya, kelahirannya dan umur bayinya (terjadi) sesuai yang dia inginkan\". Abu Isa berkata: Hadits ini hasan gharib, para ahli ilmu berbeda pendapat dalam masalah ini, sebagian mereka mengatakan bahwa kelak di surga ada jima' (bersetubuh) namun tidak melahirkan anak. Demikianlah yang diriwayatkan dari Thawus, Mujahid dan Ibrahim An Nakha'I. Muhammad berkata: Ishaq bin Ibrahim berkata dalam hadits Nabi Shallallahu 'alaihi wa Salam: \"Apabila seorang mukmin menginginkan anak di syurga, maka akan dapat dalam sesaat sebagaimana yang dia inginkan, akan tetapi dia tidak menghendakinya.\" Muhammad berkata: Telah diriwayatkan dari Abu Razin Al Uqaili dari Nabi Shallallahu 'alaihi wa Salam, bersabda: \"Sesungguhnya penghuni surga tidak mempunyai anak di dalam surga.\" Abu Ash Shiddiq An Naji namanya adalah Bakar bin Amru, yang lain menyebut Bakar bin Qais."
    },
    {
        "number": 2488,
        "arab": "حَدَّثَنَا هَنَّادٌ وَأَحْمَدُ بْنُ مَنِيعٍ قَالَا حَدَّثَنَا أَبُو مُعَاوِيَةَ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِسْحَقَ عَنْ النُّعْمَانِ بْنِ سَعْدٍ عَنْ عَلِيٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِنَّ فِي الْجَنَّةِ لَمُجْتَمَعًا لِلْحُورِ الْعِينِ يُرَفِّعْنَ بِأَصْوَاتٍ لَمْ يَسْمَعْ الْخَلَائِقُ مِثْلَهَا قَالَ يَقُلْنَ نَحْنُ الْخَالِدَاتُ فَلَا نَبِيدُ وَنَحْنُ النَّاعِمَاتُ فَلَا نَبْؤُسُ وَنَحْنُ الرَّاضِيَاتُ فَلَا نَسْخَطُ طُوبَى لِمَنْ كَانَ لَنَا وَكُنَّا لَهُوَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ وَأَبِي سَعِيدٍ وَأَنَسٍ قَالَ أَبُو عِيسَى حَدِيثِ عَلِيٍّ حَدِيثٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami [Hannad] dan [Ahmad bin Mani'] keduanya berkata: telah menceritakan kepada kami [Abu Muawiyah] berkata: telah menceritakan kepada kami [Abdurrahman bin Ishaq] dari [An Nu'man bin Sa'id] dari [Ali] berkata: Rasulullah shallallahu 'alaihi wasallam bersabda: \"Sesungguhnnya di surga ada perkumpulan para bidadari, mereka memanggil-manggil dengan suara keras, para makhluk belum pernah mendengar sepertinya. Mereka berkata: Kami wanita-wanita kekal, kami tidak lenyap, kami adalah wanita-wanita menyenangkan, kami tidak cemberut, kami wanita-wanita ridha, kami tidak marah. Beruntunglah siapa yang menjadi milik kami dan kami menjadi miliknya.\" Dalam hal ini ada hadits serupa dari Abu Hurairah, Abu Sa'id dan Anas. Abu Isa berkata: Hadits Ali gharib."
    },
    {
        "number": 2489,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ عَنْ الْأَوْزَاعِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍفِي قَوْلِهِ عَزَّ وَجَلَّ{ فَهُمْ فِي رَوْضَةٍ يُحْبَرُونَ }قَالَ السَّمَّاعُوَمَعْنَى السَّمَّاعِ مِثْلَ مَا وَرَدَ فِي الْحَدِيثِ أَنَّ الْحُورَ الْعِينَ يُرَفِّعْنَ بِأَصْوَاتِهِنَّ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Rauh bin Ubadah] dari [Al Auza'] dari [Yahya bin Abu Katsir] tentang firman Allah 'azza wajalla: \"Mereka di dalam taman (surga) bergembira.\" (Ar Ruum: 15) beliau bersabda: \"Samma'\" makna samma' seperti yang disebutkan dalam hadits; para bidadari mengeraskan suara-suara mereka."
    },
    {
        "number": 2490,
        "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ أَبِي الْيَقْظَانِ عَنْ زَاذَانَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَلَاثَةٌ عَلَى كُثْبَانِ الْمِسْكِ أُرَهُ قَالَ يَوْمَ الْقِيَامَةِ يَغْبِطُهُمْ الْأَوَّلُونَ وَالْآخِرُونَ رَجُلٌ يُنَادِي بِالصَّلَوَاتِ الْخَمْسِ فِي كُلِّ يَوْمٍ وَلَيْلَةٍ وَرَجُلٌ يَؤُمُّ قَوْمًا وَهُمْ بِهِ رَاضُونَ وَعَبْدٌ أَدَّى حَقَّ اللَّهِ وَحَقَّ مَوَالِيهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ سُفْيَانَ الثَّوْرِيِّ وَأَبُو الْيَقْظَانِ اسْمُهُ عُثْمَانُ بْنُ عُمَيْرٍ وَيُقَالُ ابْنُ قَيْسٍ",
        "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Abu Al Yaqadlan] dari [Zadzan] dari [Abdullah bin Umar] berkata: Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tiga orang berada di bukit pasir minyak kesturi -aku (Abdullah bin Umar) melihat beliau bersabda- pada hari kiamat, orang-orang pertama dan terakhir iri kepada mereka; orang yang menyeru shalat lima waktu setiap hari dan malam, orang memimpin suatu kaum dan mereka ridha kepadanya, dan hamba yang menunaikan hak Allah dan hak para majikannya.\" Abu Isa berkata: Hadits ini hasan gharib, kami hanya mengetahuinya dari hadits Sufyan Ats Tsauri. Abu Yaqadlan namanya Utsman bin Umair, ada yang menyebut Ibnu Qais."
    },
    {
        "number": 2491,
        "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا يَحْيَى بْنُ آدَمَ عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ عَنْ الْأَعْمَشِ عَنْ مَنْصُورٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍيَرْفَعُهُ قَالَ ثَلَاثَةٌ يُحِبُّهُمْ اللَّهُ رَجُلٌ قَامَ مِنْ اللَّيْلِ يَتْلُو كِتَابَ اللَّهِ وَرَجُلٌ تَصَدَّقَ صَدَقَةً بِيَمِينِهِ يُخْفِيهَا أُرَهُ قَالَ مِنْ شِمَالِهِ وَرَجُلٌ كَانَ فِي سَرِيَّةٍ فَانْهَزَمَ أَصْحَابُهُ فَاسْتَقْبَلَ الْعَدُوَّقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَهُوَ غَيْرُ مَحْفُوظٍ وَالصَّحِيحُ مَا رَوَى شُعْبَةُ وَغَيْرُهُ عَنْ مَنْصُورٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ زَيْدِ بْنِ ظَبْيَانَ عَنْ أَبِي ذَرٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرِ بْنُ عَيَّاشٍ كَثِيرُ الْغَلَطِ",
        "id": "Telah menceritakan kepada kami [Abu Kuraib] telah bercerita kepada kami [Yahya bin Adam] dari [Abu Bakar bin Ayyasy] dari [Al A'masy] dari [Manshur] dari [Rib'I bin Hirasy] dari [Abdullah bin Mas'ud] ia memarfu'kannya, ia berkata: Tiga orang dicintai Allah; seseorang bangun di waktu malam kemudian membaca kitabullah, seseorang berinfak dengan tangan kanannya kemudian ia rahasiakan, (perawi) berkata: Aku mengira beliau mengatakan: Merahasiakan dari tangan kirinya, dan seseorang berada dalam pasukan perang kemudian sahabat sahabatnya terbunuh namun dia maju menyongsong musuh.\" Abu Isa berkata: Hadits ini gharib dari jalur sanad ini dan dia tidak mahfudz (terjaga), adapun yang shahih adalah yang diriwayatkan oleh [Syu'bah] dan yang lainnya dari [Manshur] dari [Rib'i bin Hirasy] dari [Zaid bin Dlabyan] dari [Abu Dzar] dari Nabi Shallallahu 'alaihi wa Salam. Abu Bakar bin Ayyasy banyak salahnya."
    },
    {
        "number": 2492,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ مَنْصُورِ بْنِ الْمُعْتَمِرِ قَال سَمِعْتُ رِبْعِيَّ بْنَ حِرَاشٍ يُحَدِّثُ عَنْ زَيْدِ بْنِ ظَبْيَانَ يَرْفَعُهُ إِلَى أَبِي ذَرٍّعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ثَلَاثَةٌ يُحِبُّهُمْ اللَّهُ وَثَلَاثَةٌ يُبْغِضُهُمْ اللَّهُ فَأَمَّا الَّذِينَ يُحِبُّهُمْ اللَّهُ فَرَجُلٌ أَتَى قَوْمًا فَسَأَلَهُمْ بِاللَّهِ وَلَمْ يَسْأَلْهُمْ بِقَرَابَةٍ بَيْنَهُ وَبَيْنَهُمْ فَمَنَعُوهُ فَتَخَلَّفَ رَجُلٌ بِأَعْقَابِهِمْ فَأَعْطَاهُ سِرًّا لَا يَعْلَمُ بِعَطِيَّتِهِ إِلَّا اللَّهُ وَالَّذِي أَعْطَاهُ وَقَوْمٌ سَارُوا لَيْلَتَهُمْ حَتَّى إِذَا كَانَ النَّوْمُ أَحَبَّ إِلَيْهِمْ مِمَّا يُعْدَلُ بِهِ نَزَلُوا فَوَضَعُوا رُءُوسَهُمْ فَقَامَ أَحَدُهُمْ يَتَمَلَّقُنِي وَيَتْلُو آيَاتِي وَرَجُلٌ كَانَ فِي سَرِيَّةٍ فَلَقِيَ الْعَدُوَّ فَهُزِمُوا وَأَقْبَلَ بِصَدْرِهِ حَتَّى يُقْتَلَ أَوْ يُفْتَحَ لَهُ وَالثَّلَاثَةُ الَّذِينَ يُبْغِضُهُمْ اللَّهُ الشَّيْخُ الزَّانِي وَالْفَقِيرُ الْمُخْتَالُ وَالْغَنِيُّ الظَّلُومُحَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ عَنْ شُعْبَةَ نَحْوَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ وَهَكَذَا رَوَى شَيْبَانُ عَنْ مَنْصُورٍ نَحْوَ هَذَا وَهَذَا أَصَحُّ مِنْ حَدِيثِ أَبِي بَكْرِ بْنِ عَيَّاشٍ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] dan [Muhammad bin Al Mutsanna] keduanya berkata: telah menceritakan kepada kami [Muhammad bin Ja'far] telah bercerita kepada kami [Syu'bah] dari [Manshur bin Al Mu'tamir] berkata: aku telah mendengar [Rib'I bin Hirasy] dari [Zaid bin Dlabyan] ia memarfu'kannya melalui [Abu Dzar] dari Nabi Shallallahu 'alaihi wa Salam, beliau bersabda: \"Ada tiga orang yang dicintai oleh Allah dan tiga orang yang dibenci oleh Allah, adapun yang dicintai oleh Allah adalah; seseorang yang datang kepada suatu kaum lalu meminta kepada mereka dengan nama Allah, ia tidak meminta karena ada hubungan kekerabatan antaranya dengan mereka namun mereka menolaknya, lalu ada seseorang dari kaum itu pergi secara sembunyi-sembunyi dan memberikan sesuatu kepada lelaki yang meminta tadi dengan sembunyi sembunyi, tidak ada yang mengetahui pemberiannya kecuali hanya Allah dan orang yang diberi, suatu kaum yang berjalan di malam hari keinginan untuk tidur lebih mereka sukai dari yang lain, mereka pun singgah lalu meletakkan kepala mereka (tertidur), namun ada seorang lelaki yang bangun bermunajat kepadaNya dan membaca ayat ayatNya, dan seseorang berada dalam barisan pasukan lalu berhadapan dengan musuh, dan ketika pasukannya hancur, justeru dia maju dengan menghadapkan dadanya sampai dia terbunuh atau mendapat kemenangan. Sedangkan tiga orang yang dibenci oleh Allah adalah; orang tua yang berzina, orang fakir yang sombong dan orang kaya yang dzalim.\" Telah menceritakan kepada kami [Mahmud bin Ghailan] telah bercerita kepada kami [An Nadlar bin Syumail] dari [Syu'bah] dengan hadits yang semakna. Abu Isa berkata: Hadits ini shahih, seperti itu juga [Syaiban] meriwayatkan dari [Manshur] dan ini lebih shahih dari hadits Abu Bakar bin Ayyasy."
    },
    {
        "number": 2493,
        "arab": "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ جَدِّهِ حَفْصِ بْنِ عَاصِمٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُوشِكُ الْفُرَاتُ يَحْسِرُ عَنْ كَنْزٍ مِنْ ذَهَبٍ فَمَنْ حَضَرَهُ فَلَا يَأْخُذْ مِنْهُ شَيْئًاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ حَدَّثَنَا عُبَيْدُ اللَّهِ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ إِلَّا أَنَّهُ قَالَ يَحْسِرُ عَنْ جَبَلٍ مِنْ ذَهَبٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Abu Sa'id Al Asyuj] telah menceritakan kepada kami [Uqbah bin Khalid] telah menceritakan kepada kami [Ubaidullah bin Umar] dari [Khubaib bin Abdurrahman] dari [kakeknya, Hafsh bin Ashim] dari [Abu Hurairah] berkata: Rasulullah shallallahu 'alaihi wasallam bersabda: \"Hampir saja sungai Eufrat mengumpulkan harta simpanan dari emas, siapa pun mendatanginya jangan mengambil apa pun.\" Abu Isa berkata: Hadits ini hasan shahih. Telah menceritakan kepada kami [Abu Sa'id Al Asyuj] telah menceritakan kepada kami [Uqbah bin Khalid] telah menceritakan kepada kami [Ubaidullah] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] dari nabi Shallallahu 'alaihi wa Salam sepertinya, hanya saja ia berkata dalam riwayatnya: Mengumpulkan gunung emas. Abu Isa berkata: Hadits ini hasan shahih."
    },
    {
        "number": 2494,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَخْبَرَنَا الْجُرَيْرِيُّ عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي الْجَنَّةِ بَحْرَ الْمَاءِ وَبَحْرَ الْعَسَلِ وَبَحْرَ اللَّبَنِ وَبَحْرَ الْخَمْرِ ثُمَّ تُشَقَّقُ الْأَنْهَارُ بَعْدُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَحَكِيمُ بْنُ مُعَاوِيَةَ هُوَ وَالِدُ بَهْزِ بْنِ حَكِيمٍ وَالْجُرَيْرِيُّ يُكْنَى أَبَا مَسْعُودٍ وَاسْمُهُ سَعِيدُ بْنُ إِيَاسٍ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basyar] telah menceritakan kepada kami [Yazid bin Harun] telah mengkhabarkan kepada kami [Al Jurairi] dari [Hakim bin Mu'awiyah] dari [ayahnya] dari nabi Shallallahu 'alaihi wa Salam bersabda: \"Sesungguhnya di surga ada samudera air, samudera madu, samudera susu dan samudera khamar, selanjutnya sungai-sungai menyabang kemana-mana.\" Abu Isa berkata: Hadits ini hasan shahih. Hakim bin Muawiyah adala ayah Bahz bin Hakim dan Al Jurairi kuniahnya Abu Mas'ud, namanya Sa'id bin Iyas."
    },
    {
        "number": 2495,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَبِي إِسْحَقَ عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ سَأَلَ اللَّهَ الْجَنَّةَ ثَلَاثَ مَرَّاتٍ قَالَتْ الْجَنَّةُ اللَّهُمَّ أَدْخِلْهُ الْجَنَّةَ وَمَنْ اسْتَجَارَ مِنْ النَّارِ ثَلَاثَ مَرَّاتٍ قَالَتْ النَّارُ اللَّهُمَّ أَجِرْهُ مِنْ النَّارِقَالَ هَكَذَا رَوَى يُونُسُ بْنُ أَبِي إِسْحَقَ عَنْ أَبِي إِسْحَقَ هَذَا الْحَدِيثَ عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ وَقَدْ رُوِيَ عَنْ أَبِي إِسْحَقَ عَنْ بُرَيْدِ بْنِ أَبِي مَرْيَمَ عَنْ أَنَسِ بْنِ مَالِكٍ مَوْقُوفًا أَيْضًا",
        "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Abu Al Ahwash] dar [Abu Ishaq] dari [Buraid bin Abu Maryam] dari [Anas bin Malik] berkata: Rasulullah Shallallahu 'alaihi wa Salam bersabda: \"Barangsiapa meminta surga kepada Allah sebanyak tiga kali, surga berkata: Ya Allah, masukkan ia ke surga. Dan barangsiapa meminta perlindungan dari neraka sebanyak tiga kali, neraka berkata: Ya Allah, lindungilah ia dari neraka.\" Abu Isa berkata: Demikian [Yunus bin Abu Ishaq] meriwayatkan hadits ini dari [Abu Ishaq] dari [Buraid bin Maryam] dari [Anas] dari nabi Shallallahu 'alaihi wa Salam sepertinya. Dan diriwayatkan dari Abu Ishaq dari Buraid bin Abu Maryam dari Anas bin Malik secara mauquf juga."
    }
  ]
}