{
    "kategori": "Kitab Jum'at",
  "hadits": [
    {
        "number": 450,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ عَنْ أَبِي الزِّنَادِ عَنْ الْأَعْرَجِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ خَيْرُ يَوْمٍ طَلَعَتْ فِيهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُدْخِلَ الْجَنَّةَ وَفِيهِ أُخْرِجَ مِنْهَا وَلَا تَقُومُ السَّاعَةُ إِلَّا فِي يَوْمِ الْجُمُعَةِقَالَ وَفِي الْبَاب عَنْ أَبِي لُبَابَةَ وَسَلْمَانَ وَأَبِي ذَرٍّ وَسَعْدِ بْنِ عُبَادَةَ وَأَوْسِ بْنِ أَوْسٍ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah mengabarkan kepada kami [Qutaibah] Telah mengabarkan kepada kami [Al Mughirah bin Abdurrahman] dari [Abu Az Zinad] dari [Al A'raj] dari [Abu Hurairah] bahwasannya Nabi Shallahu 'alaihi wa sallam bersabda: \"Sebaik-baik hari pada saat matahari terbit adalah hari Jum'at, pada hari itulah Adam diciptakan, pada hari itu dia dimasukkan ke dalam surga dan pada hari itu juga dia dikeluarkan dari surga, dan tidak akan terjadi Kiamat kecuali pada hari Jum'at. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Abu Lubabah, Salman, Abu Dzar, Sa'ad bin 'Ubadah dan 'Aus bin 'Aus. Abu Isa berkata, hadits Abu Hurairah adalah hadits hasan shahih."
    },
    {
        "number": 451,
        "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ الْهَاشِمِيُّ الْبَصْرِيُّ الْعَطَّارُ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ الْحَنَفِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي حُمَيْدٍ حَدَّثَنَا مُوسَى بْنُ وَرْدَانَ عَنْ أَنَسِ بْنِ مَالِكٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ الْتَمِسُوا السَّاعَةَ الَّتِي تُرْجَى فِي يَوْمِ الْجُمُعَةِ بَعْدَ الْعَصْرِ إِلَى غَيْبُوبَةِ الشَّمْسِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ غَيْرِ هَذَا الْوَجْهِ وَمُحَمَّدُ بْنُ أَبِي حُمَيْدٍ يُضَعَّفُ ضَعَّفَهُ بَعْضُ أَهْلِ الْعِلْمِ مِنْ قِبَلِ حِفْظِهِ وَيُقَالُ لَهُ حَمَّادُ بْنُ أَبِي حُمَيْدٍ وَيُقَالُ هُوَ أَبُو إِبْرَاهِيمَ الْأَنْصَارِيُّ وَهُوَ مُنْكَرُ الْحَدِيثِ وَرَأَى بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ أَنَّ السَّاعَةَ الَّتِي تُرْجَى فِيهَا بَعْدَ الْعَصْرِ إِلَى أَنْ تَغْرُبَ الشَّمْسُ وَبِهِ يَقُولُ أَحْمَدُ وَإِسْحَقُ و قَالَ أَحْمَدُ أَكْثَرُ الْأَحَادِيثِ فِي السَّاعَةِ الَّتِي تُرْجَى فِيهَا إِجَابَةُ الدَّعْوَةِ أَنَّهَا بَعْدَ صَلَاةِ الْعَصْرِ وَتُرْجَى بَعْدَ زَوَالِ الشَّمْسِ",
        "id": "Telah mengabarkan kepada kami [Abdullah bin Ash Shabah Al hasyimi Al Bashri Al 'Atthar] Telah mengabarkan kepada kami ['Ubaidullah bin 'Abdul Majid Al Hanafi] telah menceritakan kepada kami [Muhammad bin Abu Humaid] telah menceritakan kepada kami [Musa bin Wardan] dari [Anas bin Malik] dari Nabi Shallahu 'alaihi wa sallam bahwa beliau bersabda: \"Carilah oleh kalian waktu-waktu yang mustajab pada hari Jum'at setelah 'Ashar sampai tenggelamnya matahari.\" Abu Isa berkata, dari jalur ini hadits ini gharib, hadits ini juga telah diriwayatkan dari Anas dari Nabi Shallahu 'alaihi wa sallam bukan dari jalur ini, adapun Muhammad bin Abu Rafi' telah dilemahkan, sebagian ahli ilmu telah melemahkannya dari sisi hafalannya, dia dinamakan juga Hammad bin Abu Humaid dan dinamakan juga Abu Ibrahim Al Anshari yang haditsnya mungkar, sebagian ahli ilmu dari kalangan sahabat Nabi Shallahu 'alaihi wa sallam dan yang lainnya berpendapat bahwa waktu yang mustajab pada hari Jum'at adalah setelah 'Ashar sampai matahari terbit, ini adalah pendapat Ahmad dan Ishaq, Ahmad berkata, kebanyakan hadits-hadits tentang waktu yang diharapkan do'a terkabul pada hari Jum'at adalah setelah shalat 'Ashar, dan setelah matahari tergelincir."
    },
    {
        "number": 452,
        "arab": "حَدَّثَنَا زِيَادُ بْنُ أَيُّوبَ الْبَغْدَادِيُّ حَدَّثَنَا أَبُو عَامِرٍ الْعَقَدِيُّ حَدَّثَنَا كَثِيرُ بْنُ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ عَوْفٍ الْمُزَنِيُّ عَنْ أَبِيهِ عَنْ جَدِّهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِنَّ فِي الْجُمُعَةِ سَاعَةً لَا يَسْأَلُ اللَّهَ الْعَبْدُ فِيهَا شَيْئًا إِلَّا آتَاهُ اللَّهُ إِيَّاهُ قَالُوا يَا رَسُولَ اللَّهِ أَيَّةُ سَاعَةٍ هِيَ قَالَ حِينَ تُقَامُ الصَّلَاةُ إِلَى الِانْصِرَافِ مِنْهَاقَالَ وَفِي الْبَاب عَنْ أَبِي مُوسَى وَأَبِي ذَرٍّ وَسَلْمَانَ وَعَبْدِ اللَّهِ بْنِ سَلَامٍ وَأَبِي لُبَابَةَ وَسَعْدِ بْنِ عُبَادَةَ وَأَبِي أُمَامَةَ قَالَ أَبُو عِيسَى حَدِيثُ عَمْرِو بْنِ عَوْفٍ حَدِيثٌ حَسَنٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami [Ziyad bin Ayyub Al Baghdadi] telah menceritakan kepada kami [Abu 'Amir Al Aqadi] telah menceritakan kepada kami [Katsir bin Abdullah bin Amr bin 'Auf Al Muzani] dari [ayahnya] dari [kakeknya] dari Nabi Shallahu 'alaihi wa sallam beliau bersabda: \"Sesungguhnya pada hari Jum'at ada waktu yang tidaklah seorang hamba memohon sesuatu kepada Allah pada hari itu kecuali Allah pasti akan mengabulkannya.\" Para sahabat bertanya, wahai Rasulullah jam berapakah itu? Beliau menjawab: \"Sejak ditegakkannya shalat Jum'at sampai selesai.\" (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Abu Musa, Abu Dzar, Salman, Abdullah bin Salam, Abu Lubabah, Sa'ad bin 'Ubadah dan Abu Umamah. Abu Isa berkata, hadits Amru bin 'Auf adalah hadits hasan gharib."
    },
    {
        "number": 453,
        "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مُوسَى الْأَنْصَارِيُّ حَدَّثَنَا مَعْنٌ حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الْهَادِ عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَيْرُ يَوْمٍ طَلَعَتْ فِيهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ فِيهِ خُلِقَ آدَمُ وَفِيهِ أُدْخِلَ الْجَنَّةَ وَفِيهِ أُهْبِطَ مِنْهَا وَفِيهِ سَاعَةٌ لَا يُوَافِقُهَا عَبْدٌ مُسْلِمٌ يُصَلِّي فَيَسْأَلُ اللَّهَ فِيهَا شَيْئًا إِلَّا أَعْطَاهُ إِيَّاهُ قَالَ أَبُو هُرَيْرَةَ فَلَقِيتُ عَبْدَ اللَّهِ بْنَ سَلَامٍ فَذَكَرْتُ لَهُ هَذَا الْحَدِيثَ فَقَالَ أَنَا أَعْلَمُ بِتِلْكَ السَّاعَةِ فَقُلْتُ أَخْبِرْنِي بِهَا وَلَا تَضْنَنْ بِهَا عَلَيَّ قَالَ هِيَ بَعْدَ الْعَصْرِ إِلَى أَنْ تَغْرُبَ الشَّمْسُ فَقُلْتُ كَيْفَ تَكُونُ بَعْدَ الْعَصْرِ وَقَدْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُوَافِقُهَا عَبْدٌ مُسْلِمٌ وَهُوَ يُصَلِّي وَتِلْكَ السَّاعَةُ لَا يُصَلَّى فِيهَا فَقَالَ عَبْدُ اللَّهِ بْنُ سَلَامٍ أَلَيْسَ قَدْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ جَلَسَ مَجْلِسًا يَنْتَظِرُ الصَّلَاةَ فَهُوَ فِي صَلَاةٍ قُلْتُ بَلَى قَالَ فَهُوَ ذَاكَقَالَ أَبُو عِيسَى وَفِي الْحَدِيثِ قِصَّةٌ طَوِيلَةٌ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ قَالَ وَمَعْنَى قَوْلِهِ أَخْبِرْنِي بِهَا وَلَا تَضْنَنْ بِهَا عَلَيَّ لَا تَبْخَلْ بِهَا عَلَيَّ وَالضَّنُّ الْبُخْلُ وَالظَّنِينُ الْمُتَّهَمُ",
        "id": "Telah menceritakan kepada kami [Ishaq bin Musa Al Anshari] telah menceritakan kepada kami [Ma'an] telah menceritakan kepada kami [Malik bin Anas] dari [Yazid bin Abdullah bin Hadi] dari [Muhammad bin Ibrahim] dari [Abu Salamah] dari [Abu Hurairan] dia berkata, Rasulullah Shallahu 'alaihi wa sallam bersabda: \"Sebaik-baik hari setelah terbitnya matahari adalah hari Jum'at, pada hari itu Adam diciptakan, pada hari itu dia dimasukkan kedalam Surga, pada hari itu juga dia dikeluarkan dari surga, dan tidaklah seorang muslim yang shalat dan memohon sesuatu kepada Allah bertepatan pada waktu itu, melainkan Allah akan mengijabahinya.\" Abu Hurairah berkata, kemudian saya menemui [Abdullah bin Salam] seraya menyebutkan hadits ini kepadanya, maka dia (Abdullah bin Salam radliallahu 'anhu) berkata, saya tahu waktu itu, lalu saya berkata kepadanya, kabarilah kepadaku waktu tersebut dan janganlah"
    },
    {
        "number": 454,
        "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِأَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ مَنْ أَتَى الْجُمُعَةَ فَلْيَغْتَسِلْقَالَ وَفِي الْبَاب عَنْ عُمَرَ وَأَبِي سَعِيدٍ وَجَابِرٍ وَالْبَرَاءِ وَعَائِشَةَ وَأَبِي الدَّرْدَاءِ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَرُوِي عَنْ الزُّهْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذَا الْحَدِيثُ أَيْضًا حَدَّثَنَا بِذَلِكَ قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ ابْنِ شِهَابٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ و قَالَ مُحَمَّدٌ وَحَدِيثُ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ وَحَدِيثُ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ كِلَا الْحَدِيثَيْنِ صَحِيحٌ و قَالَ بَعْضُ أَصْحَابِ الزُّهْرِيِّ عَنْ الزُّهْرِيِّ قَالَ حَدَّثَنِي آلُ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ أَبُو عِيسَى وَقَدْ رُوِيَ عَنْ ابْنِ عُمَرَ عَنْ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْغُسْلِ يَوْمَ الْجُمُعَةِ أَيْضًا وَهُوَ حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari [Salim] dari [ayahnya] bahwa dia mendengar Nabi Shallahu 'alaihi wa sallam bersabda: \"Barang siapa yang mendatangi shalat Jum'at, hendaknya ia mandi.\" (perawi berkata, dalam bab ini (ada juga riwayat -pent) dari Umar, Abu Sa'id, Jabir, Barra', 'Aisyah dan Abu Darda'. Abu Isa berkata, hadist Ibnu Umar adalah hadits hasan shahih. Telah diriwayatkan dari [Az Zuhri] dari [Abdullah bin Abdullah bin Umar] dari [ayahnya] dari Nabi Shallahu 'alaihi wa sallam. Dalam hadits ini juga telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Laits bin Sa'd] dari [Ibnu Syihab] dari [Abdullah bin Abdullah bin Umar] dari [ayahnya] bahwasannya Nabi Shallahu 'alaihi wa sallam -seperi hadits di atas-, Muhammad berkata, hadits Az Zuhri dari Salim dari ayahnya dengan hadits Abdullah bin 'Abdillah bin Umar dari ayahnya kedua-duanya adalah shahih. Sebagian sahabat Az Zuhri berkata, dari [Az Zuhri] dia berkata, telah menceritakan kepadaku keluarga [Abdullah bin Umar] dari [Umar] dari Nabi Shallahu 'alaihi wa sallam mengenai mandi pada hari Jum'at juga, ini adalah hadits hasan shahih."
    },
    {
        "number": 455,
        "arab": "وَرَوَاهُ يُونُسُ وَمَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِبَيْنَمَا عُمَرُ بْنُ الْخَطَّابِ يَخْطُبُ يَوْمَ الْجُمُعَةِ إِذْ دَخَلَ رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَيَّةُ سَاعَةٍ هَذِهِ فَقَالَ مَا هُوَ إِلَّا أَنْ سَمِعْتُ النِّدَاءَ وَمَا زِدْتُ عَلَى أَنْ تَوَضَّأْتُ قَالَ وَالْوُضُوءُ أَيْضًا وَقَدْ عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِالْغُسْلِحَدَّثَنَا بِذَلِكَ أَبُو بَكْرٍ مُحَمَّدُ بْنُ أَبَانَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ مَعْمَرٍ عَنْ الزُّهْرِيِّ قَالَ و حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا أَبُو صَالِحٍ عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنَا اللَّيْثُ عَنْ يُونُسَ عَنْ الزُّهْرِيِّ بِهَذَا الْحَدِيثِ وَرَوَى مَالِكٌ هَذَا الْحَدِيثَ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ قَالَ بَيْنَمَا عُمَرُ بْنُ الْخَطَّابِ يَخْطُبُ يَوْمَ الْجُمُعَةِ فَذَكَرَ هَذَا الْحَدِيثَ قَالَ أَبُو عِيسَى وَسَأَلْتُ مُحَمَّدًا عَنْ هَذَا فَقَالَ الصَّحِيحُ حَدِيثُ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ قَالَ مُحَمَّدٌ وَقَدْ رُوِيَ عَنْ مَالِكٍ أَيْضًا عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ نَحْوُ هَذَا الْحَدِيثِ",
        "id": "Telah diriwayatkan oleh [Yunus] dan [Ma'mar] dari [Az Zuhri] dari [Salim] dari [ayahnya] tatkala [Umar bin Al Khaththab] berkhutbah pada hari Jum'at, tiba-tiba seorang lelaki dari sahabat Nabi Shallahu 'alaihi wa sallam masuk (masjid), maka dia (Umar) berkata, jam berapakah sekarang? Dia menjawab, Ketika saya mendengar adzan, saya hanya mengerjakan wudlu', tidak lebih dari itu. Dia (Umar) berkata, hanya wudlu'? tidakkah kamu tahu bahwa Rasulullah Shallahu 'alaihi wa sallam memerintahkan untuk mandi? telah menceritakan kepada kami seperti itu [Abu Bakar Muhammad bin Abban], telah menceritakan kepada kami [Abdurrazaq] dari [Ma'mar] dari [Az Zuhri] (perawi) berkata, (dan dari jalur lain) telah menceritakan kepada kami [Abdullah bin Abdurrahman] telah mengabarkan kepada kami [Abu Shalih Abdullah bin Shalih] telah menceritakan kepada kami [Al Laits] dari [Yunus] dari [Az Zuhri] dari [Salim] dia berkata, ketika [Umar bin Al Khaththab] sedang berkhutbah pada hari Jum'at, kemudian dia menyebutkan hadits ini. Abu Isa berkata, saya bertanya kepada Muhammad mengenai hadits ini, dia menjawab, yang benar adalah hadits Az Zuhri dari Salim dari ayahnya. Muhammad berkata, [Malik] juga telah meriwayatkan dari [Az Zuhri] dari [Salim] dari [ayahnya] seperti hadits di atas."
    },
    {
        "number": 456,
        "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ وَأَبُو جَنَابٍ يَحْيَى بْنُ أَبِي حَيَّةَ عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى عَنْ يَحْيَى بْنِ الْحَارِثِ عَنْ أَبِي الْأَشْعَثِ الصَّنْعَانِيِّ عَنْ أَوْسِ بْنِ أَوْسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ اغْتَسَلَ يَوْمَ الْجُمُعَةِ وَغَسَّلَ وَبَكَّرَ وَابْتَكَرَ وَدَنَا وَاسْتَمَعَ وَأَنْصَتَ كَانَ لَهُ بِكُلِّ خُطْوَةٍ يَخْطُوهَا أَجْرُ سَنَةٍ صِيَامُهَا وَقِيَامُهَاقَالَ مَحْمُودٌ قَالَ وَكِيعٌ اغْتَسَلَ هُوَ وَغَسَّلَ امْرَأَتَهُ قَالَ وَيُرْوَى عَنْ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ أَنَّهُ قَالَ فِي هَذَا الْحَدِيثِ مَنْ غَسَّلَ وَاغْتَسَلَ يَعْنِي غَسَلَ رَأْسَهُ وَاغْتَسَلَ قَالَ وَفِي الْبَاب عَنْ أَبِي بَكْرٍ وَعِمْرَانَ بْنِ حُصَيْنٍ وَسَلْمَانَ وَأَبِي ذَرٍّ وَأَبِي سَعِيدٍ وَابْنِ عُمَرَ وَأَبِي أَيُّوبَ قَالَ أَبُو عِيسَى حَدِيثُ أَوْسِ بْنِ أَوْسٍ حَدِيثٌ حَسَنٌ وَأَبُو الْأَشْعَثِ الصَّنْعَانِيُّ اسْمُهُ شَرَاحِيلُ بْنُ آدَةَ وَأَبُو جَنَابٍ يَحْيَى بْنُ حَبِيبٍ الْقَصَّابُ الْكُوفِيُّ",
        "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Sufyan] dan [Abu Janab Yahya bin Abu Hayyah] dari [Abdullah bin Isa] dari [Yahya bin Harits] dari [Abu Al Asy'ats As Shan'ani] dari [Aus bin Aus] dia berkata, Rasulullah Shallahu 'alaihi wa sallam bersabda: \"Barang siapa mandi pada hari Jum'at, membersihkan badannya dan bersegera (pergi kemasjid) kemudian berdiam diri dengan penuh konsentrasi, mendengarkan (khutbah), maka setiap langkah yang diayunkan mendapatkan pahala seperti pahala setahun, yaitu pahala puasanya dan shalat malamnya.\" Mahmud berkata, Waki' berkata, dia sendiri mandi dan juga memandikan istrinya (mandi bersama istrinya -pent). (perawi) berkata, diriwayatkan pula dari Abdullah bin Mubarrak bahwa dia mengomentari hadits ini, barang siapa yang memandikan dan mandi maksudnya adalah membasuh kepalanya kemudian mandi. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Abu Bakar, Imran bin Hushain, Salman, Abu Dzar, Abu Sa'id, Ibnu Umar dan Abu Ayyub. Abu Isa berkata, hadits Aus bin Aus adalah hadits hasan. Abu Asy'ats As Shan'ani namanya adalah Syarahil bin Adah dan Abu Jannab Yahya bin Habib Al Qashab."
    },
    {
        "number": 457,
        "arab": "حَدَّثَنَا أَبُو مُوسَى مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا سَعِيدُ بْنُ سُفْيَانَ الْجَحْدَرِيُّ حَدَّثَنَا شُعْبَةُ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَوَضَّأَ يَوْمَ الْجُمُعَةِ فَبِهَا وَنِعْمَتْ وَمَنْ اغْتَسَلَ فَالْغُسْلُ أَفْضَلُقَالَ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ وَعَائِشَةَ وَأَنَسٍ قَالَ أَبُو عِيسَى حَدِيثُ سَمُرَةَ حَدِيثٌ حَسَنٌ وَقَدْ رَوَاهُ بَعْضُ أَصْحَابِ قَتَادَةَ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ وَرَوَاهُ بَعْضُهُمْ عَنْ قَتَادَةَ عَنْ الْحَسَنِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَنْ بَعْدَهُمْ اخْتَارُوا الْغُسْلَ يَوْمَ الْجُمُعَةِ وَرَأَوْا أَنْ يُجْزِئَ الْوُضُوءُ مِنْ الْغُسْلِ يَوْمَ الْجُمُعَةِ قَالَ الشَّافِعِيُّ وَمِمَّا يَدُلُّ عَلَى أَنَّ أَمْرَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالْغُسْلِ يَوْمَ الْجُمُعَةِ أَنَّهُ عَلَى الِاخْتِيَارِ لَا عَلَى الْوُجُوبِ حَدِيثُ عُمَرَ حَيْثُ قَالَ لِعُثْمَانَ وَالْوُضُوءُ أَيْضًا وَقَدْ عَلِمْتَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ بِالْغُسْلِ يَوْمَ الْجُمُعَةِ فَلَوْ عَلِمَا أَنَّ أَمْرَهُ عَلَى الْوُجُوبِ لَا عَلَى الِاخْتِيَارِ لَمْ يَتْرُكْ عُمَرُ عُثْمَانَ حَتَّى يَرُدَّهُ وَيَقُولَ لَهُ ارْجِعْ فَاغْتَسِلْ وَلَمَا خَفِيَ عَلَى عُثْمَانَ ذَلِكَ مَعَ عِلْمِهِ وَلَكِنْ دَلَّ فِي هَذَا الْحَدِيثِ أَنَّ الْغُسْلَ يَوْمَ الْجُمُعَةِ فِيهِ فَضْلٌ مِنْ غَيْرِ وُجُوبٍ يَجِبُ عَلَى الْمَرْءِ فِي ذَلِكَ",
        "id": "Telah menceritakan kepada kami [Abu Musa Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Sa'id bin Sufyan Al Jahdari] telah menceritakan kepada kami [Syu'bah] dari [Qatadah] dari [Al Hasan] dari [Samrah bin Jundab] dia berkata, Rasulullah Shallahu 'alaihi wa sallam bersabda: \"Barang siapa yang berwudlu' pada hari Jum'at maka hal itu sudah mencukupinya dan baik, akan tetapi barang siapa yang mandi, maka mandi itu lebih utama.\" (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Abu Hurairah, 'Aisyah dan Anas. Abu Isa berkata, hadits Samrah adalah hadits hasan. Sebagian sahabat Qatadah juga telah meriwayatkan dari Qatadah dari Hasan dari Samrah bin Jundab, sebagiannya lagi meriwayatkan dari Qatadah dari Hasan dari Nabi Shallahu 'alaihi wa sallam secara mursal. Hadits ini juga diamalkan oleh ahli ilmu dari para sahabat Nabi Shallahu 'alaihi wa sallam dan generasi setelahnya, bahwa mereka memilih mandi pada hari Jum'at, akan tetapi (mereka juga berpendapat) bahwa wudlu' pada hari Jum'at telah mencukupi (sebagai pengganti) dari mandi. Syafi'i berkata, diantara hal-hal yang menunjukkan bahwa perintah Nabi Shallahu 'alaihi wa sallam untuk mandi pada hari Jum'at hanya sekedar alternatif, bukan suatu kewajiban, adalah hadits Umar yang berkata kepada Utsman \"dan wudlu' (telah cukup), sungguh kamu telah mengetahui bahwa Rasulullah Shallahu 'alaihi wa sallam memerintahkan untuk mandi pada hari Jum'at. Seandainya (Umar dan Utsman) mengetahui bahwa perintahnya adalah wajib, bukan sekedar alternatif, tentu Umar tidak akan membiarkan 'Utsman dan menolaknya untuk datang tanpa mandi terlebih dahulu, seraya berkata kepadanya \"Pulanglah dan mandilah terlebih dahulu.\" Utsman pun mengetahui hal itu, tetapi yang ditunjukkan dalam hadits tersebut bahwa mandi pad ahari Jum'at merupakan keutamaan, dan tidak diwajibkan atas seseorang."
    },
    {
        "number": 458,
        "arab": "حَدَّثَنَا هَنَّادٌ قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ أَتَى الْجُمُعَةَ فَدَنَا وَاسْتَمَعَ وَأَنْصَتَ غُفِرَ لَهُ مَا بَيْنَهُ وَبَيْنَ الْجُمُعَةِ وَزِيَادَةُ ثَلَاثَةِ أَيَّامٍ وَمَنْ مَسَّ الْحَصَى فَقَدْ لَغَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Hannad] dia berkata, telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata, Rasulullah Shallahu 'alaihi wa sallam bersabda: \"Barang siapa berwudlu' kemudian menyempurnakan wudlu'nya lalu mendatangi shalat Jum'at, lalu dia mendekat, mendengarkan serta berdiam diri (untuk menyimak khutbah), maka akan diampuni dosa-dosanya diantara hari itu sampai Jum'at (berikutnya) dan ditambah tiga hari setelah itu. Barang siapa yang bermain kerikil, maka ia telah melakukan perbuatan sia-sia.\" Abu Isa berkata, ini adalah hadits hasan shahih."
    },
    {
        "number": 459,
        "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مُوسَى الْأَنْصَارِيُّ حَدَّثَنَا مَعْنٌ حَدَّثَنَا مَالِكٌ عَنْ سُمَيٍّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ اغْتَسَلَ يَوْمَ الْجُمُعَةِ غُسْلَ الْجَنَابَةِ ثُمَّ رَاحَ فَكَأَنَّمَا قَرَّبَ بَدَنَةً وَمَنْ رَاحَ فِي السَّاعَةِ الثَّانِيَةِ فَكَأَنَّمَا قَرَّبَ بَقَرَةً وَمَنْ رَاحَ فِي السَّاعَةِ الثَّالِثَةِ فَكَأَنَّمَا قَرَّبَ كَبْشًا أَقْرَنَ وَمَنْ رَاحَ فِي السَّاعَةِ الرَّابِعَةِ فَكَأَنَّمَا قَرَّبَ دَجَاجَةً وَمَنْ رَاحَ فِي السَّاعَةِ الْخَامِسَةِ فَكَأَنَّمَا قَرَّبَ بَيْضَةً فَإِذَا خَرَجَ الْإِمَامُ حَضَرَتْ الْمَلَائِكَةُ يَسْتَمِعُونَ الذِّكْرَقَالَ وَفِي الْبَاب عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو وَسَمُرَةَ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Ishaq bin Musa Al Anshari] telah menceritakan kepada kami [Ma'n] telah menceritakan kepada kami [Malik] dari [Sumayy] dari [Abu Shalih] dari [Abu Hurairah] bahwasannya Rasulullah Shallahu 'alaihi wa sallam bersabda: \"Barang siapa mandi pada hari Jum'at sebagaimana mandi janabat (besar) kemudian datang (ke tempat shalat Jum'at sebagai orang pertama kali datang), maka seakan-akan ia berkurban seekor unta, dan barang siapa yang datang pada kesempatan kedua, maka seakan-akan ia berkurban seekor sapi, barang siapa yang datang pada kesempatan ketiga, maka seakan-akan ia berkurban seekor domba yang bertanduk, barang siapa yang datang pada kesempatan keempat, maka seakan-akan ia berkurban seekor ayam, barang siapa yang datang pada kesempatan kelima, seakan-akan ia berkurban sebutir telur, tatkala seorang imam keluar (menuju mimbar), maka para Malaikat berdatangan untuk mendengarkan khutbah.\" Abu Isa berkata, hadits Abu Hurairah adalah hadits hasan shahih."
    },
    {
        "number": 460,
        "arab": "حَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ عَبِيدَةَ بْنِ سُفْيَانَ عَنْ أَبِي الْجَعْدِ يَعْنِي الضَّمْرِيَّ وَكَانَتْ لَهُ صُحْبَةٌ فِيمَا زَعَمَ مُحَمَّدُ بْنُ عَمْرٍو قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَرَكَ الْجُمُعَةَ ثَلَاثَ مَرَّاتٍ تَهَاوُنًا بِهَا طَبَعَ اللَّهُ عَلَى قَلْبِهِقَالَ وَفِي الْبَاب عَنْ ابْنِ عُمَرَ وَابْنِ عَبَّاسٍ وَسَمُرَةَ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي الْجَعْدِ حَدِيثٌ حَسَنٌ قَالَ وَسَأَلْتُ مُحَمَّدًا عَنْ اسْمِ أَبِي الْجَعْدِ الضَّمْرِيِّ فَلَمْ يَعْرِفْ اسْمَهُ وَقَالَ لَا أَعْرِفُ لَهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا هَذَا الْحَدِيثَ قَالَ أَبُو عِيسَى وَلَا نَعْرِفُ هَذَا الْحَدِيثَ إِلَّا مِنْ حَدِيثِ مُحَمَّدِ بْنِ عَمْرٍو",
        "id": "Telah menceritakan kepada kami [Ali bin Khasyram] telah mengabarkan kepada kami [Isa bin Yunus] dari [Muhammad bin Amru] dari ['Abidah bin Sufyan] dari [Abu Ja'd yaitu Adl Dlamri] dan dia pernah bertemu (dengan Rasulullah) sebagaimana yang diperkirakan Muhammad bin Amru dia berkata, Rasulullah Shallahu 'alaihi wa sallam bersabda: \"Barang siapa yang meninggalkan shalat Jum'at sebanyak tiga kali karena meremehkannya, maka Allah akan menutup hatinya.\" (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Ibnu Umar, Ibnu 'Abbas dan Samrah. Abu Isa berkata, hadits Abu Ja'd adalah hadits hasan. Dia berkata, saya bertanya kepada Muhammad mengenai namanya Abu Ja'd Ad Dlamri, tetapi ia tidak mengetahui namanya seray aberkata, saya tidak mengetahui darinya apa yang datang dari Nabi Shallahu 'alaihi wa sallam melainkan hadits ini. Abu Isa berkata, kami tidak mengetahui hadits ini kecuali dari hadits Muhammad bin Amru."
    },
    {
        "number": 461,
        "arab": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ وَمُحَمَّدُ بْنُ مَدُّوَيْهِ قَالَا حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ حَدَّثَنَا إِسْرَائِيلُ عَنْ ثُوَيْرٍ عَنْ رَجُلٍ مِنْ أَهْلِ قُبَاءَ عَنْ أَبِيهِ وَكَانَ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَأَمَرَنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ نَشْهَدَ الْجُمُعَةَ مِنْ قُبَاءَوَقَدْ رُوِيَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي هَذَا وَلَا يَصِحُّ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَلَا يَصِحُّ فِي هَذَا الْبَابِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْءٌ وَقَدْ رُوِيَ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ الْجُمُعَةُ عَلَى مَنْ آوَاهُ اللَّيْلُ إِلَى أَهْلِهِ وَهَذَا حَدِيثٌ إِسْنَادُهُ ضَعِيفٌ إِنَّمَا يُرْوَى مِنْ حَدِيثِ مُعَارِكِ بْنِ عَبَّادٍ عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدٍ الْمَقْبُرِيِّ وَضَعَّفَ يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ عَبْدَ اللَّهِ بْنَ سَعِيدٍ الْمَقْبُرِيَّ فِي الْحَدِيثِ فَقَالَ وَاخْتَلَفَ أَهْلُ الْعِلْمِ عَلَى مَنْ تَجِبُ الْجُمُعَةُ قَالَ بَعْضُهُمْ تَجِبُ الْجُمُعَةُ عَلَى مَنْ آوَاهُ اللَّيْلُ إِلَى مَنْزِلِهِ و قَالَ بَعْضُهُمْ لَا تَجِبُ الْجُمُعَةُ إِلَّا عَلَى مَنْ سَمِعَ النِّدَاءَ وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَقَ سَمِعْت أَحْمَدَ بْنَ الْحَسَنِ يَقُولُ كُنَّا عِنْدَ أَحْمَدَ بْنِ حَنْبَلٍ فَذَكَرُوا عَلَى مَنْ تَجِبُ الْجُمُعَةُ فَلَمْ يَذْكُرْ أَحْمَدُ فِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْئًا قَالَ أَحْمَدُ بْنُ الْحَسَنِ فَقُلْتُ لِأَحْمَدَ بْنِ حَنْبَلٍ فِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ أَحْمَدُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قُلْتُ نَعَمْ قَالَ أَحْمَدُ بْنُ الْحَسَنِ حَدَّثَنَا حَجَّاجُ بْنُ نُصَيْرٍ حَدَّثَنَا مُعَارِكُ بْنُ عَبَّادٍ عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدٍ الْمَقْبُرِيِّ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْجُمُعَةُ عَلَى مَنْ آوَاهُ اللَّيْلُ إِلَى أَهْلِهِ قَالَ فَغَضِبَ عَلَيَّ أَحْمَدُ بْنُ حَنْبَلٍ وَقَالَ لِي اسْتَغْفِرْ رَبَّكَ اسْتَغْفِرْ رَبَّكَ قَالَ أَبُو عِيسَى إِنَّمَا فَعَلَ أَحْمَدُ بْنُ حَنْبَلٍ هَذَا لِأَنَّهُ لَمْ يَعُدَّ هَذَا الْحَدِيثَ شَيْئًا وَضَعَّفَهُ لِحَالِ إِسْنَادِهِ",
        "id": "Telah menceritakan kepada kami [Abd bin Humaid] dan [Muhammad bin Madduwaih] keduanya berkata, telah menceritakan kepada kami [Al Fadll bin Dukain] telah menceritakan kepada kami [Isra'il] dari [Tsuwair] dari [seorang lelaki penduduk Quba'] dari [ayahnya] dia termasuk dari sahabat Nabi Shallahu 'alaihi wa sallam, dia berkata, Nabi Shallahu 'alaihi wa sallam memerintahkan kami menghadiri shalat Jum'at di Quba'. Dan telah diriwayatkan dari Abu Hurairah dari Nabi Shallahu 'alaihi wa sallam dalam hal ini, namun (periwayatannya) tidak shahih. Abu Isa berkata, kami tidak mengetahui hadits ini kecuali dari jalur ini, dan dalam bab ini juga tidak ada yang sah (jalur periwayatannya). Telah diriwayatkan dari Abu Hurairah dari Nabi Shallahu 'alaihi wa sallam bahwa beliau bersabda: \"Kewajiban Jum'at adalah bagi orang yang mendapati malam bersama keluarganya.\" Hadits ini sanadnya lemah, yang diriwayatkan dari hadits Mu'arik bin 'Abbad dari Abdullah bin Sa'id Al Maqburi. Yahya bin Sa'id Al Qatthan telah melemahkan Abdullah bin Sa'id Al Maqburi dalam masalah hadits. (perawi) berkata, para ahli ilmu berbeda pendapat tentang siapakah yang diwajibkan melaksanakan shalat Jum'at, sebagian berpendapat bahwa Jum'at wajib bagi orang yang dapat bermalam dengan keluarganya, sedangkan sebagian yang lain berpendapat Jum'at tidak wajib kecuali bagi orang yang dapat mendengar panggilan, ini adalah pendapat Imam Syafi'i, Ahmad dan Ishaq, (perawi berkata) saya telah mendengar Ahmad bin Al Hasan berkata, kami berada di sisi Ahmad bin Hambal, kemudian orang-orang berbicara mengenai orang yang diwajibkan melaksanakan shalat Jum'at, Ahmad tidak menyebutkan dalam masalah itu satu haditspun dari Nabi Shallahu 'alaihi wa sallam, Ahmad bin Al Hasan berkata, maka saya berkata kepada Ahmad bin Hambal, ternyata dalam masalah ini ada riwayat dari Abu Hurairah dari Nabi Shallahu 'alaihi wa sallam. Maka Ahmad bertanya, dari Nabi Shallahu 'alaihi wa sallam? Saya menjawab, ya. Ahmad bin Al Hasan berkata, telah menceritakan kepada kami Hajjaj bin Nushair telah menceritakan kepada kami Mu'arik bin 'Abbad dari Abdullah bin Sa'id Al Maqburi dari ayahnya dari Abu Hurairah dari Nabi Shallahu 'alaihi wa sallam, beliau bersabda: \"Jum'at itu wajib bagi orang yang dapat bermalam dengan keluarganya.\" Ahmad bin Al Hasan berkata, maka Ahmad bin Hambal langsung marah kepadaku sambil berkata kepadaku, beristighfarlah kepada Rabbmu, beristighfarlah kepada Rabbmu. Abu Isa berkata, Ahmad bin Hambal melakukan demikian ini karena dia tidak menganggap hadits ini sama sekali, bahkan dia melemahkan karena sanadnya."
    },
    {
        "number": 462,
        "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا سُرَيْجُ بْنُ النُّعْمَانِ حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ عَنْ عُثْمَانَ بْنِ عَبْدِ الرَّحْمَنِ التَّيْمِيِّ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي الْجُمُعَةَ حِينَ تَمِيلُ الشَّمْسُحَدَّثَنَا يَحْيَى بْنُ مُوسَى حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ عَنْ عُثْمَانَ بْنِ عَبْدِ الرَّحْمَنِ التَّيْمِيِّ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ قَالَ وَفِي الْبَاب عَنْ سَلَمَةَ بْنِ الْأَكْوَعِ وَجَابِرٍ وَالزُّبَيْرِ بْنِ الْعَوَّامِ قَالَ أَبُو عِيسَى حَدِيثُ أَنَسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ وَهُوَ الَّذِي أَجْمَعَ عَلَيْهِ أَكْثَرُ أَهْلِ الْعِلْمِ أَنَّ وَقْتَ الْجُمُعَةِ إِذَا زَالَتْ الشَّمْسُ كَوَقْتِ الظُّهْرِ وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَقَ وَرَأَى بَعْضُهُمْ أَنَّ صَلَاةَ الْجُمُعَةِ إِذَا صُلِّيَتْ قَبْلَ الزَّوَالِ أَنَّهَا تَجُوزُ أَيْضًا و قَالَ أَحْمَدُ وَمَنْ صَلَّاهَا قَبْلَ الزَّوَالِ فَإِنَّهُ لَمْ يَرَ عَلَيْهِ إِعَادَةً",
        "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Suraij bin Nu'man] telah menceritakan kepada kami [Fulaih bin Sulaiman] dari [Utsman bin Abdurrahman At Taimi] dari [Anas bin Malik] bahwasannya Nabi Shallahu 'alaihi wa sallam melaksanakan shalat Jum'at tatkala matahari mulai condong. Telah menceritakan kepada kami [Yahya bin Musa] telah menceritakan kepada kami [Abu Daud At Thayalisi] telah menceritakan kepada kami [Fulaih bin Sulaiman] dari [Utman bin Abdurrahman At Taimi] dari [Anas] dari Nabi Shallahu 'alaihi wa sallam sebagaimana hadits diatas. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Salamah bin Al Akwa', Jabir dan Zubair bin 'Awwam. Abu Isa berkata, hadits Anas adalah hadits hasan shahih, hadits ini juga dijadikan pijakan oleh ahli ilmu bahwa waktu Jum'at adalah ketika matahari mulai condong, sebagaimana waktu dluhur, seperti perkataan Syafi'i, Ahmad dan Ishaq. Sebagian yang lain berpendapat bahwa shalat Jum'at boleh dikerjakan sebelum tergelincirnya matahari, Ahmad juga berkata, barang siapa shalat Jum'at sebelum matahari tergelincir maka baginya tidak wajib untuk mengulanginya."
    },
    {
        "number": 463,
        "arab": "حَدَّثَنَا أَبُو حَفْصٍ عَمْرُو بْنُ عَلِيٍّ الْفَلَّاسُ الصَّيْرَفِيُّ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ وَيَحْيَى بْنُ كَثِيرٍ أَبُو غَسَّانَ الْعَنْبَرِيُّ قَالَا حَدَّثَنَا مُعَاذُ بْنُ الْعَلَاءِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْطُبُ إِلَى جِذْعٍ فَلَمَّا اتَّخَذَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمِنْبَرَ حَنَّ الْجِذْعُ حَتَّى أَتَاهُ فَالْتَزَمَهُ فَسَكَنَقَالَ وَفِي الْبَاب عَنْ أَنَسٍ وَجَابِرٍ وَسَهْلِ بْنِ سَعْدٍ وَأُبَيِّ بْنِ كَعْبٍ وَابْنِ عَبَّاسٍ وَأُمِّ سَلَمَةَ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ وَمُعَاذُ بْنُ الْعَلَاءِ هُوَ بَصْرِيٌّ وَهُوَ أَخُو أَبِي عَمْرِو بْنِ الْعَلَاءِ",
        "id": "Telah menceritakan kepada kami [Abu Hafsh Amru bin Ali Al Fallas As Shairafi] telah menceritakan kepada kami ['Utsman bin Umar] dan [Yahya bin Katsir Abu Ghatsan Al Anbari] keduanya berkata, telah menceritakan kepada kami [Mu'adz bin 'Ala'] dari [Nafi'] dari [Ibnu Umar] bahwasannya Nabi Shallahu 'alaihi wa sallam berkhutbah dengan menggunakan pelepah kurma, tatkala Nabi Shallahu 'alaihi wa sallam beralih dengan menggunakan minbar, maka pelepah tersebut menangis sehingga beliau mendatanginya dan memegangnya sampai tenang. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Anas, Jabir, Sahl bin Sa'd, Ubay bin Ka'ab, Ibnu Abbas dan Ummu Salamah. Abu Isa berkata, hadits Ibnu Umar adalah hadits hasan gharib shahih. Mu'adz bin 'Ala' adalah Bashri ia merupakan saudara laki-lakinya Amru bin 'Ala'."
    },
    {
        "number": 464,
        "arab": "حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ الْبَصْرِيُّ حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَخْطُبُ يَوْمَ الْجُمُعَةِ ثُمَّ يَجْلِسُ ثُمَّ يَقُومُ فَيَخْطُبُ قَالَ مِثْلَ مَا تَفْعَلُونَ الْيَوْمَقَالَ وَفِي الْبَاب عَنْ ابْنِ عَبَّاسٍ وَجَابِرِ بْنِ عَبْدِ اللَّهِ وَجَابِرِ بْنِ سَمُرَةَ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَهُوَ الَّذِي رَآهُ أَهْلُ الْعِلْمِ أَنْ يَفْصِلَ بَيْنَ الْخُطْبَتَيْنِ بِجُلُوسٍ",
        "id": "Telah menceritakan kepada kami [Humaid bin Mas'adah Al Bashri] telah menceritakan kepada kami [Khalid bin Harits] telah menceritakan kepada kami ['Ubaidullah bin Umar] dari [Nafi'] dari [Ibnu Umar] bahwa Nabi Shallahu 'alaihi wa sallam berkhutbah pada hari Jum'at kemudian duduk, lalu berdiri melanjutkan berkhutbah. Ibnu Umar berkata, seperti yang kalian lakukan hari ini. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Ibnu 'Abbas, Jabir bin Abdullah dan Jabir bin Samrah. Abu Isa berkata, hadits Ibnu Umar adalah hadits hasan shahih, hadits tersebut juga menjadi pendapat ahli ilmu, yaitu hendaknya antara dua khutbah dipisah dengan duduk."
    },
    {
        "number": 465,
        "arab": "حَدَّثَنَا قُتَيْبَةُ وَهَنَّادٌ قَالَا حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَكُنْتُ أُصَلِّي مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَكَانَتْ صَلَاتُهُ قَصْدًا وَخُطْبَتُهُ قَصْدًاقَالَ وَفِي الْبَاب عَنْ عَمَّارِ بْنِ يَاسِرٍ وَابْنِ أَبِي أَوْفَى قَالَ أَبُو عِيسَى حَدِيثُ جَابِرِ بْنِ سَمُرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Qutaibah] dan [Hannad] keduanya berkata, telah menceritakan kepada kami [Abu Al Ahwash] dari [Simak bin Harb] dari [Jabir bin Samrah] dia berkata, saya shalat bersama Nabi Shallahu 'alaihi wa sallam, ternyata shalatnya sederhana dan khutbahnya juga sederhana (tidak panjang). (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari 'Ammar bin Yasir dan Ibnu Abu Aufa . Abu Isa berkata, hadits Jabir bin Samrah adalah hadits hasan shahih."
    },
    {
        "number": 466,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ عَطَاءٍ عَنْ صَفْوَانَ بْنِ يَعْلَى بْنِ أُمَيَّةَ عَنْ أَبِيهِ قَالَسَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ عَلَى الْمِنْبَرِ{ وَنَادَوْا يَا مَالِكُ }قَالَ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ وَجَابِرِ بْنِ سَمُرَةَ قَالَ أَبُو عِيسَى حَدِيثُ يَعْلَى بْنِ أُمَيَّةَ حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ وَهُوَ حَدِيثُ ابْنِ عُيَيْنَةَ وَقَدْ اخْتَارَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ أَنْ يَقْرَأَ الْإِمَامُ فِي الْخُطْبَةِ آيًا مِنْ الْقُرْآنِ قَالَ الشَّافِعِيُّ وَإِذَا خَطَبَ الْإِمَامُ فَلَمْ يَقْرَأْ فِي خُطْبَتِهِ شَيْئًا مِنْ الْقُرْآنِ أَعَادَ الْخُطْبَةَ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Amru bin Dinar] dari [Atha'] dari [Shafwan bin Ya'la bin 'Umaiyah] dari [bapaknya] dia berkata, saya telah mendengar Nabi Shallahu 'alaihi wa sallam membaca atas mimbar \"WANAADAU YAA MAALIKU\". (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Abu Hurairah dan Jabir bin Samrah. Abu Isa berkata, hadits Ya'la bin 'Umaiyah adalah hadits hasan shahih gharib, ia merupakan hadits Ibnu Uyainah, sebagian ahli ilmu memilih hendaknya imam membaca ayat dari Al Qur'an dalam khutbah. Imam Syafi'I berkata, apabila seorang imam berkhutbah, kemudian tidak membaca ayat dari Al Qur'an dalam khutbahnya, maka dia harus mengulangi khutbahnya."
    },
    {
        "number": 467,
        "arab": "حَدَّثَنَا عَبَّادُ بْنُ يَعْقُوبَ الْكُوفِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ الْفَضْلِ بْنِ عَطِيَّةَ عَنْ مَنْصُورٍ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَوَى عَلَى الْمِنْبَرِ اسْتَقْبَلْنَاهُ بِوُجُوهِنَاقَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ ابْنِ عُمَرَ وَحَدِيثُ مَنْصُورٍ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ مُحَمَّدِ بْنِ الْفَضْلِ بْنِ عَطِيَّةَ وَمُحَمَّدُ بْنُ الْفَضْلِ بْنِ عَطِيَّةَ ضَعِيفٌ ذَاهِبُ الْحَدِيثِ عِنْدَ أَصْحَابِنَا وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ يَسْتَحِبُّونَ اسْتِقْبَالَ الْإِمَامِ إِذَا خَطَبَ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَقَ قَالَ أَبُو عِيسَى وَلَا يَصِحُّ فِي هَذَا الْبَابِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شَيْءٌ",
        "id": "Telah menceritakan kepada kami [Abbad bin Ya'qub Al Kufi] telah menceritakan kepada kami [Muhammad bin Al Fadlal bin 'Athiyah] dari [Manshur] dari [Ibrahim] dari [Alqamah] dari [Abdullah bin Mas'ud] dia berkata, apabila Rasulullah Shalallhu 'alaihi wa salam berada di atas mimbar, maka kami menghadap ke arahnya dengan seluruh wajah kami. Abu Isa berkata, dalam bab ini (ada juga riwayat -pent) dari Ibnu Umar. Hadits Manshur tidak kami ketahui kecuali dari hadits Muhammad bin Al Fadll bin 'Athiyah, sedangkan Muhammad bin Al Fadll bin 'Athiyah adalah lemah.\"Dzahibul hadits\" menurut sahabat kami. Hadits ini juga diamalkan oleh para ahli ilmu dari kalangan sahabat Nabi Sahalallahu 'alaihi wa salam dan yang lainnya, bahwa mereka mengistihbabkan (menyukai) menghadap kearah imam apabila sedang berkhutbah, (hadits ini) juga sebagai pendapat Sufyan Ats Tsauri, Syafi'i, Ahmad, dan Ishaq. Abu Isa berkata, tidak sah satu haditspun dari Nabi Shallahu 'alaihi wa sallam dalam bab ini."
    },
    {
        "number": 468,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَبَيْنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ يَوْمَ الْجُمُعَةِ إِذْ جَاءَ رَجُلٌ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَصَلَّيْتَ قَالَ لَا قَالَ قُمْ فَارْكَعْقَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Hammad bin Zaid] dari [Amru bin Dinar] dari [Jabir bin Abdullah] dia berkata, ketika Nabi Shallahu 'alaihi wa sallam berkhutbah pada hari Jum'at, tiba-tiba seorang laki-laki datang, maka Nabi Shallahu 'alaihi wa sallam bersabda: \"Apakah kamu sudah shalat?\" dia menjawab, belum. Beliau bersabda: \"Bangun dan kerjakanlah shalat.\" Abu Isa berkata, ini adalah hadits hasan shahih, lebih shahih dalam bab ini."
    },
    {
        "number": 469,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مُحَمَّدِ بْنِ عَجْلَانَ عَنْ عِيَاضِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي سَرْحٍ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّدَخَلَ يَوْمَ الْجُمُعَةِ وَمَرْوَانُ يَخْطُبُ فَقَامَ يُصَلِّي فَجَاءَ الْحَرَسُ لِيُجْلِسُوهُ فَأَبَى حَتَّى صَلَّى فَلَمَّا انْصَرَفَ أَتَيْنَاهُ فَقُلْنَا رَحِمَكَ اللَّهُ إِنْ كَادُوا لَيَقَعُوا بِكَ فَقَالَ مَا كُنْتُ لِأَتْرُكَهُمَا بَعْدَ شَيْءٍ رَأَيْتُهُ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ ذَكَرَ أَنَّ رَجُلًا جَاءَ يَوْمَ الْجُمُعَةِ فِي هَيْئَةٍ بَذَّةٍ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ يَوْمَ الْجُمُعَةِ فَأَمَرَهُ فَصَلَّى رَكْعَتَيْنِ وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُقَالَ ابْنُ أَبِي عُمَرَ كَانَ سُفْيَانُ بْنُ عُيَيْنَةَ يُصَلِّي رَكْعَتَيْنِ إِذَا جَاءَ وَالْإِمَامُ يَخْطُبُ وَكَانَ يَأْمُرُ بِهِ وَكَانَ أَبُو عَبْدِ الرَّحْمَنِ الْمُقْرِئُ يَرَاهُ قَالَ أَبُو عِيسَى و سَمِعْت ابْنَ أَبِي عُمَرَ يَقُولُ قَالَ سُفْيَانُ بْنُ عُيَيْنَةَ كَانَ مُحَمَّدُ بْنُ عَجْلَانَ ثِقَةً مَأْمُونًا فِي الْحَدِيثِ قَالَ وَفِي الْبَاب عَنْ جَابِرٍ وَأَبِي هُرَيْرَةَ وَسَهْلِ بْنِ سَعْدٍ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي سَعِيدٍ الْخُدْرِيِّ حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَبِهِ يَقُولُ الشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَقُ و قَالَ بَعْضُهُمْ إِذَا دَخَلَ وَالْإِمَامُ يَخْطُبُ فَإِنَّهُ يَجْلِسُ وَلَا يُصَلِّي وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَأَهْلِ الْكُوفَةِ وَالْقَوْلُ الْأَوَّلُ أَصَحُّ حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا الْعَلَاءُ بْنُ خَالِدٍ الْقُرَشِيُّ قَالَ رَأَيْتُ الْحَسَنَ الْبَصْرِيَّ دَخَلَ الْمَسْجِدَ يَوْمَ الْجُمُعَةِ وَالْإِمَامُ يَخْطُبُ فَصَلَّى رَكْعَتَيْنِ ثُمَّ جَلَسَ إِنَّمَا فَعَلَ الْحَسَنُ اتِّبَاعًا لِلْحَدِيثِ وَهُوَ رَوَى عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذَا الْحَدِيثَ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Abu Umar] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Muhammad bin 'Ajlan] dari ['Iyadl bin Abdullah bin Abu Sarh] bahwa [Abu Sa'id Al Khudri] masuk masjid pada hari Jum'at, sementara Marwan sedang berkhutbah, lantas dia (Abu Sa'id) berdiri untuk melaksanakan shalat, maka datanglah para pengawalnya dan menyuruhnya untuk duduk, namun dia menolak sampai dia selesai mengerjakan shalat, ketika ia (Marwan) beranjak pergi (dari shalat Jum'at), kami mendatanginya dan berkata, Semoga Allah merahmatimu hampir saja mereka melakukan sesuatu kepadamu, Abu Sa'id berkata, saya tidak akan meniggalkan dua raka'at itu selamanya setelah saya melihatnya dari Rasulullah Shallahu 'alaihi wa sallam.\" kemudian dia menyebutkan bahwa ada seorang lelaki yang datang pada hari Jum'at dalam keadaan lusuh, Sementara Nabi Shallahu 'alaihi wa sallam sedang berkhutbah, lantas beliau menyuruhnya untuk shalat dua raka'at, padahal beliau sedang berkhutbah. Ibnu Abu Umar berkata, Sufyan bin 'Uyainah biasa melaksanakan shalat dua raka'at, padahal imam sedang berkhutbah dan dia juga memerintahkan untuk mengerjakan shalat tersebut, padahal Abu Abdurrahman Al Muqri' melihatnya. Abu Isa berkata, saya mendengar Ibnu Abu Umar berkata, Sufyan bin 'Uyainah berkata, Muhammad bin Ajlan adalah tsiqah dan terpercaya dalam periwayatan haditsnya. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Jabir, Abu Hurairah dan Sahl bin Sa'ad. Abu Isa berkata, hadits Abu Sa'id Al Khudri adalah hadits hasan shahih, hadits ini juga diamalkan oleh sebagian ahli ilmu. Ini adalah pendapat Imam Syafi'I, Ahmad dan Ishaq. Sedangkan sebagian ahli ilmu yang lain berpendapat bahwa apabila seseorang masuk (masjid) dan imam sedang berkhutbah, maka hendaknya dia duduk dan tidak melaksanakan shalat, ini adalah pendapat Sufyan Ats Tsauri dan penduduk Kufah. Sedangkan pendapat pertama adalah yang paling shahih. Telah menceritakan kepada kami Qutaibah telah menceritakan kepada kami Al 'la bin Khalid Al Qurasyi dia berkata, saya melihat Hasan Al Bashri masuk masjid pada hari Jum'at sedangkan imam berkhutbah, kemudian dia melaksanakan shalat dua raka'at lalu duduk, hanyasanya Hasan melakukan hal itu karena mengikuti hadits, dan dia telah meriwayatkan hadits ini dari Jabir dari Nabi Shallahu 'alaihi wa sallam."
    },
    {
        "number": 470,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ عُقَيْلٍ عَنْ الزُّهْرِيِّ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ عَنْ أَبِي هُرَيْرَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ قَالَ يَوْمَ الْجُمُعَةِ وَالْإِمَامُ يَخْطُبُ أَنْصِتْ فَقَدْ لَغَاقَالَ وَفِي الْبَاب عَنْ ابْنِ أَبِي أَوْفَى وَجَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَيْهِ عِنْدَ أَهْلِ الْعِلْمِ كَرِهُوا لِلرَّجُلِ أَنْ يَتَكَلَّمَ وَالْإِمَامُ يَخْطُبُ وَقَالُوا إِنْ تَكَلَّمَ غَيْرُهُ فَلَا يُنْكِرْ عَلَيْهِ إِلَّا بِالْإِشَارَةِ وَاخْتَلَفُوا فِي رَدِّ السَّلَامِ وَتَشْمِيتِ الْعَاطِسِ وَالْإِمَامُ يَخْطُبُ فَرَخَّصَ بَعْضُ أَهْلِ الْعِلْمِ فِي رَدِّ السَّلَامِ وَتَشْمِيتِ الْعَاطِسِ وَالْإِمَامُ يَخْطُبُ وَهُوَ قَوْلُ أَحْمَدَ وَإِسْحَقَ وَكَرِهَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ التَّابِعِينَ وَغَيْرِهِمْ ذَلِكَ وَهُوَ قَوْلُ الشَّافِعِيِّ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari ['Uqail] dari [Az Zuhri] dari [Sa'id bin Al Musayyib] dari [Abu Hurairah] bahwasannya Nabi Shallahu 'alaihi wa sallam bersabda: \"Barang siapa yang berkata \"diamlah\" pada hari Jum'at padahal imam berkhutbah, maka ia telah melakukan perbuatan sia-sia.\" (perawi) berkata, dalam bab ini, (ada juga riwayat -pent) dari Ibnu Abi Aufa dan Jabir bin Abdullah. Abu Isa berkata, hadits Abu Hurairah adalah hadits hasan shahih dan diamalkan pula oleh ahli ilmu, mereka membenci seseorang yang berbicara sedangkan imam sedang berkhutbah, mereka berkata, jika ada seseorang yang berkata, lebih baik ia tidak diperingatkan melainkan dengan isyarat. Mereka berselisih mengenai menjawab salam dan mendo'akan orang yang bersin waktu imam sedang berkhutbah, ini merupakan pendapat Ahmad dan Ishaq. Sebagian Ahli ilmu dari kalangan tabi'in dan yang lainnya membenci yang demikian itu, sebagaimana perkataan Syafi'i."
    },
    {
        "number": 471,
        "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ عَنْ زَبَّانَ بْنِ فَائِدٍ عَنْ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ الْجُهَنِيِّ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ تَخَطَّى رِقَابَ النَّاسِ يَوْمَ الْجُمُعَةِ اتَّخَذَ جِسْرًا إِلَى جَهَنَّمَقَالَ وَفِي الْبَاب عَنْ جَابِرٍ قَالَ أَبُو عِيسَى حَدِيثُ سَهْلِ بْنِ مُعَاذِ بْنِ أَنَسٍ الْجُهَنِيِّ حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ رِشْدِينَ بْنِ سَعْدٍ وَالْعَمَلُ عَلَيْهِ عِنْدَ أَهْلِ الْعِلْمِ كَرِهُوا أَنْ يَتَخَطَّى الرَّجُلُ رِقَابَ النَّاسِ يَوْمَ الْجُمُعَةِ وَشَدَّدُوا فِي ذَلِكَ وَقَدْ تَكَلَّمَ بَعْضُ أَهْلِ الْعِلْمِ فِي رِشْدِينَ بْنِ سَعْدٍ وَضَعَّفَهُ مِنْ قِبَلِ حِفْظِهِ",
        "id": "Telah menceritakan kepada kami [Abu Kuraib] telah menceritakan kepada kami [Risydin bin Sa'ad] dari [Zabban bin Faid] dari [Sahl bin Mu'adz bin Anas Al Juhani] dari [ayahnya] dia berkata, Rasulullah Shallahu 'alaihi wa sallam bersabda: \"Barangsiapa yang melangkahi pundak orang lain pda hari (khutbah) jum'at, maka ia telah mengambil jembatan menuju neraka Jahannam.\" (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Jabir. Abu Isa berkata, hadits Sahl bin Mu'adz bin Anas Al Juhani adalah hadits gharib, kami tidak mengetahuinya melainkan dari hadits Rasydin bin Sa'ad. Para ahli ilmu juga mengamalkan hadits ini bahwa mereka membenci seseorang yang melangkahi pundak orang lain pada hari (khutbah) jum'at, mereka sangat keras dalam masalah tersebut, dan sebagian ahli ilmu juga mengomentari (riwayat) Risydin bin Sa'ad, mereka melemahkan dari segi hafalannya."
    },
    {
        "number": 472,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ وَعَبَّاسُ بْنُ مُحَمَّدٍ الدُّورِيُّ قَالَا حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ الْمُقْرِئُ عَنْ سَعِيدِ بْنِ أَبِي أَيُّوبَ حَدَّثَنِي أَبُو مَرْحُومٍ عَنْ سَهْلِ بْنِ مُعَاذٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى عَنْ الْحِبْوَةَ يَوْمَ الْجُمُعَةِ وَالْإِمَامُ يَخْطُبُقَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ وَأَبُو مَرْحُومٍ اسْمُهُ عَبْدُ الرَّحِيمِ بْنُ مَيْمُونٍ وَقَدْ كَرِهَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ الْحِبْوَةَ يَوْمَ الْجُمُعَةِ وَالْإِمَامُ يَخْطُبُ وَرَخَّصَ فِي ذَلِكَ بَعْضُهُمْ مِنْهُمْ عَبْدُ اللَّهِ بْنُ عُمَرَ وَغَيْرُهُ وَبِهِ يَقُولُ أَحْمَدُ وَإِسْحَقُ لَا يَرَيَانِ بِالْحِبْوَةِ وَالْإِمَامُ يَخْطُبُ بَأْسًا",
        "id": "Telah menceritakan kepada kami [Muhammad bin Humaid Ar Razi] dan [Abbas bin Muhammad Ad Duri] keduanya berkata, telah menceritakan kepada kami [Abu Abdurrahman Al Muqri'] dari [Sa'id bin Abu Ayyub] telah menceritakan kepadaku [Abu Marhum] dari [Sahl bin Mu'adz] dari [ayahnya] bahwasannya Nabi Shallahu 'alaihi wa sallam melarang dari duduk ihba' (duduk dengan meletakkan kedua lutut didada) pada hari (khutbah) Jum'at, sewaktu imam berkhutbah. Abu Isa berkata, ini adalah hadits hasan, namanya Abu Marhum adalah 'Abdur Rahim bin Maimun, sebagian kaum dari ahli ilmu membenci duduk ihab' pada hari (khutbah) jum'at, sewaktu imam berkhutbah, dan sebagian yang lain memberi keringanan (rukhsah) dalam urusan itu, diantaranya adalah Abdullah bin Umar dan yang lain, Ahmad dan Ishaq berkata, bahwa keduanya tidak sependapat dengan duduk ihba' pada waktu imam sedang berkhutbah."
    },
    {
        "number": 473,
        "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا حُصَيْنٌ قَالَسَمِعْتُ عُمَارَةَ بْنَ رُوَيْبَةَ الثَّقَفِيَّ وَبِشْرُ بْنُ مَرْوَانَ يَخْطُبُ فَرَفَعَ يَدَيْهِ فِي الدُّعَاءِ فَقَالَ عُمَارَةُ قَبَّحَ اللَّهُ هَاتَيْنِ الْيُدَيَّتَيْنِ الْقُصَيَّرَتَيْنِ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَمَا يَزِيدُ عَلَى أَنْ يَقُولَ هَكَذَا وَأَشَارَ هُشَيْمٌ بِالسَّبَّابَةِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Hushain] dia berkata, saya mendengar [Umarah bin Ruwaibah At Tsaqafi] sedangkan Bisyr bin Marwan berkhutbah, lalu dia mengangkat kedua tangannya waktu berdo'a, maka Umarah berkata, semoga Allah menghinakan kedua tanganmu yang pendek, sungguh saya telah melihat Rasulullah Shallahu 'alaihi wa sallam, beliau tidak menambah dengan mengatakan seperti ini, lalu Husyaim mengisyaratkan dengan jari telunjuknya. Abu Isa berkata, ini adalah hadits hasan shahih."
    },
    {
        "number": 474,
        "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا حَمَّادُ بْنُ خَالِدٍ الْخَيَّاطُ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ الزُّهْرِيِّ عَنْ السَّائِبِ بْنِ يَزِيدَ قَالَكَانَ الْأَذَانُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ إِذَا خَرَجَ الْإِمَامُ وَإِذَا أُقِيمَتْ الصَّلَاةُ فَلَمَّا كَانَ عُثْمَانُ رَضِيَ اللَّهُ عَنْهُ زَادَ النِّدَاءَ الثَّالِثَ عَلَى الزَّوْرَاءِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Ahmad bin Mani'], telah menceritakan kepada kami [Hammad bin Khalid Al Khayyath] dari [Ibnu Abu Dzi'b] dari [Az Zuhri] dari [As Sa'ib bin Yazid] dia berkata, pada masa Rasulullah Shallahu 'alaihi wa sallam, Abu Bakar dan Umar adzan (dikumandangkan) yaitu ketika imam telah keluar (menuju masjid) dan iqamat telah ditegakkan. Akan tetapi Utsman menambah adzan ketiga diatas tempat yang jauh dari masjid. Abu Isa berkata, ini adalah hadits hasan shahih."
    },
    {
        "number": 475,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ عَنْ ثَابِتٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكَلَّمُ بِالْحَاجَةِ إِذَا نَزَلَ عَنْ الْمِنْبَرِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ جَرِيرِ بْنِ حَازِمٍ قَالَ و سَمِعْت مُحَمَّدًا يَقُولُ وَهِمَ جَرِيرُ بْنُ حَازِمٍ فِي هَذَا الْحَدِيثِ وَالصَّحِيحُ مَا رُوِيَ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَ أُقِيمَتْ الصَّلَاةُ فَأَخَذَ رَجُلٌ بِيَدِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَا زَالَ يُكَلِّمُهُ حَتَّى نَعَسَ بَعْضُ الْقَوْمِ قَالَ مُحَمَّدٌ وَالْحَدِيثُ هُوَ هَذَا وَجَرِيرُ بْنُ حَازِمٍ رُبَّمَا يَهِمُ فِي الشَّيْءِ وَهُوَ صَدُوقٌ قَالَ مُحَمَّدٌ وَهِمَ جَرِيرُ بْنُ حَازِمٍ فِي حَدِيثِ ثَابِتٍ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أُقِيمَتْ الصَّلَاةُ فَلَا تَقُومُوا حَتَّى تَرَوْنِي قَالَ مُحَمَّدٌ وَيُرْوَى عَنْ حَمَّادِ بْنِ زَيْدٍ قَالَ كُنَّا عِنْدَ ثَابِتٍ الْبُنَانِيِّ فَحَدَّثَ حَجَّاجٌ الصَّوَّافُ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا أُقِيمَتْ الصَّلَاةُ فَلَا تَقُومُوا حَتَّى تَرَوْنِي فَوَهِمَ جَرِيرٌ فَظَنَّ أَنَّ ثَابِتًا حَدَّثَهُمْ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Abu Daud At Thayalisi] telah menceritakan kepada kami [Jarir bin Hazim] dari [Tsabit] dari [Anas bin Malik] dia berkata, adalah Nabi Shallahu 'alaihi wa sallam mengemukakan hajatnya jika turun dari mimbar. Abu Isa berkata, kami tidak mengetahui hadits ini melainkan dari hadits (riwayat) Jarir bin Hazim, dia berkata, jarir bin Hazim ragu mengenai hadits ini, dan yang shahih adalah apa yang diriwayatkan dari Tsabit dari Anas dia berkata, shalat akan didirikan, tiba-tiba seorang laki-laki memegang tangan Nabi Shallahu 'alaihi wa sallam, terus saja laki-laki tersebut mengajak bicara beliau sampai sebagian kaum mengantuk. Muhammad berkata, bahwa yang dimaksud hadits diatas adalah hadits ini, sedangkan Jarir bin Hazim kemungkinan dia adalah suduk (dapat dipercaya) jika ia ragu terhadap sesuatu. Muhammad berkata, Jarir bin hazim ragu mengenai hadits (riwayat) Tsabit dari Anas dari Nabi Shallahu 'alaihi wa sallam beliau bersabda: \"Jika shalat telah ditegakkan, janganlah kalian berdiri sehingga kalian melihatku.\" Muhammad berkata, dan hadits ini juga diriwayatkan dari Hammad bin Ziyad, dia berkata, kami bersama Tsabit Al Banani, lalu Hajjaj As Shawaf menceritakan dari Yahya bin Abu Katsir dari Abdullah bin Abu Qatadah dari ayahnya dari Nabi Shallahu 'alaihi wa sallam beliau bersabda: \"Jika shalat telah didirikan maka janganlah kalian berdiri sehingga kalian melihatku.\" kemudian Jarir ragu, dia mengira bahwasannya Tsabit telah menceritakan kepada mereka dari Anas dari Nabi Shallahu 'alaihi wa sallam."
    },
    {
        "number": 476,
        "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلَّالُ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ ثَابِتٍ عَنْ أَنَسٍ قَالَلَقَدْ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعْدَ مَا تُقَامُ الصَّلَاةُ يُكَلِّمُهُ الرَّجُلُ يَقُومُ بَيْنَهُ وَبَيْنَ الْقِبْلَةِ فَمَا يَزَالُ يُكَلِّمُهُ فَلَقَدْ رَأَيْتُ بَعْضَنَا يَنْعَسُ مِنْ طُولِ قِيَامِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Al Hasan bin Ali Al Khallal] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Tsabit] dari [Anas] dia berkata, ketika shalat ditegakkan, saya melihat Nabi Shallahu 'alaihi wa sallam diajak bicara dengan seorang lelaki yang berdiri di antara beliau dan Qiblat, lelaki itu terus menerus berbicara dengan beliau, lantas saya melihat sebagian dari kami yang mengantuk karena saking lamanya Nabi Shallahu 'alaihi wa sallam berdiri dengannya. Abu Isa berkata hadits ini hasan shahih."
    },
    {
        "number": 477,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ مَوْلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَقَالَ اسْتَخْلَفَ مَرْوَانُ أَبَا هُرَيْرَةَ عَلَى الْمَدِينَةِ وَخَرَجَ إِلَى مَكَّةَ فَصَلَّى بِنَا أَبُو هُرَيْرَةَ يَوْمَ الْجُمُعَةِ فَقَرَأَ سُورَةَ الْجُمُعَةِ وَفِي السَّجْدَةِ الثَّانِيَةِ إِذَا جَاءَكَ الْمُنَافِقُونَ قَالَ عُبَيْدُ اللَّهِ فَأَدْرَكْتُ أَبَا هُرَيْرَةَ فَقُلْتُ لَهُ تَقْرَأُ بِسُورَتَيْنِ كَانَ عَلِيٌّ يَقْرَأُ بِهِمَا بِالْكُوفَةِ قَالَ أَبُو هُرَيْرَةَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ بِهِمَاقَالَ وَفِي الْبَاب عَنْ ابْنِ عَبَّاسٍ وَالنُّعْمَانِ بْنِ بَشِيرٍ وَأَبِي عِنَبَةَ الْخَوْلَانِيِّ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَرُوِي عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقْرَأُ فِي صَلَاةِ الْجُمُعَةِ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَهَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ عُبَيْدُ اللَّهِ بْنُ أَبِي رَافِعٍ كَاتِبُ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Hatim bin Isma'il] dari [Ja'far bin Muhammad] dari [bapaknya] dari ['Ubaidullah bin Abu Rafi'] budaknya Rasulullah Shallahu 'alaihi wa sallam dia berkata, Marwan mengangkat Abu Hurairah menjadi gubernur Madinah, dan dia keluar menuju Makkah maka Abu Hurairah shalat Jum'at bersama kami dan membaca surat Al Jumu'ah dan dalam sujud yang kedua dia membaca surat Idza ja'akal Munafiqun, 'Ubaidullah berkata, maka saya menemui Abu Hurairah lalu saya bertanya padanya, kamu membaca dua surat yang dibaca oleh Ali di Kufah?, [Abu Hurairah] menjawab, sesungguhnya saya telah mendengar Rasulullah Shallahu 'alaihi wa sallam membaca keduanya. (perawi) berkata, dan dalam bab ini (ada juga riwayat -pent) dari Ibnu Abbas, An Nu'man bin Basyir dan Abu 'Inabah Al Khqulani. Abu Isa berkata, hadits Abu Hurairah adalah hadits hasan shahih, dan telah diriwayatkan dari Nabi Shallahu 'alaihi wa sallam bahwa beliau membaca dalam shalat Jum'at dengan SABBIHISMA RABBIKAL 'A'LA dan HAL ATAAKA HADIITSUL GHAASYIYAH. 'Ubaidullah bin Abu Rafi' adalah sekretarisnya Ali bin Abu Thalib radliallahu 'anhu."
    },
    {
        "number": 478,
        "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ أَخْبَرَنَا شَرِيكٌ عَنْ مُخَوَّلِ بْنِ رَاشِدٍ عَنْ مُسْلِمٍ الْبَطِينِ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنْ ابْنِ عَبَّاسٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ يَوْمَ الْجُمُعَةِ فِي صَلَاةِ الْفَجْرِ الم تَنْزِيلُ السَّجْدَةَ وَهَلْ أَتَى عَلَى الْإِنْسَانِقَالَ وَفِي الْبَاب عَنْ سَعْدٍ وَابْنِ مَسْعُودٍ وَأَبِي هُرَيْرَةَ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رَوَاهُ سُفْيَانُ الثَّوْرِيُّ وَشُعْبَةُ وَغَيْرُ وَاحِدٍ عَنْ مُخَوَّلٍ",
        "id": "Telah menceritakan kepada kami [Ali bin Hujr] telah mengabarkan kepada kami [Syarik] dari [Mukhawwal bin Rasyid] dari [Muslim Al Bathin] dari [Sa'id bin Jubair] dari [Ibnu Abbas] dia berkata, Rasulullah Shallahu 'alaihi wa sallam shalat fajar pada hari Jum'at dengan membaca \"ALIF LAM MIM TANZIILU.... dalam surat As Sajdah, dan HAL ATAA 'ALAL INSAN.\" (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Sa'd, Ibnu Mas'ud dan Abu Hurairah. Abu Isa berkata, hadits Ibnu Abbas adalah hadits hasan shahih dan telah diriwayatkan pula oleh [Sufyan Ats Tsauri] dan [Syu'bah] dan yang lainnya dari [Mukhawwal]."
    },
    {
        "number": 479,
        "arab": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِقَالَ وَفِي الْبَاب عَنْ جَابِرٍ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَيْضًا وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَبِهِ يَقُولُ الشَّافِعِيُّ وَأَحْمَدُ",
        "id": "Telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Amru bin Dinar] dari [Az Zuhri] dari [Salim] dari [ayahnya] dari Nabi Shallahu 'alaihi wa sallam bahwa beliau mengerjakan shalat dua raka'at setelah shalat jum'at. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Jabir. Abu Isa berkata, hadits Ibnu Umar adalah hasan shahih, telah diriwayatkan dari [Nafi'] dari [Ibnu Umar] juga, hadits ini juga diamalkan oleh sebagian ahli ilmu, dengannya pula Syafi'i dan Ahmad berkata."
    },
    {
        "number": 480,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّهُ كَانَ إِذَا صَلَّى الْجُمُعَةَ انْصَرَفَ فَصَلَّى سَجْدَتَيْنِ فِي بَيْتِهِ ثُمَّ قَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَصْنَعُ ذَلِكَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits] dari [Nafi'] dari [Ibnu Umar] bahwa apabila (selesai mengerjakan) shalat Jum'at, dia beranjak untuk melaksanakan shalat dua raka'at dirumahnya, kemudian dia berkata, adalah Rasulullah Shallahu 'alaihi wa sallam melakukan hal itu. Abu Isa berkata, ini adalah hadits hasan shahih."
    },
    {
        "number": 481,
        "arab": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ مِنْكُمْ مُصَلِّيًا بَعْدَ الْجُمُعَةِ فَلْيُصَلِّ أَرْبَعًاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ حَدَّثَنَا عَلِيُّ بْنُ الْمَدِينِيِّ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ قَالَ كُنَّا نَعُدُّ سُهَيْلَ بْنَ أَبِي صَالِحٍ ثَبْتًا فِي الْحَدِيثِ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ وَرُوِي عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ أَنَّهُ كَانَ يُصَلِّي قَبْلَ الْجُمُعَةِ أَرْبَعًا وَبَعْدَهَا أَرْبَعًا وَقَدْ رُوِيَ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ أَنَّهُ أَمَرَ أَنْ يُصَلَّى بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ ثُمَّ أَرْبَعًا وَذَهَبَ سُفْيَانُ الثَّوْرِيُّ وَابْنُ الْمُبَارَكِ إِلَى قَوْلِ ابْنِ مَسْعُودٍ و قَالَ إِسْحَقُ إِنْ صَلَّى فِي الْمَسْجِدِ يَوْمَ الْجُمُعَةِ صَلَّى أَرْبَعًا وَإِنْ صَلَّى فِي بَيْتِهِ صَلَّى رَكْعَتَيْنِ وَاحْتَجَّ بِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ فِي بَيْتِهِ وَحَدِيثُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ كَانَ مِنْكُمْ مُصَلِّيًا بَعْدَ الْجُمُعَةِ فَلْيُصَلِّ أَرْبَعًا قَالَ أَبُو عِيسَى وَابْنُ عُمَرَ هُوَ الَّذِي رَوَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يُصَلِّي بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ فِي بَيْتِهِ وَابْنُ عُمَرَ بَعْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى فِي الْمَسْجِدِ بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ وَصَلَّى بَعْدَ الرَّكْعَتَيْنِ أَرْبَعًا حَدَّثَنَا بِذَلِكَ ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ ابْنِ جُرَيْجٍ عَنْ عَطَاءٍ قَالَ رَأَيْتُ ابْنَ عُمَرَ صَلَّى بَعْدَ الْجُمُعَةِ رَكْعَتَيْنِ ثُمَّ صَلَّى بَعْدَ ذَلِكَ أَرْبَعًا حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ عَمْرِو بْنِ دِينَارٍ قَالَ مَا رَأَيْتُ أَحَدًا أَنَصَّ لِلْحَدِيثِ مِنْ الزُّهْرِيِّ وَمَا رَأَيْتُ أَحَدًا الدَّنَانِيرُ وَالدَّرَاهِمُ أَهْوَنُ عَلَيْهِ مِنْهُ إِنْ كَانَتْ الدَّنَانِيرُ وَالدَّرَاهِمُ عِنْدَهُ بِمَنْزِلَةِ الْبَعْرِ قَالَ أَبُو عِيسَى سَمِعْت ابْنَ أَبِي عُمَرَ قَال سَمِعْتُ سُفْيَانَ بْنَ عُيَيْنَةَ يَقُولُ كَانَ عَمْرُو بْنُ دِينَارٍ أَسَنَّ مِنْ الزُّهْرِيِّ",
        "id": "Telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan] dari [Suhail bin Abu Shalih] dari [ayahnya] dari [Abu Hurairah] dia berkata, Rasulullah Shallahu 'alaihi wa sallam bersabda: \"Barang siapa diantara kalian yang shalat setelah shalat Jum'at hendaknya ia shalat empat raka'at.\" Abu Isa berkata, ini adalah hadits hasan shahih. Telah menceritakan kepada kami Hasan bin Ali telah menceritakan kepada kami Ali bin Madini dari Sufyan bin 'Uyainah dia berkata, kami menganggap bahwa Suhail bin Shalih adalah tsabat dalam hadits, hadits ini juga diamalkan oleh sebagian para ulama. Diriwayatkan dari Abdullah bin Mas'ud bahwa dia shalat empat raka'at sebelum dan setela shalat jum'at sebanyak empat raka'at, dan telah diriwayatkan dari Ali bin Abu Thalib radliallahu 'anhu bahwa dia memerintahkan untuk shalat dua raka'at setelah shalat jum'at, kemudian empat raka'at, sedangkan Sufyan At Tsauri, Ibnu Mubarak berpendapat sebagaiaman perkataannya Ibnu Mas'ud. Ishaq berkata, jika pada hari Jum'at dia shalat dimasjid, maka ia shalat empat raka'at, jika ia shalat dirumahnya, maka ia shalat dua raka'at, dia berhujah bahwa Nabi Shallahu 'alaihi wa sallam shalat dua raka'at dirumahnya setelah shalat jum'at, sedangkan hadits Nabi Shallahu 'alaihi wa sallam: \"Barang siapa diantara kalian yang shalat setelah shalat Jum'at hendaknya ia shalat empat raka'at.\" Abu Isa berkata, bahwa Ibnu Umar meriwayatkan dari Nabi Shallahu 'alaihi wa sallam bahwa beliau shalat dua raka'at dirumahnya setelah shalat jum'at, dan Ibnu Umar setelah Nabi Shallahu 'alaihi wa sallam selesai melaksanakan shalat dua raka'at dimasjid, beliau shalat empat raka'at. Telah menceritakan kepada kami Ibnu Abu Umar seperti itu, telah menceritakan kepada kami Sufyan bin 'Uyainah dari Ibnu Juraij dari Atha' dia berkata, saya melihat Ibnu Umar mengerjakan shalat dua raka'at setelah shalat Jum'at, setelah itu dia shalat empat raka'at. Telah menceritakan kepada kami Sa'id bin Abdurrahman Al Mahzumi, telah menceritakan kepada kami Sufyan bin 'Uyainah dari Amru bin Dinar dia berkata, saya tidak pernah melihat seseorang yang sanggup menashkan hadits selain Az Zuhri, dan saya tidak pernah melihat seseorang yang menganggap remeh (hina) dianr dan dirham selain dia, bahwa dinar dan dinar menurutnya tak ubahnya seperti keledai. Abu Isa berkata, saya pernah mendengar Ibnu Abu Umar berkata, saya mendengar Sufyan bin 'Uyainah berkata, adalah Amru bin Dinar lebih tua dari Az Zuhri."
    },
    {
        "number": 482,
        "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ وَسَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مَنْ أَدْرَكَ مِنْ الصَّلَاةِ رَكْعَةً فَقَدْ أَدْرَكَ الصَّلَاةَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ قَالُوا مَنْ أَدْرَكَ رَكْعَةً مِنْ الْجُمُعَةِ صَلَّى إِلَيْهَا أُخْرَى وَمَنْ أَدْرَكَهُمْ جُلُوسًا صَلَّى أَرْبَعًا وَبِهِ يَقُولُ سُفْيَانُ الثَّوْرِيُّ وَابْنُ الْمُبَارَكِ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَقُ",
        "id": "Telah menceritakan kepada kami [Nashr bin Ali] dan [Sa'id bin Abdurrahman] serta yang lainnya, mereka berkata, telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari [Abu Salamah] dari [Abu Hurairah] dari Nabi Shallahu 'alaihi wa sallam bahwa beliau bersabda: \"Barangsiapa yang mendapatkan satu raka'at dalam shalat (ruku'), maka dia mendapatkan (raka'at) shalat.\" Abu Isa berkata, ini adalah hadits hasan shahih, dan diamalkan oleh kebanyakan ahli ilmu dari kalangan sahabat Nabi Shallahu 'alaihi wa sallam dan yang lainnya, mereka berkata, barangsiapa yang mendapatkan ruku' dalam shalat Jum'at maka dia harus menambah raka'at lain lagi, dan barangsiapa yang mendapatkan mereka sedang duduk, maka dia harus melaksanakan shalat empat raka'at, ini adalah pendapat Sufyan Ats Tsauri, Ibnu Al Mubarak, As Syafi'i, Ahmad dan Ishaq."
    },
    {
        "number": 483,
        "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ وَعَبْدُ اللَّهِ بْنُ جَعْفَرٍ عَنْ أَبِي حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ رَضِيَ اللَّهُ عَنْهُ قَالَمَا كُنَّا نَتَغَذَّى فِي عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَا نَقِيلُ إِلَّا بَعْدَ الْجُمُعَةِقَالَ وَفِي الْبَاب عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللَّهُ عَنْهُ قَالَ أَبُو عِيسَى حَدِيثُ سَهْلِ بْنِ سَعْدٍ حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Ali bin Hujr] telah menceritakan kepada kami ['Abdul Aziz bin Abu Hazim] dan [Abdullah bin Ja'far] dari [Abu Hazim] dari [Sahl bin Sa'ad radliallahu 'anhu] dia berkata, bahwa kami tidak makan siang dan tidak Qailulah (tidur sebelum Dzuhur) pada masa Rasulullah Shallahu 'alaihi wa sallam kecuali setelah shalat Jum'at. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Anas bin Malik radliallahu 'anhu. Abu Isa berkata, hadits Sahl Bin Sa'ad adalah hadits hasan shahih."
    },
    {
        "number": 484,
        "arab": "حَدَّثَنَا أَبُو سَعِيدٍ الْأَشَجُّ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ وَأَبُو خَالِدٍ الْأَحْمَرُ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا نَعَسَ أَحَدُكُمْ يَوْمَ الْجُمُعَةِ فَلْيَتَحَوَّلْ مِنْ مَجْلِسِهِ ذَلِكَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Abu Sa'id Al Asyajj] telah menceritakan kepada kami ['Abdah bin Sulaiman] dan [Abu Khalid Al Ahmar] dari [Muhammad bin Ishaq] dari [Nafi'] dari [Ibnu Umar] dari Nabi Shallahu 'alaihi wa sallam beliau bersabda: \"Jika salah seorang kalian mengantuk pada hari Jum'at (pada saat khutbah Jum'at), hendaknya ia pindah dari tempat duduknya.\" Abu Isa berkata, ini adalah hadits hasan shahih."
    },
    {
        "number": 485,
        "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْحَجَّاجِ عَنْ الْحَكَمِ عَنْ مِقْسَمٍ عَنْ ابْنِ عَبَّاسٍ قَالَبَعَثَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَبْدَ اللَّهِ بْنَ رَوَاحَةَ فِي سَرِيَّةٍ فَوَافَقَ ذَلِكَ يَوْمَ الْجُمُعَةِ فَغَدَا أَصْحَابُهُ فَقَالَ أَتَخَلَّفُ فَأُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ أَلْحَقُهُمْ فَلَمَّا صَلَّى مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَآهُ فَقَالَ مَا مَنَعَكَ أَنْ تَغْدُوَ مَعَ أَصْحَابِكَ فَقَالَ أَرَدْتُ أَنْ أُصَلِّيَ مَعَكَ ثُمَّ أَلْحَقَهُمْ قَالَ لَوْ أَنْفَقْتَ مَا فِي الْأَرْضِ جَمِيعًا مَا أَدْرَكْتَ فَضْلَ غَدْوَتِهِمْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ قَالَ عَلِيُّ بْنُ الْمَدِينِيِّ قَالَ يَحْيَى بْنُ سَعِيدٍ وَقَالَ شُعْبَةُ لَمْ يَسْمَعْ الْحَكَمُ مِنْ مِقْسَمٍ إِلَّا خَمْسَةَ أَحَادِيثَ وَعَدَّهَا شُعْبَةُ وَلَيْسَ هَذَا الْحَدِيثُ فِيمَا عَدَّ شُعْبَةُ فَكَأَنَّ هَذَا الْحَدِيثَ لَمْ يَسْمَعْهُ الْحَكَمُ مِنْ مِقْسَمٍ وَقَدْ اخْتَلَفَ أَهْلُ الْعِلْمِ فِي السَّفَرِ يَوْمَ الْجُمُعَةِ فَلَمْ يَرَ بَعْضُهُمْ بَأْسًا بِأَنْ يَخْرُجَ يَوْمَ الْجُمُعَةِ فِي السَّفَرِ مَا لَمْ تَحْضُرْ الصَّلَاةُ و قَالَ بَعْضُهُمْ إِذَا أَصْبَحَ فَلَا يَخْرُجْ حَتَّى يُصَلِّيَ الْجُمُعَةَ",
        "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Abu Mu'awiyah] dari [Hajjaj] dari [Al Hakam] dari [Miqsam] dari [Ibnu Abbas] dia berkata, Nabi Shallahu 'alaihi wa sallam mengutus Abdullah bin Rawahah dalam sebuah ekspedisi, pada saat itu bertepatan dengan hari Juma'at, kemudian sahabat-sahabatnya telah berangkat dipagi hari, lalu dia berkata, saya akan menunda keberangkatan sehingga saya bisa shalat (jum'at) bersama Rasulullah Shallahu 'alaihi wa sallam kemudian saya akan menyusul mereka, tatkala dia shalat bersama Rasulullah Shallahu 'alaihi wa sallam, beliau melihatnya, maka beliau bersabda: \"Apa yang mencegahmu untuk tidak berangkat bersama dengan para sahabatmu?\" dia menjawab, saya ingin shalat bersamamu, lalu saya akan menyusul mereka (setelah shalat). Lantas beliau bersabda: \"Sekiranya kamu menginfakkan semua yang ada dibumi, kamu tidak akan dapat menyamai keutamaan mereka berangkat dipagi hari.\" Abu Isa berkata, ini adalah hadits gharib, kami tidak mengetahuinya selain jalur ini. Ali bin Madini berkata, berkata Yahya bin Sa'id. Dan Syu'bah juga berkata, Al Hakam belum pernah mendengar dari Miqsam kecuali hanya lima haidts, kemudian Syu'bah menghitungnya (hadits yang dihafal oleh Al Hakam dari Miqsam), sedangkan hadits ini tidak termasuk yang dihitung oleh Syu'bah, maka sepertinya Al Hakam tidak mendengar hadits ini dari Miqsam. Para ahli ilmu juga berbeda pendapat mengenai safar pada hari Jum'at, bahkan sebagian mereka tidak berpendapat akan bolehnya keluar (untuk safar) pada hari Jum'at dan tidak ikut menghadiri shalat Jum'at. Sebagian yang lain berkata, jika dia berada di pagi harinya, hendaknya dia tidak keluar (untuk safar) sampai dia melaksanakan shalat Jum'at."
    },
    {
        "number": 486,
        "arab": "حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ الْكُوفِيُّ حَدَّثَنَا أَبُو يَحْيَى إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَقٌّ عَلَى الْمُسْلِمِينَ أَنْ يَغْتَسِلُوا يَوْمَ الْجُمُعَةِ وَلْيَمَسَّ أَحَدُهُمْ مِنْ طِيبِ أَهْلِهِ فَإِنْ لَمْ يَجِدْ فَالْمَاءُ لَهُ طِيبٌقَالَ وَفِي الْبَاب عَنْ أَبِي سَعِيدٍ وَشَيْخٍ مِنْ الْأَنْصَارِ حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا هُشَيْمٌ عَنْ يَزِيدَ بْنِ أَبِي زِيَادٍ بِهَذَا الْإِسْنَادِ نَحْوَهُ قَالَ أَبُو عِيسَى حَدِيثُ الْبَرَاءِ حَدِيثٌ حَسَنٌ وَرِوَايَةُ هُشَيْمٍ أَحْسَنُ مِنْ رِوَايَةِ إِسْمَعِيلَ بْنِ إِبْرَاهِيمَ التَّيْمِيِّ وَإِسْمَعِيلُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ يُضَعَّفُ فِي الْحَدِيثِ",
        "id": "Telah menceritakan kepada kami [Ali bin Al Hasan Al Kufi] telah menceritakan kepada kami [Abu Yahya Isma'il bin Ibrahim At Taimi] dari [Yazid bin Abu Ziyad] dari [Abdurrahman bin Abu Laila] dari [Barra' bin 'Azib] dia berkata, Rasulullah Shallahu 'alaihi wa sallam bersabda: \"Benar bagi seorang Muslim untuk mandi di hari Jum'at dan memakai wewangian keluarganya, jika ia tidak mendapatinya maka cukuplah dengan menggunakan air.\" (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Abu Sa'id dan seorang syaikh dari Anshar. Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Husyaim] dari [Yazid bin Abu Ziyad] dengan isnad seperti ini. Abu Isa berkata, hadits Barra' adalah hadits hasan, sedangkan riwayatnya Husyaim lebih baik daripada riwayatnya Isma'il bin Ibrahim At Taimi, karena Isma'il bin Ibrahim At Taimi didla'ifkan dalam (meriwayatkan) hadits."
    },
    {
        "number": 487,
        "arab": "حَدَّثَنَا إِسْمَعِيلُ بْنُ مُوسَى الْفَزَارِيُّ حَدَّثَنَا شَرِيكٌ عَنْ أَبِي إِسْحَقَ عَنْ الْحَارِثِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ قَالَمِنْ السُّنَّةِ أَنْ تَخْرُجَ إِلَى الْعِيدِ مَاشِيًا وَأَنْ تَأْكُلَ شَيْئًا قَبْلَ أَنْ تَخْرُجَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ يَسْتَحِبُّونَ أَنْ يَخْرُجَ الرَّجُلُ إِلَى الْعِيدِ مَاشِيًا وَأَنْ يَأْكُلَ شَيْئًا قَبْلَ أَنْ يَخْرُجَ لِصَلَاةِ الْفِطْرِ قَالَ أَبُو عِيسَى وَيُسْتَحَبُّ أَنْ لَا يَرْكَبَ إِلَّا مِنْ عُذْرٍ",
        "id": "Telah menceritakan kepada kami [Isma'il bin Musa Al Fazari] telah menceritakan kepada kami [Syarik] dari [Abu Ishaq] dari [Al Harits] dari [Ali bin Abu Thalib] dia berkata, menurut sunnah, hendaknya kamu keluar untuk shalat Ied dengan berjalan kaki, dan memakan sesuatu sebelum keluar rumah. Abu Isa berkata, hadits ini hasan, dan diamalkan oleh kebanyakan para ahli ilmu bahwa mereka menyukai seseorang keluar menuju shalat Ied dengan berjalan kaki, dan makan sesuatu sebelum keluar untuk shalat Iedul Fitri. Abu Isa berkata, dan disukai juga hendaknya tidak berkendaradliallahu 'anhan kecuali karena udzur."
    },
    {
        "number": 488,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا أَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ هُوَ ابْنُ عُمَرَ بْنِ حَفْصِ بْنِ عَاصِمِ بْنِ عُمَرَ بْنِ الْخَطَّابِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ وَعُمَرُ يُصَلُّونَ فِي الْعِيدَيْنِ قَبْلَ الْخُطْبَةِ ثُمَّ يَخْطُبُونَقَالَ وَفِي الْبَاب عَنْ جَابِرٍ وَابْنِ عَبَّاسٍ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ أَنَّ صَلَاةَ الْعِيدَيْنِ قَبْلَ الْخُطْبَةِ وَيُقَالُ إِنَّ أَوَّلَ مَنْ خَطَبَ قَبْلَ الصَّلَاةِ مَرْوَانُ بْنُ الْحَكَمِ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Abu Usamah] dari ['Ubaidullah yaitu Ibnu Umar bin Hafs bin 'Ashim bin Umar bin Al Khaththab] dari [Nafi'] dari [Ibnu Umar] dia berkata, Rasulullah Shallahu 'alaihi wa sallam, Abu Bakar dan Umar, mereka melaksanakan shalat Iedain (Iedul fitri dan Iedul Adlha) sebelum berkhutbah, kemudian mereka berkhutbah. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Jabir dan Ibnu Abbas. Abu Isa berkata, hadits Ibnu Umar adalah hadits hasan shahih, hadits ini diamalkan oleh para ahli ilmu dari kalangan sahabat Nabi Shallahu 'alaihi wa sallam dan yang lainnya bahwa shalat Iedain (Iedul Fitri dan Iedul Adlha) dilaksanakan sebelum khutbah, dikatakan bahwa orang yang pertama kali melakukan khutbah sebelum shalat adalah Marwan bin Al Hakam."
    },
    {
        "number": 489,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَصَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْعِيدَيْنِ غَيْرَ مَرَّةٍ وَلَا مَرَّتَيْنِ بِغَيْرِ أَذَانٍ وَلَا إِقَامَةٍقَالَ وَفِي الْبَاب عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ وَابْنِ عَبَّاسٍ قَالَ أَبُو عِيسَى وَحَدِيثُ جَابِرِ بْنِ سَمُرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَيْهِ عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ أَنَّهُ لَا يُؤَذَّنُ لِصَلَاةِ الْعِيدَيْنِ وَلَا لِشَيْءٍ مِنْ النَّوَافِلِ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abu Al Ahwash] dari [Simak bin Harb] dari [Jabir bin Samrah] dia berkata, saya shalat dua hari raya bersama Nabi Shallahu 'alaihi wa sallam tidak cuma sekali atau dua kali tanpa diawali dengan adzan dan juga iqamat. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Jabir bin Abdullah dan Ibnu Abbas. Abu Isa berkata, hadits Jabir bin Samrah adalah hadits hasan shahih, para ahli ilmu dari kalanagn sahabat Nabi Shallahu 'alaihi wa sallam dan yang lainnya juga mengamalkan hadits ini bahwasannya tidak ada adzan dalam shalat dua hari raya dan tidak pula untuk shalat-shalat sunnah."
    },
    {
        "number": 490,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ عَنْ أَبِيهِ عَنْ حَبِيبِ بْنِ سَالِمٍ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ فِي الْعِيدَيْنِ وَفِي الْجُمُعَةِ بِسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى وَهَلْ أَتَاكَ حَدِيثُ الْغَاشِيَةِ وَرُبَّمَا اجْتَمَعَا فِي يَوْمٍ وَاحِدٍ فَيَقْرَأُ بِهِمَاقَالَ وَفِي الْبَاب عَنْ أَبِي وَاقِدٍ وَسَمُرَةَ بْنِ جُنْدَبٍ وَابْنِ عَبَّاسٍ قَالَ أَبُو عِيسَى حَدِيثُ النُّعْمَانِ بْنِ بَشِيرٍ حَدِيثٌ حَسَنٌ صَحِيحٌ وَهَكَذَا رَوَى سُفْيَانُ الثَّوْرِيُّ وَمِسْعَرٌ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ نَحْوَ حَدِيثِ أَبِي عَوَانَةَ وَأَمَّا سُفْيَانُ بْنُ عُيَيْنَةَ فَيُخْتَلَفُ عَلَيْهِ فِي الرِّوَايَةِ يُرْوَى عَنْهُ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ عَنْ أَبِيهِ عَنْ حَبِيبِ بْنِ سَالِمٍ عَنْ أَبِيهِ عَنْ النُّعْمَانِ بْنِ بَشِيرٍ وَلَا نَعْرِفُ لِحَبِيبِ بْنِ سَالِمٍ رِوَايَةً عَنْ أَبِيهِ وَحَبِيبُ بْنُ سَالِمٍ هُوَ مَوْلَى النُّعْمَانِ بْنِ بَشِيرٍ وَرَوَى عَنْ النُّعْمَانِ بْنِ بَشِيرٍ أَحَادِيثَ وَقَدْ رُوِيَ عَنْ ابْنِ عُيَيْنَةَ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدِ بْنِ الْمُنْتَشِرِ نَحْوُ رِوَايَةِ هَؤُلَاءِ وَرُوِي عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقْرَأُ فِي صَلَاةِ الْعِيدَيْنِ بِقَافٍ وَاقْتَرَبَتْ السَّاعَةُ وَبِهِ يَقُولُ الشَّافِعِيُّ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abu 'Awanah] dari [Ibrahim bin Muhammad bin Al Muntasyir] dari [ayahnya] dari [Habib bin Salim] dari [An Nu'man bin Basyir] dia berkata, Nabi Shallahu 'alaihi wa sallam membaca SABBIHISMA RABBIKA dan HAL ATAAKA HADIITSUL GHAATSIAH pada waktu shalat iedain (dua hari raya) dan shalat Jum'at, jika keduanya terjadi disatu hari, maka belaiu membaca keduanya. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Abu Wqaqid, Samrah bin Jundab dan Ibnu Abbas. Abu Isa berkata, hadits Nu'man bin Basyir adalah hadits hasan shahih. demikian pula [Sufyan Ats Tsauri] dan [Mis'ar] meriwayatkan dari [Ibrahim bin Muhammad bin Al Muntasyir] seperti hadits yang diriwayatkan Abu 'Awanah. Sedangkan riwayat Sufyan bin 'Uyainah mengenai hal ini masih diperselisihkan, yaitu diriwayatkan dari Ibrahim bin Muhammad bin Al Muntasyir dari ayahnya dari Habib bin Salim dari ayahnya dari Nu'man bin Basyir, akan tetapi kami tidak mengetahui Habib bin Salim memiliki riwayat dari ayahnya. Habib bin Salim adalah budak Nu'man bin Basyir yang banyak meriwayatkan dari Nu'man bin Basyir. Dan diriwayatkan dari [Ibnu Uyainah] dari [Ibrahim bin Muhammad bin Al Muntasyir] seperti riwayat mereka. Diriwayatkan pula dari Nabi shalallahu 'alaihi wa salam bahwa dalam shalat iedain (dua hari raya) beliau membaca surat QAF dan IQTARABATIS SAA'AH. Syafi'i juga berpendapat seperti ini."
    },
    {
        "number": 491,
        "arab": "حَدَّثَنَا إِسْحَقُ بْنُ مُوسَى الْأَنْصَارِيُّ حَدَّثَنَا مَعْنُ بْنُ عِيسَى حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ عَنْ ضَمْرَةَ بْنِ سَعِيدٍ الْمَازِنِيِّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَأَنَّ عُمَرَ بْنَ الْخَطَّابِ سَأَلَ أَبَا وَاقِدٍ اللَّيْثِيَّ مَا كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرَأُ بِهِ فِي الْفِطْرِ وَالْأَضْحَى قَالَ كَانَ يَقْرَأُ بِق وَالْقُرْآنِ الْمَجِيدِ وَاقْتَرَبَتْ السَّاعَةُ وَانْشَقَّ الْقَمَرُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ حَدَّثَنَا هَنَّادٌ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ ضَمْرَةَ بْنِ سَعِيدٍ بِهَذَا الْإِسْنَادِ نَحْوَهُ قَالَ أَبُو عِيسَى وَأَبُو وَاقِدٍ اللَّيْثِيُّ اسْمُهُ الْحَارِثُ بْنُ عَوْفٍ",
        "id": "Telah menceritakan kepada kami [Ishaq bin Musa Al Anshari] telah menceritakan kepada kami [Ma'an bin Isa] telah menceritakan kepada kami [Malik bin Anas] dari [Dlamrah bin Sa'id Al Mazini] dari ['Ubaidillah bin Abdullah bin 'Utbah] bahwa Umar bin Al Khaththab bertanya kepada [Abu Waqid Al Laitsi], apakah Rasulullah Shallahu 'alaihi wa sallam membaca surat waktu (shalat) idul fitri dan idul adlha? Dia menjawab, beliau membaca QAAF WAL QUR'ANIL MAJIID dan IQTARABITIS SAA'AH WAN SYAQQAL QAMAR. Abu Isa berkata, ini adalah hadits hasan shahih, telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Dlamrah bin Sa'id] dengan isnad yang seperti ini, Abu Isa berkata, Abu Waqid Al Laitsi namanya adalah Al Harits bin 'Auf."
    },
    {
        "number": 492,
        "arab": "حَدَّثَنَا مُسْلِمُ بْنُ عَمْرٍو أَبُو عَمْرٍو الْحَذَّاءُ الْمَدِينِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نَافِعٍ الصَّائِغُ عَنْ كَثِيرِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ جَدِّهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَبَّرَ فِي الْعِيدَيْنِ فِي الْأُولَى سَبْعًا قَبْلَ الْقِرَاءَةِ وَفِي الْآخِرَةِ خَمْسًا قَبْلَ الْقِرَاءَةِقَالَ وَفِي الْبَاب عَنْ عَائِشَةَ وَابْنِ عُمَرَ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ أَبُو عِيسَى حَدِيثُ جَدِّ كَثِيرٍ حَدِيثٌ حَسَنٌ وَهُوَ أَحْسَنُ شَيْءٍ رُوِيَ فِي هَذَا الْبَابِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاسْمُهُ عَمْرُو بْنُ عَوْفٍ الْمُزَنِيُّ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ وَهَكَذَا رُوِيَ عَنْ أَبِي هُرَيْرَةَ أَنَّهُ صَلَّى بِالْمَدِينَةِ نَحْوَ هَذِهِ الصَّلَاةِ وَهُوَ قَوْلُ أَهْلِ الْمَدِينَةِ وَبِهِ يَقُولُ مَالِكُ بْنُ أَنَسٍ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَقُ وَرُوِي عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ أَنَّهُ قَالَ فِي التَّكْبِيرِ فِي الْعِيدَيْنِ تِسْعَ تَكْبِيرَاتٍ فِي الرَّكْعَةِ الْأُولَى خَمْسًا قَبْلَ الْقِرَاءَةِ وَفِي الرَّكْعَةِ الثَّانِيَةِ يَبْدَأُ بِالْقِرَاءَةِ ثُمَّ يُكَبِّرُ أَرْبَعًا مَعَ تَكْبِيرَةِ الرُّكُوعِ وَقَدْ رُوِيَ عَنْ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوُ هَذَا وَهُوَ قَوْلُ أَهْلِ الْكُوفَةِ وَبِهِ يَقُولُ سُفْيَانُ الثَّوْرِيُّ",
        "id": "Telah menceritakan kepada kami [Muslim bin Amru Abu Amru Al Hadzdza' Al Madini] telah menceritakan kepada kami [Abdullah bin Nafi' Ash Sha'igh] dari [Katsir bin Abdullah] dari [ayahnya] dari [kakeknya] bahwa Nabi Shallahu 'alaihi wa sallam bertakbir dalam dua shalat Ied, pada raka'at pertama tujuh kali sebelum membaca ayat dan pada raka'at kedua lima kali sebelum membaca ayat. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari A'isyah, Ibnu Umar dan Abdullah bin Amru. Abu Isa berkata, hadits kakeknya Katsir adalah hadits hasan dan ini adalah hadits yang paling baik yang diriwayatkan dalam bab ini dari Nabi Shallahu 'alaihi wa sallam, adapun nama lengkapnya adalah Amru bin 'Auf Al Muzani, hadits ini diamalkan oleh sebagian ahli ilmu dari kalangan sahabat Nabi Shallahu 'alaihi wa sallam dan yang lainnya, demikianlah yang diriwayatkan dari Abu Hurairah bahwa dia shalat di Madinah seperti shalat ini, ini adalah pendapat penduduk Madinah, dan juga pandapat Malik bin Anas, Syafi'i, Ahmad dan Ishaq, telah diriwayatkan dari 'Abdulloh bin Mas'ud bahwa dia berkata tentang takbir dalam dua shalat Ied, sembilan kali takbir, pada raka'at pertama lima kali sebelum membaca ayat dan pada raka'at kedua dimulai dengan membaca ayat lalu takbir empat kali bersama dengan ruku'. Telah diriwayatkan dari banyak sahabat Nabi Shallahu 'alaihi wa sallam hadits yang semakna dengan ini dan ini adalah pendapat penduduk Kufah dan juga Sufyan Ats Tsauri."
    },
    {
        "number": 493,
        "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ عَدِيِّ بْنِ ثَابِتٍ قَال سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ يُحَدِّثُ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ يَوْمَ الْفِطْرِ فَصَلَّى رَكْعَتَيْنِ ثُمَّ لَمْ يُصَلِّ قَبْلَهَا وَلَا بَعْدَهَاقَالَ وَفِي الْبَاب عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَأَبِي سَعِيدٍ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَيْهِ عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ وَبِهِ يَقُولُ الشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَقُ وَقَدْ رَأَى طَائِفَةٌ مِنْ أَهْلِ الْعِلْمِ الصَّلَاةَ بَعْدَ صَلَاةِ الْعِيدَيْنِ وَقَبْلَهَا مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ وَالْقَوْلُ الْأَوَّلُ أَصَحُّ",
        "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Daud At Thayalisi] dia berkata, telah memberitakan kepada kami [Syu'bah] dari ['Adi bin Tsabit] saya telah mendengar [Sa'id bin Jubair] menceritakan dari [Ibnu Abbas] bahwasannya Nabi shallallahu 'alaihi wasallam keluar (menuju tempat shalat) pada hari raya iedul fitri, kemudian beliau shalat dua raka'at, beliau tidak mengerjakan shalat baik sebelum atau sesuadahnya. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Abdullah bin Amru dan Abu sa'id. Abu Isa berkata, hadits Ibnu Abbas adalah hadits hasan shahih dan diamalkan oleh sebagian para ulama dari kalangan sahabat Nabi Shallahu 'alaihi wa sallam dan yang lainnya, dengannya pula Syafi'i, Ahmad dan Ishaq berkata. Sebagian kelompok para ulama dari kalangan sahabat Nabi Shallahu 'alaihi wa sallam dan yang lainnya yang berpendapat (diperbolehkan) shalat setelah dan sebelum shalat ied, sedangkan pendapat yang pertamalah yang paling benar."
    },
    {
        "number": 494,
        "arab": "حَدَّثَنَا أَبُو عَمَّارٍ الْحُسَيْنُ بْنُ حُرَيْثٍ حَدَّثَنَا وَكِيعٌ عَنْ أَبَانَ بْنِ عَبْدِ اللَّهِ الْبَجَلِيِّ عَنْ أَبِي بَكْرِ بْنِ حَفْصٍ وَهُوَ ابْنُ عُمَرَ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ ابْنِ عُمَرَأَنَّهُ خَرَجَ فِي يَوْمِ عِيدٍ فَلَمْ يُصَلِّ قَبْلَهَا وَلَا بَعْدَهَا وَذَكَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَعَلَهُقَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Abu 'Amar Al Husain bin Huraits] telah menceritakan kepada kami [Waki'] dari [Aban bin Abdullah Al Bajali] dari [Abu Bakar bin Hafsh] dia adalah Ibnu Umar bin Sa'ad bin Abu Waqash, dari [Ibnu Umar] bahwa dia keluar (menuju tempat shalat) pada hari raya id, dengan tidak mengerjakan shalat sebelumnya maupun setelahnya. Dia menyebutkan bahwa Nabi Shallahu 'alaihi wa sallam mengerjakan seperti itu. Abu Isa berkata, ini adalah hadits hasab shahih."
    },
    {
        "number": 495,
        "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا مَنْصُورٌ وَهُوَ ابْنُ زَاذَانَ عَنْ ابْنِ سِيرِينَ عَنْ أُمِّ عَطِيَّةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُخْرِجُ الْأَبْكَارَ وَالْعَوَاتِقَ وَذَوَاتِ الْخُدُورِ وَالْحُيَّضَ فِي الْعِيدَيْنِ فَأَمَّا الْحُيَّضُ فَيَعْتَزِلْنَ الْمُصَلَّى وَيَشْهَدْنَ دَعْوَةَ الْمُسْلِمِينَ قَالَتْ إِحْدَاهُنَّ يَا رَسُولَ اللَّهِ إِنْ لَمْ يَكُنْ لَهَا جِلْبَابٌ قَالَ فَلْتُعِرْهَا أُخْتُهَا مِنْ جَلَابِيبِهَاحَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا هُشَيْمٌ عَنْ هِشَامِ بْنِ حَسَّانَ عَنْ حَفْصَةَ بِنْتِ سِيرِينَ عَنْ أُمِّ عَطِيَّةَ بِنَحْوِهِ قَالَ وَفِي الْبَاب عَنْ ابْنِ عَبَّاسٍ وَجَابِرٍ قَالَ أَبُو عِيسَى وَحَدِيثُ أُمِّ عَطِيَّةَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ ذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ إِلَى هَذَا الْحَدِيثِ وَرَخَّصَ لِلنِّسَاءِ فِي الْخُرُوجِ إِلَى الْعِيدَيْنِ وَكَرِهَهُ بَعْضُهُمْ وَرُوِي عَنْ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ أَنَّهُ قَالَ أَكْرَهُ الْيَوْمَ الْخُرُوجَ لِلنِّسَاءِ فِي الْعِيدَيْنِ فَإِنْ أَبَتِ الْمَرْأَةُ إِلَّا أَنْ تَخْرُجَ فَلْيَأْذَنْ لَهَا زَوْجُهَا أَنْ تَخْرُجَ فِي أَطْمَارِهَا الْخُلْقَانِ وَلَا تَتَزَيَّنْ فَإِنْ أَبَتْ أَنْ تَخْرُجَ كَذَلِكَ فَلِلزَّوْجِ أَنْ يَمْنَعَهَا عَنْ الْخُرُوجِ وَيُرْوَى عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا قَالَتْ لَوْ رَأَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَا أَحْدَثَ النِّسَاءُ لَمَنَعَهُنَّ الْمَسْجِدَ كَمَا مُنِعَتْ نِسَاءُ بَنِي إِسْرَائِيلَ وَيُرْوَى عَنْ سُفْيَانَ الثَّوْرِيِّ أَنَّهُ كَرِهَ الْيَوْمَ الْخُرُوجَ لِلنِّسَاءِ إِلَى الْعِيدِ",
        "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Manshur] dia adalah anak laki-lakinya Zadan, dari [Ibnu Sirin] dari [Ummu 'Athiyah] bahwasannya Rasulullah Shallahu 'alaihi wa sallam memerintahkan para perawan, para budak, para wanita yang mengurung diri, para wanita haidl untuk keluar (menuju tempat shalat) pada saat dua hari raya, adapuan wanita haidl, hendaknya mereka menjauh dari tempat shalat dan menyaksikan dakwahnya kaum Muslimin. Salah seorang dari kami berkata, wahai Rasulullah bagaimanakah jika mereka tidak memiliki jilbab? Beliau bersabda: \"Hendaknya saudara perempuannya mau meminjamkan jilbab untuknya.\" telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Husyaim] dari [Hisyam bin Hasan] dari [Hafshah binti Sirin] dari [Ummu 'Athiyah] dengan riwayat seperti itu. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Ibnu Abbas dan Jabir. Abu Isa berkata, hadits Ummu 'Athiyah adalah hadits hasan shahih, dan sebagian ahli ilmu mengambil pendapat dari hadits ini dan rukhshah (keringanan) bagi para wanita haidl untuk keluar (menuju tempat shalat) pada saat hari raya (idul fitri dan idul adla), dan sebagian yang lain memakruhkannya. Dan diriwayatkan dari Abdullah bin Mubarak bahwasannya dia berkata, pada hari ini saya membenci para wanita yang ikut keluar (menuju tempat shalat) pada saat dua hari raya, jika seorang wanita enggan dan masih tetap ingin keluar, hendaknya suami mengizinkannya untuk keluar (menuju tempat shalat) dengan mengenakan pakaian biasa (pakaian yang sudah lama) dan jangan sampai mereka berhias diri, jika mereka enggan dan masih tetap untuk keluar (menuju tempat shalat), hendaknya sang suami melarang untuk keluar (menuju tempat shalat). Di riwayatkan dari 'Aisyah radliallahu 'anha dia berkata, sekiranya Rasulullah Shallahu 'alaihi wa sallam melihat apa yang telah terjadi pada wanita-wanita sekarang, niscaya beliau akan melarang mereka menuju masjid sebagaimana dilarangnya para wanita bani Isra'il. Dan diriwayatkan dari Sufyan At Tsauri bahwa hari ini dia membenci para wanita untuk keluar (menuju tempat shalat) dihari raya id."
    },
    {
        "number": 496,
        "arab": "حَدَّثَنَا عَبْدُ الْأَعْلَى بْنُ وَاصِلِ بْنِ عَبْدِ الْأَعْلَى الْكُوفِيُّ وَأَبُو زُرْعَةَ قَالَا حَدَّثَنَا مُحَمَّدُ بْنُ الصَّلْتِ عَنْ فُلَيْحِ بْنِ سُلَيْمَانَ عَنْ سَعِيدِ بْنِ الْحَارِثِ عَنْ أَبِي هُرَيْرَةَ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا خَرَجَ يَوْمَ الْعِيدِ فِي طَرِيقٍ رَجَعَ فِي غَيْرِهِقَالَ وَفِي الْبَاب عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ وَأَبِي رَافِعٍ قَالَ أَبُو عِيسَى وَحَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ غَرِيبٌ وَرَوَى أَبُو تُمَيْلَةَ وَيُونُسُ بْنُ مُحَمَّدٍ هَذَا الْحَدِيثَ عَنْ فُلَيْحِ بْنِ سُلَيْمَانَ عَنْ سَعِيدِ بْنِ الْحَارِثِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ وَقَدْ اسْتَحَبَّ بَعْضُ أَهْلِ الْعِلْمِ لِلْإِمَامِ إِذَا خَرَجَ فِي طَرِيقٍ أَنْ يَرْجِعَ فِي غَيْرِهِ اتِّبَاعًا لِهَذَا الْحَدِيثِ وَهُوَ قَوْلُ الشَّافِعِيِّ وَحَدِيثُ جَابِرٍ كَأَنَّهُ أَصَحُّ",
        "id": "Telah menceritakan kepada kami ['Abdul A'la bin Washil bin 'Abdil A'la Al Kufi] dan [Abu Zur'ah] keduanya berkata, telah menceritakan kepada kami [Muhammad bin Ash Shalt] dari [Fulaih bin Sulaiman] dari [Sa'id bin Al Harits] dari [Abu Hurairah] dia berkata, adalah Nabi Shallahu 'alaihi wa sallam bila keluar (menuju tempat shalat) pada hari raya mengambil satu jalan, dan bila pulang beliau mengambil jalan yang lain. Dalam bab ini (ada juga riwayat -pent) dari Abdullah bin Umar dan Abu Rafi'. Abu Isa berkata, hadits Abu Hurairah adalah hadits hasan gharib. [Abu Tumailah] dan [Yunus bin Muhammad] telah meriwayatkan hadits ini dari [Fulaih bin Sulaiman] dari [Sa'id bin Al Harits] dari [Jabir bin Abdullah] dia berkata, sebagian ahli ilmu menganjurkan (menekankan) bagi seorang imam, jika dia keluar (menuju tempat shalat) dengan satu jalan hendaknya ia pulang dengan mengambil jalan yang lain, mengikuti hadits ini, ia merupakan perkataan Syafi'i, sepertinya hadits Jabir adalah hadits yang paling shahih."
    },
    {
        "number": 497,
        "arab": "حَدَّثَنَا الْحَسَنُ بْنُ الصَّبَّاحِ الْبَزَّارُ الْبَغْدَادِيُّ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ عَنْ ثَوَابِ بْنِ عُتْبَةَ عَنْ عَبْدِ اللَّهِ بْنِ بُرَيْدَةَ عَنْ أَبِيهِ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَخْرُجُ يَوْمَ الْفِطْرِ حَتَّى يَطْعَمَ وَلَا يَطْعَمُ يَوْمَ الْأَضْحَى حَتَّى يُصَلِّيَقَالَ وَفِي الْبَاب عَنْ عَلِيٍّ وَأَنَسٍ قَالَ أَبُو عِيسَى حَدِيثُ بُرَيْدَةَ بْنِ حُصَيْبٍ الْأَسْلَمِيِّ حَدِيثٌ غَرِيبٌ و قَالَ مُحَمَّدٌ لَا أَعْرِفُ لِثَوَابِ بْنِ عُتْبَةَ غَيْرَ هَذَا الْحَدِيثِ وَقَدْ اسْتَحَبَّ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ أَنْ لَا يَخْرُجَ يَوْمَ الْفِطْرِ حَتَّى يَطْعَمَ شَيْئًا وَيُسْتَحَبُّ لَهُ أَنْ يُفْطِرَ عَلَى تَمْرٍ وَلَا يَطْعَمَ يَوْمَ الْأَضْحَى حَتَّى يَرْجِعَ",
        "id": "Telah menceritakan kepada kami [Al Hasan bin Shabah Al Bazzar Al Baghdadi] telah menceritakan kepada kami ['Abdush Shamad bin 'Abd Al Warits] dari [Tsawab bin 'Utbah] dari [Abdullah bin Buraidah] dari [ayahnya] dia berkata, bahwa Nabi Shallahu 'alaihi wa sallam tidak keluar (ke tempat shalat) pada hari raya idul fitri sampai beliau makan terlebih dahulu, dan baliau tidak makan terlabih dahulu pada hari raya idul adlha sampai beliau shalat terlebih dahulu. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Ali dan Anas. Abu Isa berkata, hadits Buraidah bin Hushaib Al Aslami adalah hadits gharib. Muhammad berkata, dan saya tidak mengetahui (riwayatnya) Tsawab bin 'Utbah selain hadits ini. Dan dikalangan ahli ilmu menganjurkan supaya tidak keluar (menuju tempat shalat) sehingga makan sesuatu pada hari raya idul fitri, dan mereka juga menganjurkan untuk memakan kurma, dan tidak makan terlebih dahulu pada hari raya idul adla sampai dia kembali (dari tempat shalat)."
    },
    {
        "number": 498,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا هُشَيْمٌ عَنْ مُحَمَّدِ بْنِ إِسْحَقَ عَنْ حَفْصِ بْنِ عُبَيْدِ اللَّهِ بْنِ أَنَسٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُفْطِرُ عَلَى تَمَرَاتٍ يَوْمَ الْفِطْرِ قَبْلَ أَنْ يَخْرُجَ إِلَى الْمُصَلَّىقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Husyaim] dari [Muhammad bin Ishaq] dari [Hafsh bin 'Ubaidillah bin Anas] dari [Anas bin Malik] bahwa Nabi Shallahu 'alaihi wa sallam makan beberapa buah kurma dihari raya idul fitri sebelum keluar menuju tempat shalat. Abu Isa berkata, ini adalah hadits hasan gharib shahih."
    },
    {
        "number": 499,
        "arab": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْحَكَمِ الْوَرَّاقُ الْبَغْدَادِيُّ حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ قَالَسَافَرْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ فَكَانُوا يُصَلُّونَ الظُّهْرَ وَالْعَصْرَ رَكْعَتَيْنِ رَكْعَتَيْنِ لَا يُصَلُّونَ قَبْلَهَا وَلَا بَعْدَهَاو قَالَ عَبْدُ اللَّهِ لَوْ كُنْتُ مُصَلِّيًا قَبْلَهَا أَوْ بَعْدَهَا لَأَتْمَمْتُهَا قَالَ وَفِي الْبَاب عَنْ عُمَرَ وَعَلِيٍّ وَابْنِ عَبَّاسٍ وَأَنَسٍ وَعِمْرَانَ بْنِ حُصَيْنٍ وَعَائِشَةَ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ يَحْيَى بْنِ سُلَيْمٍ مِثْلَ هَذَا قَالَ مُحَمَّدُ بْنُ إِسْمَعِيلَ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ رَجُلٍ مِنْ آلِ سُرَاقَةَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ أَبُو عِيسَى وَقَدْ رُوِيَ عَنْ عَطِيَّةَ الْعَوْفِيِّ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَطَوَّعُ فِي السَّفَرِ قَبْلَ الصَّلَاةِ وَبَعْدَهَا وَقَدْ صَحَّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَقْصُرُ فِي السَّفَرِ وَأَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ صَدْرًا مِنْ خِلَافَتِهِ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ وَقَدْ رُوِيَ عَنْ عَائِشَةَ أَنَّهَا كَانَتْ تُتِمُّ الصَّلَاةَ فِي السَّفَرِ وَالْعَمَلُ عَلَى مَا رُوِيَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابِهِ وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَقَ إِلَّا أَنَّ الشَّافِعِيَّ يَقُولُ التَّقْصِيرُ رُخْصَةٌ لَهُ فِي السَّفَرِ فَإِنْ أَتَمَّ الصَّلَاةَ أَجْزَأَ عَنْهُ",
        "id": "Telah menceritakan kepada kami ['Abdul Wahhab bin 'Abdul Hakam Al Warraq Al Baghdadi] telah menceritakan kepada kami [Yahya bin Sulaim] dari ['Ubaidullah] dari [Nafi'] dari [Ibnu Umar] dia berkata, saya bepergian bersama Nabi Shallahu 'alaihi wa sallam, Abu Bakar, Umar dan Utsman, maka mereka melaksanakan shalat Dzuhur dan Ashar dua raka'at-dua raka'at, mereka tidak melakukan shalat sebelum maupun sesudahnya, Abdullah berkata, jika saya melakukan shalat sebelum atau sesudahnya niscaya saya akan menyempurnakan shalatku. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Umar, Ali, Ibnu Abbas, Anas, Imran bin Hushain dan A'isyah. Abu Isa berkata, hadits Ibnu Umar adalah hadits hasan gharib, kami tidak mengetahuinya kecuali dari hadits Yahya bin Sulaim yang seperti ini. Muhammad bin Isma'il berkata, hadits ini telah diriwayatkan dari 'Ubaidullah bin Umar dari seorang lelaki keluarga Suraqah dari Abdullah bin Umar, Abu Isa berkata, telah diriwayatkan dari ['Athiyyah Al Aufi] dari [Ibnu Umar] bahwa Nabi Shallahu 'alaihi wa sallam melaksanakan shalat sunnah tathawwu' dalam bepergian baik sebelum dan sesudah shalat, dan telah shahih dari Nabi Shallahu 'alaihi wa sallam bahwa beliau mengqashar (meringkas) shalatnya sewaktu bepergian, begitu juga Abu Bakar, Umar dan awal-awal dari kekhilafahan Utsman, hadits ini diamalkan oleh kebanyakan ahli ilmu dari kalangan para sahabat Nabi Shallahu 'alaihi wa sallam dan yang lainnya, telah diriwayatkan dari A'isyah bahwa dia menyempurnakan shalat sewaktu safar (bepergian), namun yang berlaku adalah sebagaimana apa yang telah diriwayatkan dari Nabi Shallahu 'alaihi wa sallam dan para sahabatnya, ini adalah pendapat Imam Syafi'i, Ahmad dan Ishaq, namun Imam Syafi'I berkata, mengqashar (meringkas shalat) adalah sebuah keringanan bagi musafir, jika dia menyempurnakan shalat maka itu sah-sah saja."
    },
    {
        "number": 500,
        "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا عَلِيُّ بْنُ زَيْدِ بْنِ جُدْعَانَ الْقُرَشِيُّ عَنْ أَبِي نَضْرَةَ قَالَسُئِلَ عِمْرَانُ بْنُ حُصَيْنٍ عَنْ صَلَاةِ الْمُسَافِرِ فَقَالَ حَجَجْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى رَكْعَتَيْنِوَحَجَجْتُ مَعَ أَبِي بَكْرٍ فَصَلَّى رَكْعَتَيْنِ وَمَعَ عُمَرَ فَصَلَّى رَكْعَتَيْنِ وَمَعَ عُثْمَانَ سِتَّ سِنِينَ مِنْ خِلَافَتِهِ أَوْ ثَمَانِيَ ثَمَانِي فَصَلَّى رَكْعَتَيْنِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Husyaim] telah mengabarkan kepada kami [Ali bin Zaid bin Jud'an Al Qurasyi] dari [Abu Nadlrah] dia berkata, [Imran bin Hushain] ditanya tentang shalatnya seorang musafir (dalam perjalanan), dia menjawab, saya melaksanakan haji bersama Rasulullah Shallahu 'alaihi wa sallam, lalu beliau shalat dua raka'at, kemudian saya melaksanakan haji bersama Abu Bakar dan dia melaksanakan shalat dua raka'at, dan bersama Umar, dia juga shalat dua raka'at, bersama Utsman selama enam atau delapan tahun pada masa kepemimpinannya juga shalat dua raka'at. Abu Isa berkata, hadits ini shahih."
    },
    {
        "number": 501,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ وَإِبْرَاهِيمَ بْنِ مَيْسَرَةَ سَمِعَا أَنَسَ بْنَ مَالِكٍ قَالَصَلَّيْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ بِالْمَدِينَةِ أَرْبَعًا وَبِذِي الْحُلَيْفَةِ الْعَصْرَ رَكْعَتَيْنِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Muhammad bin Al Munkadir] dan [Ibrahim bin Maisarah] keduanya telah mendengar dari [Anas bin Malik] dia berkata, kami shalat zhuhur bersama Nabi Shalallahu 'alaihi wa salam empat raka'at waktu di Madinah, dan shalat ashar dua raka'at di Dzulkhulaifah. Abu Isa berkata, ini adalah hadits hasan shahih."
    },
    {
        "number": 502,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا هُشَيْمٌ عَنْ مَنْصُورِ بْنِ زَاذَانَ عَنْ ابْنِ سِيرِينَ عَنْ ابْنِ عَبَّاسٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مِنْ الْمَدِينَةِ إِلَى مَكَّةَ لَا يَخَافُ إِلَّا اللَّهَ رَبَّ الْعَالَمِينَ فَصَلَّى رَكْعَتَيْنِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Husyaim] dari [Manshur bin Zadzan] dari [Ibnu Sirin] dari [Ibnu Abbas] bahwasannya Nabi Shalallahu 'alaihi wa salam keluar dari Madinah menuju Makkah, tidak ada yang beliau takuti kecuali Allah Rabb semesta alam, kemudian beliau shalat dua raka'at. Abu Isa berkata, ini adalah hadits hasan shahih."
    },
    {
        "number": 503,
        "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا هُشَيْمٌ أَخْبَرَنَا يَحْيَى بْنُ أَبِي إِسْحَقَ الْحَضْرَمِيُّ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ قَالَخَرَجْنَا مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ الْمَدِينَةِ إِلَى مَكَّةَ فَصَلَّى رَكْعَتَيْنِقَالَ قُلْتُ لِأَنَسٍ كَمْ أَقَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَكَّةَ قَالَ عَشْرًا قَالَ وَفِي الْبَاب عَنْ ابْنِ عَبَّاسٍ وَجَابِرٍ قَالَ أَبُو عِيسَى حَدِيثُ أَنَسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ أَقَامَ فِي بَعْضِ أَسْفَارِهِ تِسْعَ عَشْرَةَ يُصَلِّي رَكْعَتَيْنِ قَالَ ابْنُ عَبَّاسٍ فَنَحْنُ إِذَا أَقَمْنَا مَا بَيْنَنَا وَبَيْنَ تِسْعَ عَشْرَةَ صَلَّيْنَا رَكْعَتَيْنِ وَإِنْ زِدْنَا عَلَى ذَلِكَ أَتْمَمْنَا الصَّلَاةَ وَرُوِي عَنْ عَلِيٍّ أَنَّهُ قَالَ مَنْ أَقَامَ عَشْرَةَ أَيَّامٍ أَتَمَّ الصَّلَاةَ وَرُوِي عَنْ ابْنِ عُمَرَ أَنَّهُ قَالَ مَنْ أَقَامَ خَمْسَةَ عَشَرَ يَوْمًا أَتَمَّ الصَّلَاةَ وَقَدْ رُوِيَ عَنْهُ ثِنْتَيْ عَشْرَةَ وَرُوِي عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ أَنَّهُ قَالَ إِذَا أَقَامَ أَرْبَعًا صَلَّى أَرْبَعًا وَرَوَى عَنْهُ ذَلِكَ قَتَادَةُ وَعَطَاءٌ الْخُرَاسَانِيُّ وَرَوَى عَنْهُ دَاوُدُ بْنُ أَبِي هِنْدٍ خِلَافَ هَذَا وَاخْتَلَفَ أَهْلُ الْعِلْمِ بَعْدُ فِي ذَلِكَ فَأَمَّا سُفْيَانُ الثَّوْرِيُّ وَأَهْلُ الْكُوفَةِ فَذَهَبُوا إِلَى تَوْقِيتِ خَمْسَ عَشْرَةَ وَقَالُوا إِذَا أَجْمَعَ عَلَى إِقَامَةِ خَمْسَ عَشْرَةَ أَتَمَّ الصَّلَاةَ و قَالَ الْأَوْزَاعِيُّ إِذَا أَجْمَعَ عَلَى إِقَامَةِ ثِنْتَيْ عَشْرَةَ أَتَمَّ الصَّلَاةَ و قَالَ مَالِكُ بْنُ أَنَسٍ وَالشَّافِعِيُّ وَأَحْمَدُ إِذَا أَجْمَعَ عَلَى إِقَامَةِ أَرْبَعَةٍ أَتَمَّ الصَّلَاةَ وَأَمَّا إِسْحَقُ فَرَأَى أَقْوَى الْمَذَاهِبِ فِيهِ حَدِيثَ ابْنِ عَبَّاسٍ قَالَ لِأَنَّهُ رَوَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ تَأَوَّلَهُ بَعْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَجْمَعَ عَلَى إِقَامَةِ تِسْعَ عَشْرَةَ أَتَمَّ الصَّلَاةَ ثُمَّ أَجْمَعَ أَهْلُ الْعِلْمِ عَلَى أَنَّ الْمُسَافِرَ يَقْصُرُ مَا لَمْ يُجْمِعْ إِقَامَةً وَإِنْ أَتَى عَلَيْهِ سِنُونَ",
        "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] telah menceritakan kepada kami [Husyaim] telah mengkhabarkan kepada kami [Yahya bin Abu Ishaq Al Hadlrami] telah menceritakan kepada kami [Anas bin Malik] dia berkata, kami keluar bersama Nabi shalallhu 'alaihi wa salam dari Madinah menuju Makkah, kemudian beliau melaksanakan shalat dua raka'at. Dia (Yahya RH) berkata, saya bertanya kepada Anas, berapa lama Rasulullah Shalallahu 'alahi wa salam tinggal di Makkah?, Anas menjawab, sepuluh hari. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Ibnu Abbas dan Jabir. Abu Isa berkata, hadits Anas adalah hadits hasan shahih, telah diriwayatkan dari Ibnu Abbas dari Nabi Shalallhu 'alaihi wa salam, bahwa beliau menetap dalam safarnya (bepergiannya) selama sembilan belas hari dengan melaksanakan shalat dua raka'at. Ibnu Abbas berkata, apabila kami menetap antara sembilan belas hari, maka kami melaksanakan shalat dua raka'at dan jika lebih dari itu, maka kami menyempurnakan shalat. Telah diriwayatkan dari Ali bahwa beliau bersabda: \"Barangsiapa yang menetap selama sepuluh hari, maka ia harus menyempurnakan shalatnya.\" Telah diriwayatkan dari Ibnu Umar bahwa beliau bersabda: \"Barangsiapa yang menetap selama lima belas hari, maka ia harus menyempurnakan shalatnya.\" Dan telah diriwayatkan darinya dua belas (hari). Telah diriwayatkan dari Sa'id Bin Al Musayyib bahwa beliau bersabda: \"Jika menetap selama empat hari maka shalatlah empat hari.\" Qatadah dan Atha' Al Khurasani telah meriwayatkan darinya mengenai masalah itu, Daud bin Abu Hind telah meriwayatkan darinya (Ibnul Musayyib RH) dengan riwayat yang berbeda. Para ahli ilmu berbeda pendapat dalam hal ini, Sufyan Ats Tsauri dan penduduk Kufah berpendapat, mereka membatasi waktunya dengan lima belas hari, mereka mengatakan jika sepakat untuk menetap selama lima belas hari maka shalatnya harus sempurna, sedangkan Al Auza'I berkata jika sepakat untuk menetap selama dua belas hari maka shalatnya harus sempurna, adapun Imam Malik bin Anas, Syafi'i dan Ahmad berkata, apabila sepakat untuk menetap selama empat hari maka shalatnya harus sempurna, sedangkan Ishaq berpendapat bahwa madzhab yang paling kuat dalam masalah ini adalah hadits Ibnu Abbas, dia berkata, karena dia telah meriwayatkan dari Nabi Shalallahu 'alaihi wa salam, lalu dia menta'wilnya setelah Nabi Shalallahu 'alaihi wa salam bahwa, jika sepakat untuk menetap sembilan belas hari maka shalatnya harus sempurna, kemudian ahli ilmu sepakat bahwa seorang musafir boleh mengqashar shalatnya selagi tidak ada keinginan untuk menetap, sekalipun dia tinggal bertahun tahun."
    },
    {
        "number": 504,
        "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ عَاصِمٍ الْأَحْوَلِ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَسَافَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَفَرًا فَصَلَّى تِسْعَةَ عَشَرَ يَوْمًا رَكْعَتَيْنِ رَكْعَتَيْنِقَالَ ابْنُ عَبَّاسٍ فَنَحْنُ نُصَلِّي فِيمَا بَيْنَنَا وَبَيْنَ تِسْعَ عَشْرَةَ رَكْعَتَيْنِ رَكْعَتَيْنِ فَإِذَا أَقَمْنَا أَكْثَرَ مِنْ ذَلِكَ صَلَّيْنَا أَرْبَعًا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Hannad bin As Sarri] telah menceritakan kepada kami [Abu Mu'awiyah] dari ['Ashim Al Ahwal] dari [Ikrimah] dari [Ibnu Abbas] dia berkata, Rasulullah Shalallahu 'alaihi wa salam melakukan safar (bepergian), kemudian beliau melaksanakan shalat dua raka'at dua raka'at selama sembilan belas hari. Ibnu Abbas berkata, sedangkan dianatara kami melaksanakan dua raka'at dua raka'at selama sembilan belas hari, jika kami tinggal lebih lama dari itu maka kami shalat empat raka'at. Abu Isa berkata, hadits ini gharib hasan shahih."
    },
    {
        "number": 505,
        "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ أَبِي بُسْرَةَ الْغِفَارِيِّ عَنْ الْبَرَاءِ بْنِ عَازِبٍ قَالَصَحِبْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَمَانِيَةَ عَشَرَ شَهْرَا فَمَا رَأَيْتُهُ تَرَكَ الرَّكْعَتَيْنِ إِذَا زَاغَتْ الشَّمْسُ قَبْلَ الظُّهْرِقَالَ وَفِي الْبَاب عَنْ ابْنِ عُمَرَ قَالَ أَبُو عِيسَى حَدِيثُ الْبَرَاءِ حَدِيثٌ غَرِيبٌ قَالَ وَسَأَلْتُ مُحَمَّدًا عَنْهُ فَلَمْ يَعْرِفْهُ إِلَّا مِنْ حَدِيثِ اللَّيْثِ بْنِ سَعْدٍ وَلَمْ يَعْرِفْ اسْمَ أَبِي بُسْرَةَ الْغِفَارِيِّ وَرَآهُ حَسَنًا وَرُوِي عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ لَا يَتَطَوَّعُ فِي السَّفَرِ قَبْلَ الصَّلَاةِ وَلَا بَعْدَهَا وَرُوِيَ عَنْهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ كَانَ يَتَطَوَّعُ فِي السَّفَرِ ثُمَّ اخْتَلَفَ أَهْلُ الْعِلْمِ بَعْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَرَأَى بَعْضُ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَتَطَوَّعَ الرَّجُلُ فِي السَّفَرِ وَبِهِ يَقُولُ أَحْمَدُ وَإِسْحَقُ وَلَمْ تَرَ طَائِفَةٌ مِنْ أَهْلِ الْعِلْمِ أَنْ يُصَلَّى قَبْلَهَا وَلَا بَعْدَهَا وَمَعْنَى مَنْ لَمْ يَتَطَوَّعْ فِي السَّفَرِ قَبُولُ الرُّخْصَةِ وَمَنْ تَطَوَّعَ فَلَهُ فِي ذَلِكَ فَضْلٌ كَثِيرٌ وَهُوَ قَوْلُ أَكْثَرِ أَهْلِ الْعِلْمِ يَخْتَارُونَ التَّطَوُّعَ فِي السَّفَرِ",
        "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits bin Sa'ad] dari [Shafwan bin Sulaim] dari [Abu Busrah Al Ghifari] dari [Al Barra' bin Azib] dia berkata, saya menyertai Rasulullah Shalallahu 'alaihi wa salam delapan belas bulan, namun saya tidak pernah melihatnya meninggalkan dua raka'at ketika matahari mulai condong sebelum dzuhur. (perawi) berkata dan dalam bab ini (ada juga riwayat -pent) dari Ibnu Umar. Abu Isa berkata, hadits Al Barra' adalah hadits gharib, dia (perawi) berkata, saya bertanya kepada Muhammad tentang hadits itu, namun dia tidak mengetahuinya kecuali dari hadits Al Laits bin Sa'ad, dan dia tidak mengetahui nama Abu Busrah Al Ghifari, dia mengganggapnya baik. Telah diriwayatkan dari Ibnu Umar bahwa Nabi Shalallahu 'alaihi wa salam tidak melaksanakan shalat sunnah waktu bepergian sebelum shalat maupun setelahnya, telah diriwayatkan dari Ibnu Umar dari Nabi Shalallahu 'alaihi wa salam bahwa beliau melaksanakan shalat sunnah ketika dalam bepergian, kemudian para ahli ilmu sepeninggal Nabi Shalallahu 'alaihi wa salam berbeda pendapat, sebagian sahabat Nabi Shalallahu 'alaihi wa salam berpendapat melaksanakan shalat sunnah dalam bepergian dan ini pendapat Imam Ahmad dan Ishaq, sedangkan sebagian yang lain tidak berpendapat melaksanakan shalat sunnah sebelum shalat maupun sesudahnya ketika bepergian, dan maksud orang yagn tidak melaksanakan shalat tathowwu' dalam bepergian adalah sebagai rukhsah (keringanan), bagi yang melaksanakannya maka itu merupakan keutamaan yang banyak, ini adalah pendapat kebanyakan ahli ilmu bahwa mereka memilih melaksanakan shalat sunnah dalam bepergian."
    },
    {
        "number": 506,
        "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ الْحَجَّاجِ عَنْ عَطِيَّةَ عَنْ ابْنِ عُمَرَ قَالَصَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الظُّهْرَ فِي السَّفَرِ رَكْعَتَيْنِ وَبَعْدَهَا رَكْعَتَيْنِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَقَدْ رَوَاهُ ابْنُ أَبِي لَيْلَى عَنْ عَطِيَّةَ وَنَافِعٍ عَنْ ابْنِ عُمَرَ",
        "id": "Telah menceritakan kepada kami [Ali bin Hujr] telah menceritakan kepada kami [Hafs bin Ghiyats] dari [Al Hajjaj] dari ['Athiyyah] dari [Ibnu Umar] dia berkata, saya shalat Dzuhur bersama Nabi Shalallahu 'alaihi wa salam dua raka'at dan setelahnya dua raka'at dalam sebuah perjalanan. Abu Isa berkata, hadits ini hasan, [Ibnu Abu Laila] telah meriwayatkannya dari ['Athiyyah] dan [Nafi'] dari [Ibnu Umar]."
    },
    {
        "number": 507,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْمُحَارِبِيُّ يَعْنِي الْكُوفِيَّ حَدَّثَنَا عَلِيُّ بْنُ هَاشِمٍ عَنْ ابْنِ أَبِي لَيْلَى عَنْ عَطِيَّةَ وَنَافِعٍ عَنْ ابْنِ عُمَرَ قَالَصَلَّيْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْحَضَرِ وَالسَّفَرِ فَصَلَّيْتُ مَعَهُ فِي الْحَضَرِ الظُّهْرَ أَرْبَعًا وَبَعْدَهَا رَكْعَتَيْنِ وَصَلَّيْتُ مَعَهُ فِي السَّفَرِ الظُّهْرَ رَكْعَتَيْنِ وَبَعْدَهَا رَكْعَتَيْنِ وَالْعَصْرَ رَكْعَتَيْنِ وَلَمْ يُصَلِّ بَعْدَهَا شَيْئًا وَالْمَغْرِبَ فِي الْحَضَرِ وَالسَّفَرِ سَوَاءً ثَلَاثَ رَكَعَاتٍ لَا تَنْقُصُ فِي الْحَضَرِ وَلَا فِي السَّفَرِ هِيَ وِتْرُ النَّهَارِ وَبَعْدَهَا رَكْعَتَيْنِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ سَمِعْت مُحَمَّدًا يَقُولُ مَا رَوَى ابْنُ أَبِي لَيْلَى حَدِيثًا أَعْجَبَ إِلَيَّ مِنْ هَذَا وَلَا أَرْوِي عَنْهُ شَيْئًا",
        "id": "Telah menceritakan kepada kami [Muhammad bin 'Ubaid Al Muharibi yakni Al Kufi] telah menceritakan kepada kami [Ali bin Hasyim] dari [Ibnu Abu Laila] dari ['Athiyah] dan [Nafi'] dari [Ibnu Umar] dia berkata, saya shalat bersama Nabi Shalallahu 'alaihi wa salam waktu mukim dan waktu safar, dan saya shalat bersama beliau waktu mukim sebanyak empat raka'at dan setelahnya dua raka'at, saya juga shalat zhuhur bersama beliau waktu safar sebanyak dua raka'at dan setelahnya dua raka'at, shalat ashar dua raka'at dan beliau tidak mengerjakan dua raka'at setelahnya (ashar), beliau shalat maghrib tiga raka'at, beliau tidak menguranginya baik waktu mukim atau safar, ia merupakan witirnya siang, setelahnya beliau melaksanakan dua raka'at. Abu Isa berkata, ini adalah hadits hasan, saya pernah mendengar Muhammad berkata, ini adalah hadits hasan, saya pernah mendengar Muhammad berkata, saya tidak pernah mendapati riwayat Ibnu Abu Laila yang lebih menakjubkanku daripada hadits ini, padahal saya tidak pernah mengambil riwayat sesuatupun darinya."
    },
    {
        "number": 508,
        "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي الطُّفَيْلِ هُوَ عَامِرُ بْنُ وَاثِلَةَ عَنْ مُعَاذِ بْنِ جَبَلٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ فِي غَزْوَةِ تَبُوكَ إِذَا ارْتَحَلَ قَبْلَ زَيْغِ الشَّمْسِ أَخَّرَ الظُّهْرَ إِلَى أَنْ يَجْمَعَهَا إِلَى الْعَصْرِ فَيُصَلِّيَهُمَا جَمِيعًا وَإِذَا ارْتَحَلَ بَعْدَ زَيْغِ الشَّمْسِ عَجَّلَ الْعَصْرَ إِلَى الظُّهْرِ وَصَلَّى الظُّهْرَ وَالْعَصْرَ جَمِيعًا ثُمَّ سَارَ وَكَانَ إِذَا ارْتَحَلَ قَبْلَ الْمَغْرِبِ أَخَّرَ الْمَغْرِبَ حَتَّى يُصَلِّيَهَا مَعَ الْعِشَاءِ وَإِذَا ارْتَحَلَ بَعْدَ الْمَغْرِبِ عَجَّلَ الْعِشَاءَ فَصَلَّاهَا مَعَ الْمَغْرِبِقَالَ وَفِي الْبَاب عَنْ عَلِيٍّ وَابْنِ عُمَرَ وَأَنَسٍ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَعَائِشَةَ وَابْنِ عَبَّاسٍ وَأُسَامَةَ بْنِ زَيْدٍ وَجَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ أَبُو عِيسَى وَالصَّحِيحُ عَنْ أُسَامَةَ وَرَوَى عَلِيُّ بْنُ الْمَدِينِيِّ عَنْ أَحْمَدَ بْنِ حَنْبَلٍ عَنْ قُتَيْبَةَ هَذَا الْحَدِيثَ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ سُلَيْمَانَ حَدَّثَنَا زَكَرِيَّا اللُّؤْلُؤِيُّ حَدَّثَنَا أَبُو بَكْرٍ الْأَعْيَنُ حَدَّثَنَا عَلِيُّ بْنُ الْمَدِينِيِّ حَدَّثَنَا أَحْمَدُ بْنُ حَنْبَلٍ حَدَّثَنَا قُتَيْبَةُ بِهَذَا الْحَدِيثِ يَعْنِي حَدِيثَ مُعَاذٍ وَحَدِيثُ مُعَاذٍ حَدِيثٌ حَسَنٌ غَرِيبٌ تَفَرَّدَ بِهِ قُتَيْبَةُ لَا نَعْرِفُ أَحَدًا رَوَاهُ عَنْ اللَّيْثِ غَيْرَهُ وَحَدِيثُ اللَّيْثِ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ عَنْ أَبِي الطُّفَيْلِ عَنْ مُعَاذٍ حَدِيثٌ غَرِيبٌ وَالْمَعْرُوفُ عِنْدَ أَهْلِ الْعِلْمِ حَدِيثُ مُعَاذٍ مِنْ حَدِيثِ أَبِي الزُّبَيْرِ عَنْ أَبِي الطُّفَيْلِ عَنْ مُعَاذٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَمَعَ فِي غَزْوَةِ تَبُوكَ بَيْنَ الظُّهْرِ وَالْعَصْرِ وَبَيْنَ الْمَغْرِبِ وَالْعِشَاءِ رَوَاهُ قُرَّةُ بْنُ خَالِدٍ وَسُفْيَانُ الثَّوْرِيُّ وَمَالِكٌ وَغَيْرُ وَاحِدٍ عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ وَبِهَذَا الْحَدِيثِ يَقُولُ الشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَقُ يَقُولَانِ لَا بَأْسَ أَنْ يَجْمَعَ بَيْنَ الصَّلَاتَيْنِ فِي السَّفَرِ فِي وَقْتِ إِحْدَاهُمَا",
        "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Al Laits bin Sa'd] dari [Yazid bin Abu Habib] dari [Abu Ath Thufail dia adalah Amir bin Wailah] dari [Mu'adz bin Jabal] bahwa pada saat perang Tabuk, Nabi Shalallahu 'alaihi wa salam berangkat sebelum matahari condong, maka beliau mengakhirkan shalat zhuhur sampai beliau menggabungkan dengan shalat ashar, lalu beliau mengerjakan kedua shalat tersebut. Jika beliau berangkat setelah matahari condong, maka beliau bersegera mengerjakan shalat ashar di waktu zhuhur, lalu beliau menjama' shalat zhuhur dengan shalat ashar, kemudian beliau berangkat. Bila beliau berangkat sebelum Maghrib, maka beliau mengakhirkan shalat Maghrib hingga beliau mengerjakannya bersamaan dengan shalat Isya', jika beliau berangkat setelah Maghrib, maka beliau bersegera mengerjakan shalat Isya' bersama dengan shalat Maghirb. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Ali, Ibnu Umar, Anas, Abdullah bin Amru, 'Aisyah, Ibnu 'Abbas, Usamah bin Zaid dan Jabir bin Abdullah. Abu Isa berkata, yang shahih adalah (riwayat) dari Usamah. Ali bin Al Madini meriwayatkan hadits ini dari Ahmad bin Hanbal dari Qutaibah. Hadits ini (dari jalur lain) Telah menceritakan kepada kami [Abdush Shamad bin Sulaiman] telah menceritakan kepada kami [Zakariya Al Lu'lui] telah menceritakan kepada kami [Abu Bakar Al A'yun] telah menceritakan kepada kami [Ali bin Al Madini] telah menceritakan kepada kami [Ahmad bin Hanbal] telah menceritakan kepada kami [Qutaibah] hadits ini yaitu hadits Mu'adz. Sedangkan hadits Mu'adz adalah hadits hasan gharib. Qutaibah adalah perawi tunggal dalam hadits ini, kami tidak mengetahui seorang pun selain dia yang meriwayatkan (hadits ini) dari Al Laits. Sedangkan hadits Al Laits dari Yazid bin Abu Habib dari Abu Ath Thufail dari Mu'adz bin Jabal adalah hadits gharib. Yang terkenal dikalangan ahli ilmu adalah hadits Mu'adz dari hadits Abu Az Zubair dari Abu Ath Thufail dari Mu'adz bahwa pada saat perang Tabuk, Nabi shallallahu 'alaihi wasallam menjama' shalat zhuhur dengan Ashar dan shalat Maghrib dengan shalat Isya'. Hadits ini telah diriwayatkan pula oleh [Qurrah bin Khalid] dan [Sufyan Ats Tsauri] dan [Malik] dan yang lain dari [Abu Az Zubair Al Makki]. Syafi'i juga berpendapat dengan hadits ini. Ahmad dan Ishaq berkata, tidak mengapa menggabungkan dua shalat dalam perjalanan pada salah satu waktunya."
    },
    {
        "number": 509,
        "arab": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَأَنَّهُ اسْتُغِيثَ عَلَى بَعْضِ أَهْلِهِ فَجَدَّ بِهِ السَّيْرُ فَأَخَّرَ الْمَغْرِبَ حَتَّى غَابَ الشَّفَقُ ثُمَّ نَزَلَ فَجَمَعَ بَيْنَهُمَا ثُمَّ أَخْبَرَهُمْ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَفْعَلُ ذَلِكَ إِذَا جَدَّ بِهِ السَّيْرُقَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَحَدِيثُ اللَّيْثِ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Hannad bin Sirri] telah menceritakan kepada kami ['Abdah bin Sulaiman] dari [Ubaidullah bin Umar] dari [Nafi'] dari [Ibnu Umar] bahwa dia dimintai bantuan oleh keluarganya, dia mempercepat jalannya sehingga mengakhirkan shalat maghrib sampai matahari terbenam. Kemudian dia singgah dan menjama' antara keduanya (maghrib dan Isya') kemudian dia mengabarkan kepada mereka bahwa Rasulullah shallallahu 'alaihi wasallam pernah melakukan hal itu jika menghadapai kesulitan dalam perjalanan. Abu Isa berkata, hadits ini adalah hasan shahih. Sedangkan hadits Al Laits dari Yazid bin Abu Habib adalah hadits hasan shahih."
    },
    {
        "number": 510,
        "arab": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عَبَّادِ بْنِ تَمِيمٍ عَنْ عَمِّهِأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ بِالنَّاسِ يَسْتَسْقِي فَصَلَّى بِهِمْ رَكْعَتَيْنِ جَهَرَ بِالْقِرَاءَةِ فِيهَا وَحَوَّلَ رِدَاءَهُ وَرَفَعَ يَدَيْهِ وَاسْتَسْقَى وَاسْتَقْبَلَ الْقِبْلَةَقَالَ وَفِي الْبَاب عَنْ ابْنِ عَبَّاسٍ وَأَبِي هُرَيْرَةَ وَأَنَسٍ وَآبِي اللَّحْمِ قَالَ أَبُو عِيسَى حَدِيثُ عَبْدِ اللَّهِ بْنِ زَيْدٍ حَدِيثٌ حَسَنٌ صَحِيحٌ وَعَلَى هَذَا الْعَمَلُ عِنْدَ أَهْلِ الْعِلْمِ وَبِهِ يَقُولُ الشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَقُ وَعَمُّ عَبَّادِ بْنِ تَمِيمٍ هُوَ عَبْدُ اللَّهِ بْنُ زَيْدِ بْنِ عَاصِمٍ الْمَازِنِيُّ",
        "id": "Telah menceritakan kepada kami [Yahya bin Musa] telah menceritakan kepada kami [Abdurrazaq] telah mengabarkan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Abbad bin Tamim] dari [pamannya] bahwasannya Rasulullah Shalallahu 'alaihi wa salam keluar bersama orang-orang untuk memohon hujan, kemudian beliau shalat dua raka'at bersama mereka dengan mengeraskan bacaannya, kemudian beliau memindahkan selendangnya dan mengangkat kedua tangannya sambil menghadap kiblat seraya memohon turunnya hujan. (perawi berkata, dalam bab ini (ada juga riwayat -pent) dari Ibnu Abbas, Abu Hurairah Anas dan Abu Lahm. Abu Isa berkata, hadits Abdullah bin Zaid adalah hadits hasan shahih. Hadits ini juga diamalkan oleh ahli ilmu dan merupakan perkataan As Syafi'i, Ahmad dan Ishaq. Pamannya 'Abbad bin Tamim bernama Abdullah bin Zaid bin 'Ashim Al Mazini."
    },
    {
        "number": 511,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ خَالِدِ بْنِ يَزِيدَ عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ عَنْ عُمَيْرٍ مَوْلَى آبِي اللَّحْمِ عَنْ آبِي اللَّحْمِأَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عِنْدَ أَحْجَارِ الزَّيْتِ يَسْتَسْقِي وَهُوَ مُقْنِعٌ بِكَفَّيْهِ يَدْعُوقَالَ أَبُو عِيسَى كَذَا قَالَ قُتَيْبَةُ فِي هَذَا الْحَدِيثِ عَنْ آبِي اللَّحْمِ وَلَا نَعْرِفُ لَهُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا هَذَا الْحَدِيثَ الْوَاحِدَ وَعُمَيْرٌ مَوْلَى آبِي اللَّحْمِ قَدْ رَوَى عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَحَادِيثَ وَلَهُ صُحْبَةٌ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Al Laits bin Sa'ad] dari [Khalid bin Yazid] dari [Sa'id bin Abu Hilal] dari [Yazid bin Abdullah] dari ['Umair] budaknya Abu Lahm dari [Abu Lahm] bahwa dia melihat Rasulullah Shalallahu 'alaihi wa salam di sisi batu Zait memohon hujan dengan penuh merendahkan diri sambil (mengangkat) kedua telapak tangannya dan berdoa. Abu Isa berkata, demikianlah Qutaibah berkata dalam hadits ini dari Abu Lahm. Kami tidak mengetahui dia memiliki hadits dari Nabi Shalallahu 'alaihi wa salam kecuali hadits yang satu ini. 'Umair budak Abu Lahm juga telah meriwayatkan dari Nabi Shalallahu 'alaihi wa salam beberapa hadits, bahkan dia juga pernah menyertai beliau (Shalallahu 'alaihi wa salam)."
    },
    {
        "number": 512,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَعِيلَ عَنْ هِشَامِ بْنِ إِسْحَقَ وَهُوَ ابْنُ عَبْدِ اللَّهِ بْنِ كِنَانَةَ عَنْ أَبِيهِ قَالَأَرْسَلَنِي الْوَلِيدُ بْنُ عُقْبَةَ وَهُوَ أَمِيرُ الْمَدِينَةِ إِلَى ابْنِ عَبَّاسٍ أَسْأَلُهُ عَنْ اسْتِسْقَاءِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَتَيْتُهُ فَقَالَ إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ مُتَبَذِّلًا مُتَوَاضِعًا مُتَضَرِّعًا حَتَّى أَتَى الْمُصَلَّى فَلَمْ يَخْطُبْ خُطْبَتَكُمْ هَذِهِ وَلَكِنْ لَمْ يَزَلْ فِي الدُّعَاءِ وَالتَّضَرُّعِ وَالتَّكْبِيرِ وَصَلَّى رَكْعَتَيْنِ كَمَا كَانَ يُصَلِّي فِي الْعِيدِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ عَنْ هِشَامِ بْنِ إِسْحَقَ بْنِ عَبْدِ اللَّهِ بْنِ كِنَانَةَ عَنْ أَبِيهِ فَذَكَرَ نَحْوَهُ وَزَادَ فِيهِ مُتَخَشِّعًا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَهُوَ قَوْلُ الشَّافِعِيِّ قَالَ يُصَلِّي صَلَاةَ الِاسْتِسْقَاءِ نَحْوَ صَلَاةِ الْعِيدَيْنِ يُكَبِّرُ فِي الرَّكْعَةِ الْأُولَى سَبْعًا وَفِي الثَّانِيَةِ خَمْسًا وَاحْتَجَّ بِحَدِيثِ ابْنِ عَبَّاسٍ قَالَ أَبُو عِيسَى وَرُوِي عَنْ مَالِكِ بْنِ أَنَسٍ أَنَّهُ قَالَ لَا يُكَبِّرُ فِي صَلَاةِ الِاسْتِسْقَاءِ كَمَا يُكَبِّرُ فِي صَلَاةِ الْعِيدَيْنِ و قَالَ النُّعْمَانُ أَبُو حَنِيفَةَ لَا تُصَلَّى صَلَاةُ الِاسْتِسْقَاءِ وَلَا آمُرُهُمْ بِتَحْوِيلِ الرِّدَاءِ وَلَكِنْ يَدْعُونَ وَيَرْجِعُونَ بِجُمْلَتِهِمْ قَالَ أَبُو عِيسَى خَالَفَ السُّنَّةَ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Hatim bin Isma'il] dari [Hisyam bin Ishaq] dia adalah Ibnu Abdullah bin Kinanah dari [ayahnya] dia berkata, Al Walid bin Uqbah seorang gubernur Madinah mengutusku kepada [Ibnu Abbas] untuk menanyakan tentang shalat ististqa'nya Rasulullah Shalallahu 'alaihi wa salam, saya pun mendatanginya, dia berkata, sesungguhnya Rasulullah Shalallahu 'alaihi wa salam keluar rumah dengan penuh ketundukan, tawadlu' dan kerendahan sehingga tiba di tempat shalat, beliau tidak berkhutbah seperti khutbah kalian ini, akan tetepi beliau tidak henti hentinya berdo'a, merendah, bertakbir dan melaksanakan shalat dua raka'at seperti ketika shalat Ied. Abu Isa berkata, hadits ini hasan shahih. Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Waki'] dari [Sufyan] dari [Hisyam bin Ishaq bin Abdullah bin Kinanah] dari [ayahnya], kemudian dia menyebutkan hadits yang semakna dengannya, namun dia menambahkan \"dengan penuh kekhusyu'an\" Abu Isa berkata, hadits ini hasan shahih, ini juga pendapat Imam Syafi'i, dia berkata, pelaksanaan shalat ististqa' sebagaimana shalat Ied (Iedul Fitri dan Iedul Adlha), pada raka'at pertama takbir tujuh kali dan pada raka'at kedua lima kali, dengan berdalilkan hadits Ibnu Abbas. Abu Isa berkata, telah diriwayatkan dari Malik bin Anas bahwa dia berkata \"tidak ada takbir dalam shalat ististqa' seperti takbir dalam shalat Ied, An Nu'man Abu Hanifah berkata, tidak ada pelaksanaan shalat istisqa' dan saya tidak memerintahkan mereka memindahkan selendang, akan tetapi hendaknya mereka berdo'a kemudian mereka kembali secara keseluruhan. Abu Isa berkata, ini merupakan pendapat yang menyelisihi As Sunnah."
    },
    {
        "number": 513,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ صَلَّى فِي كُسُوفٍ فَقَرَأَ ثُمَّ رَكَعَ ثُمَّ قَرَأَ ثُمَّ رَكَعَ ثُمَّ قَرَأَ ثُمَّ رَكَعَ ثَلَاثَ مَرَّاتٍ ثُمَّ سَجَدَ سَجْدَتَيْنِ وَالْأُخْرَى مِثْلُهَاقَالَ وَفِي الْبَاب عَنْ عَلِيٍّ وَعَائِشَةَ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَالنُّعْمَانِ بْنِ بَشِيرٍ وَالْمُغِيرَةِ بْنِ شُعْبَةَ وَأَبِي مَسْعُودٍ وَأَبِي بَكْرَةَ وَسَمُرَةَ وَأَبِي مُوسَى الْأَشْعَرِيِّ وَابْنِ مَسْعُودٍ وَأَسْمَاءَ بِنْتِ أَبِي بَكْرٍ الصِّدِّيقِ وَابْنِ عُمَرَ وَقَبِيصَةَ الْهِلَالِيِّ وَجَابِرِ بْنِ عَبْدِ اللَّهِ وَعَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ وَأُبَيِّ بْنِ كَعْبٍ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ صَلَّى فِي كُسُوفٍ أَرْبَعَ رَكَعَاتٍ فِي أَرْبَعِ سَجَدَاتٍ وَبِهِ يَقُولُ الشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَقُ قَالَ وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِي الْقِرَاءَةِ فِي صَلَاةِ الْكُسُوفِ فَرَأَى بَعْضُ أَهْلِ الْعِلْمِ أَنْ يُسِرَّ بِالْقِرَاءَةِ فِيهَا بِالنَّهَارِ وَرَأَى بَعْضُهُمْ أَنْ يَجْهَرَ بِالْقِرَاءَةِ فِيهَا كَنَحْوِ صَلَاةِ الْعِيدَيْنِ وَالْجُمُعَةِ وَبِهِ يَقُولُ مَالِكٌ وَأَحْمَدُ وَإِسْحَقُ يَرَوْنَ الْجَهْرَ فِيهَا و قَالَ الشَّافِعِيُّ لَا يَجْهَرُ فِيهَا وَقَدْ صَحَّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كِلْتَا الرِّوَايَتَيْنِ صَحَّ عَنْهُ أَنَّهُ صَلَّى أَرْبَعَ رَكَعَاتٍ فِي أَرْبَعِ سَجَدَاتٍ وَصَحَّ عَنْهُ أَيْضًا أَنَّهُ صَلَّى سِتَّ رَكَعَاتٍ فِي أَرْبَعِ سَجَدَاتٍ وَهَذَا عِنْدَ أَهْلِ الْعِلْمِ جَائِزٌ عَلَى قَدْرِ الْكُسُوفِ إِنْ تَطَاوَلَ الْكُسُوفُ فَصَلَّى سِتَّ رَكَعَاتٍ فِي أَرْبَعِ سَجَدَاتٍ فَهُوَ جَائِزٌ وَإِنْ صَلَّى أَرْبَعَ رَكَعَاتٍ فِي أَرْبَعِ سَجَدَاتٍ وَأَطَالَ الْقِرَاءَةَ فَهُوَ جَائِزٌ وَيَرَى أَصْحَابُنَا أَنْ تُصَلَّى صَلَاةُ الْكُسُوفِ فِي جَمَاعَةٍ فِي كُسُوفِ الشَّمْسِ وَالْقَمَرِ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sufyan] dari [Habib bin Abu Tsabit] dari [Thawus] dari [Ibnu 'Abbas] dari Nabi Shalallahu 'alaihi wa salam bahwasannya beliau melaksanakan shalat kusuf (gerhana), kemudian beliau membaca, lalu ruku' sambil membaca, kemudian beliau ruku' sambil membaca, lalu ruku' samapi tiga kali, kemudian beliau malakkukan dua kali sujud, (dalam raka'at) lain juga seperti itu. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Ali, 'Aisyah, Abdullah bin Amru, Nu'man bin Basyir, Mughirah bin Syu'bah, Abu Mas'ud, Abu Bakrah, Samrah, Abu Musa Al Asy'ari, Ibnu Mas'ud, Asma' binti Abu Bakar As Shiddik, Ibnu Umar, Qabishah Al Hilali, Jabir bin Abdullah, Abdurrahman bin Samrah dan Ubay bin Ka'ab. Abu Isa berkata, hadits Ibnu Abbas adalah hadits hasan shahih, telah diriwayatkan dari Ibnu 'Abbas dari Nabi Shalallahu 'alaihi wa salam bahwa beliau shalat kusuf (gerhana) empat kali ruku' dengan empat kali sujud, "
    },
    {
        "number": 514,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ أَنَّهَا قَالَتْخَسَفَتْ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَصَلَّى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالنَّاسِ فَأَطَالَ الْقِرَاءَةَ ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ ثُمَّ رَفَعَ رَأْسَهُ فَأَطَالَ الْقِرَاءَةَ هِيَ دُونَ الْأُولَى ثُمَّ رَكَعَ فَأَطَالَ الرُّكُوعَ وَهُوَ دُونَ الْأَوَّلِ ثُمَّ رَفَعَ رَأْسَهُ فَسَجَدَ ثُمَّ فَعَلَ مِثْلَ ذَلِكَ فِي الرَّكْعَةِ الثَّانِيَةِقَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَبِهَذَا الْحَدِيثِ يَقُولُ الشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَقُ يَرَوْنَ صَلَاةَ الْكُسُوفِ أَرْبَعَ رَكَعَاتٍ فِي أَرْبَعِ سَجَدَاتٍ قَالَ الشَّافِعِيُّ يَقْرَأُ فِي الرَّكْعَةِ الْأُولَى بِأُمِّ الْقُرْآنِ وَنَحْوًا مِنْ سُورَةِ الْبَقَرَةِ سِرًّا إِنْ كَانَ بِالنَّهَارِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلًا نَحْوًا مِنْ قِرَاءَتِهِ ثُمَّ رَفَعَ رَأْسَهُ بِتَكْبِيرٍ وَثَبَتَ قَائِمًا كَمَا هُوَ وَقَرَأَ أَيْضًا بِأُمِّ الْقُرْآنِ وَنَحْوًا مِنْ آلِ عِمْرَانَ ثُمَّ رَكَعَ رُكُوعًا طَوِيلًا نَحْوًا مِنْ قِرَاءَتِهِ ثُمَّ رَفَعَ رَأْسَهُ ثُمَّ قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ثُمَّ سَجَدَ سَجْدَتَيْنِ تَامَّتَيْنِ وَيُقِيمُ فِي كُلِّ سَجْدَةٍ نَحْوًا مِمَّا أَقَامَ فِي رُكُوعِهِ ثُمَّ قَامَ فَقَرَأَ بِأُمِّ الْقُرْآنِ وَنَحْوًا مِنْ سُورَةِ النِّسَاءِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلًا نَحْوًا مِنْ قِرَاءَتِهِ ثُمَّ رَفَعَ رَأْسَهُ بِتَكْبِيرٍ وَثَبَتَ قَائِمًا ثُمَّ قَرَأَ نَحْوًا مِنْ سُورَةِ الْمَائِدَةِ ثُمَّ رَكَعَ رُكُوعًا طَوِيلًا نَحْوًا مِنْ قِرَاءَتِهِ ثُمَّ رَفَعَ فَقَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ ثُمَّ سَجَدَ سَجْدَتَيْنِ ثُمَّ تَشَهَّدَ وَسَلَّمَ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Abdul Malik bin Abu As Syawarib] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] bahwa dia berkata, telah terjadi gerhana pada masa Rasulullah shallallahu 'alaihi wasallam, kemudian Rasulullah shallallahu 'alaihi wasallam shalat bersama manusia dengan memanjangkan bacaan shalat, beliau kemudian ruku' dan memanjangkan ruku'nya, lalu beliau mengangkat kepala dan memanjangkan bacaan shalat, namun tidak seperti (lebih singkat) dari yang pertama. Kemudian beliau ruku' dan memanjangkan ruku'nya namun tidak seperti yang pertama. Kemudian beliau mengangkat kepala lalu sujud, kemudian beliau melakukan seperti itu diraka'at kedua. Abu Isa berkata, ini adalah hadits hasan shahih, dengan hadits ini pula Syafi'i, Ahamad dan Ishaq berpendapat bahwa shalat gerhana itu empat kali ruku' dan empat kali sujud. Syafi'i berkata, pada raka'at pertama membaca surat Al Fatehah dan surat yang sepadan dengan surat Al Baqarah. Beliau membaca dengan suara pelan jika di siang hari (gerhana matahari), kemudian ruku' yang panjang seperti membaca bacaan, kemudian mengangkat kepala dengan mengucapkan takbir dan berdiri sebagaimana mestinya, kemudian membaca surat Al Fatihah lagi dan membaca surat yang sepadan dengan surat Ali Imran, lalu memanjangkan ruku'nya seperti ketika membaca bacaan. Kemudian mengangat kepala, lantas membaca sami'allahu liman hamidah, kemudian sujud dua kali dengan sempurna. Setiap sujud beliau berhenti sebagaimana berhenti ketika ruku', kemudian berdiri sambil membaca Al Fatehah dan surat yang sepadan dengan surat An Nisaa', kemudian memanjangan ruku' seperti membaca bacaan. Kemudian mengangkat kepala dengan mengucapkan takbir, lantas berdiri dengan membaca bacaan yang sepadan dengan surat Al Maidah, kemudian memanjangkan ruku'nya seperti ketika membaca bacaan. Kemudian mengangkat kepala dan membaca sami'allahu liman hamidah, kemudian sujud dua kali lalu membaca tahiyyat dan salam."
    },
    {
        "number": 515,
        "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا وَكِيعٌ حَدَّثَنَا سُفْيَانُ عَنْ الْأَسْوَدِ بْنِ قَيْسٍ عَنْ ثَعْلَبَةَ بْنِ عِبَادٍ عَنْ سَمُرَةَ بْنِ جُنْدَبٍ قَالَصَلَّى بِنَا النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي كُسُوفٍ لَا نَسْمَعُ لَهُ صَوْتًاقَالَ وَفِي الْبَاب عَنْ عَائِشَةَ قَالَ أَبُو عِيسَى حَدِيثُ سَمُرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ ذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ إِلَى هَذَا وَهُوَ قَوْلُ الشَّافِعِيِّ",
        "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Waki'] telah menceritakan kepada kami [Sufyan] dari [Al Aswad bin Qais] dari [Tsa'labah bin Ibad] dari [Samrah bin Jundub] dia berkata, kami tidak mendengar suara bacaan Nabi Shalallahu 'alaihi wa salam waktu kami shalat Kusuf (gerhana) bersama beliau. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari A'isyah. Abu Isa berkata, hadits Samrah adalah hadits hasan shahih, sebagian ahli ilmu telah berpendapat dengan hadits ini, begitu juga dengan Syafi'i."
    },
    {
        "number": 516,
        "arab": "حَدَّثَنَا أَبُو بَكْرٍ مُحَمَّدُ بْنُ أَبَانَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ صَدَقَةَ عَنْ سُفْيَانَ بْنِ حُسَيْنٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى صَلَاةَ الْكُسُوفِ وَجَهَرَ بِالْقِرَاءَةِ فِيهَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَرَوَاهُ أَبُو إِسْحَقَ الْفَزَارِيُّ عَنْ سُفْيَانَ بْنِ حُسَيْنٍ نَحْوَهُ وَبِهَذَا الْحَدِيثِ يَقُولُ مَالِكُ بْنُ أَنَسٍ وَأَحْمَدُ وَإِسْحَقُ",
        "id": "Telah menceritakan kepada kami [Abu Bakar Muhammad bin Aban] telah menceritakan kepada kami [Ibrahim bin Shadaqah] dari [Sufyan bin Husain] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] bahwasannya Nabi Shalallahu 'alaihi wa salam shalat gerhana matahari dengan mengeraskan bacaannya. Abu Isa berkata, ini adalah hadits hasan shahih, [Abu Ishaq Al Fazari] telah meriwayatkan dari [Sufyan bin Husain] seperti hadits di atas, dengan hadits ini pula Malik bin Anas, Ahmad dan Ishaq berkata."
    },
    {
        "number": 517,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ حَدَّثَنَا مَعْمَرٌ عَنْ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى صَلَاةَ الْخَوْفِ بِإِحْدَى الطَّائِفَتَيْنِ رَكْعَةً وَالطَّائِفَةُ الْأُخْرَى مُوَاجِهَةُ الْعَدُوِّ ثُمَّ انْصَرَفُوا فَقَامُوا فِي مَقَامِ أُولَئِكَ وَجَاءَ أُولَئِكَ فَصَلَّى بِهِمْ رَكْعَةً أُخْرَى ثُمَّ سَلَّمَ عَلَيْهِمْ فَقَامَ هَؤُلَاءِ فَقَضَوْا رَكْعَتَهُمْ وَقَامَ هَؤُلَاءِ فَقَضَوْا رَكْعَتَهُمْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ وَقَدْ رَوَى مُوسَى بْنُ عُقْبَةَ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ مِثْلَ هَذَا قَالَ وَفِي الْبَاب عَنْ جَابِرٍ وَحُذَيْفَةَ وَزَيْدِ بْنِ ثَابِتٍ وَابْنِ عَبَّاسٍ وَأَبِي هُرَيْرَةَ وَابْنِ مَسْعُودٍ وَسَهْلِ بْنِ أَبِي حَثْمَةَ وَأَبِي عَيَّاشٍ الزُّرَقِيِّ وَاسْمُهُ زَيْدُ بْنُ صَامِتٍ وَأَبِي بَكْرَةَ قَالَ أَبُو عِيسَى وَقَدْ ذَهَبَ مَالِكُ بْنُ أَنَسٍ فِي صَلَاةِ الْخَوْفِ إِلَى حَدِيثِ سَهْلِ بْنِ أَبِي حَثْمَةَ وَهُوَ قَوْلُ الشَّافِعِيِّ و قَالَ أَحْمَدُ قَدْ رُوِيَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةُ الْخَوْفِ عَلَى أَوْجُهٍ وَمَا أَعْلَمُ فِي هَذَا الْبَابِ إِلَّا حَدِيثًا صَحِيحًا وَأَخْتَارُ حَدِيثَ سَهْلِ بْنِ أَبِي حَثْمَةَ وَهَكَذَا قَالَ إِسْحَقُ بْنُ إِبْرَاهِيمَ قَالَ ثَبَتَتْ الرِّوَايَاتُ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاةِ الْخَوْفِ وَرَأَى أَنَّ كُلَّ مَا رُوِيَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي صَلَاةِ الْخَوْفِ فَهُوَ جَائِزٌ وَهَذَا عَلَى قَدْرِ الْخَوْفِ قَالَ إِسْحَقُ وَلَسْنَا نَخْتَارُ حَدِيثَ سَهْلِ بْنِ أَبِي حَثْمَةَ عَلَى غَيْرِهِ مِنْ الرِّوَايَاتِ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Abdul Malik bin Abu Syawarib] telah menceritakan kepada kami [Yazid bin Zurai'] telah menceritakan kepada kami [Ma'mar] dari [Az Zuhri] dari [Salim] dari [ayahnya] bahwasanya Nabi shallallahu 'alaihi wasallam shalat khauf satu raka'at dengan salah satu kelompok dari dua pasukannya, sedangkan pasukan yang lain menghadapi musuh, kemudian mereka (pasukan yang tadinya shalat) beranjak dan menempati tempat pasukan yang berhadapan dengan musuh. Kemudian pasukan kedua datang, maka beliau shalat satu raka'at bersama mereka (pasukan yang kedua) kemudian beliau salam waktu mengimami mereka, kemudian mereka bangkit untuk menyempurnakan raka'at berikutnya, lalu pasukan yang pertama juga menyempurnakan raka'at berikutnya. Abu Isa berkata, hadits ini shahih, [Musa bin 'Uqbah] telah meriwayatkan dari [Nafi'] dari [Ibnu Umar] seperti hadit ini. Abu Isa berkata, dalam bab ini (ada juga riwayat -pent) dari Jabir, Hudzaifah, Zaid bin Tsabit, Ibnu 'Abbas, Abu Hurairah, Ibnu Mas'ud, Sahal bin Abu Hatsmah, Abu Ayasy Az Zuraqi -namanya adalah Zaid bin Shamit- dan Abu Bakrah. Abu Isa berkata, Malik bin Anas berpendapat dengan hadits Sahal bin Abu Hatsmah mengenai shalat kahuf ini. Syafi'i juga berpendapat dengan hadits ini. Ahmad berkata, telah diriwayatkan dari Nabi shallallahu 'alaihi wasallam mengenai shalat khauf dengan banyak versi, dan saya tidak mengetahui dalam masalah ini kecuali dari hadits shahih saja, dan saya memilih hadits Sahal bin Abu Hatsmah. Ishaq bin Ibrahim juga mengatakan bahwa banyak riwayat yang tetap dari Nabi shallallahu 'alaihi wasallam dalam shalat khauf. Dia berpendapat bahwa semua yang diriwayatkan dari Nabi shallallahu 'alaihi wasallam tentang shalat khauf boleh dikerjakan, dan ini sesuai dengan tingkatan rasa takut itu sendiri. Ishaq berkata, kami tidak memilih hadits Sahal bin Abu Hatsmah atas riwayat-riwayat lain."
    },
    {
        "number": 518,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْأَنْصَارِيُّ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ صَالِحِ بْنِ خَوَّاتِ بْنِ جُبَيْرٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَأَنَّهُ قَالَ فِي صَلَاةِ الْخَوْفِ قَالَ يَقُومُ الْإِمَامُ مُسْتَقْبِلَ الْقِبْلَةِ وَتَقُومُ طَائِفَةٌ مِنْهُمْ مَعَهُ وَطَائِفَةٌ مِنْ قِبَلِ الْعَدُوِّ وَوُجُوهُهُمْ إِلَى الْعَدُوِّ فَيَرْكَعُ بِهِمْ رَكْعَةً وَيَرْكَعُونَ لِأَنْفُسِهِمْ وَيَسْجُدُونَ لِأَنْفُسِهِمْ سَجْدَتَيْنِ فِي مَكَانِهِمْ ثُمَّ يَذْهَبُونَ إِلَى مَقَامِ أُولَئِكَ وَيَجِيءُ أُولَئِكَ فَيَرْكَعُ بِهِمْ رَكْعَةً وَيَسْجُدُ بِهِمْ سَجْدَتَيْنِ فَهِيَ لَهُ ثِنْتَانِ وَلَهُمْ وَاحِدَةٌ ثُمَّ يَرْكَعُونَ رَكْعَةً وَيَسْجُدُونَ سَجْدَتَيْنِقَالَ أَبُو عِيسَى قَالَ مُحَمَّدُ بْنُ بَشَّارٍ سَأَلْتُ يَحْيَى بْنَ سَعِيدٍ عَنْ هَذَا الْحَدِيثِ فَحَدَّثَنِي عَنْ شُعْبَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ عَنْ أَبِيهِ عَنْ صَالِحِ بْنِ خَوَّاتٍ عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ حَدِيثِ يَحْيَى بْنِ سَعِيدٍ الْأَنْصَارِيِّ و قَالَ لِي يَحْيَى اكْتُبْهُ إِلَى جَنْبِهِ وَلَسْتُ أَحْفَظُ الْحَدِيثَ وَلَكِنَّهُ مِثْلُ حَدِيثِ يَحْيَى بْنِ سَعِيدٍ الْأَنْصَارِيِّ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ لَمْ يَرْفَعْهُ يَحْيَى بْنُ سَعِيدٍ الْأَنْصَارِيُّ عَنْ الْقَاسِمِ بْنِ مُحَمَّدٍ وَهَكَذَا رَوَى أَصْحَابُ يَحْيَى بْنِ سَعِيدٍ الْأَنْصَارِيِّ مَوْقُوفًا وَرَفَعَهُ شُعْبَةُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ بْنِ مُحَمَّدٍ وَرَوَى مَالِكُ بْنُ أَنَسٍ عَنْ يَزِيدَ بْنِ رُومَانَ عَنْ صَالِحِ بْنِ خَوَّاتٍ عَنْ مَنْ صَلَّى مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةَ الْخَوْفِ فَذَكَرَ نَحْوَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَبِهِ يَقُولُ مَالِكٌ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَقُ وَرُوِي عَنْ غَيْرِ وَاحِدٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى بِإِحْدَى الطَّائِفَتَيْنِ رَكْعَةً رَكْعَةً فَكَانَتْ لِلنَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَكْعَتَانِ وَلَهُمْ رَكْعَةٌ رَكْعَةٌ قَالَ أَبُو عِيسَى أَبُو عَيَّاشٍ الزُّرَقِيُّ اسْمُهُ زَيْدُ بْنُ صَامِتٍ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Yahya bin Sa'id Al Qaththan] telah menceritakan kepada kami [Yahya bin Sa'id Al Anshari] dari [Al Qasim bin Muhammad] dari [Shalih bin Khawwat bin Jubair] dari [Sahl bin Abu Khatsmah] bahwasannya dia berkata tentang tata cara shalat khauf, Hendaknya imam berdiri menghadap qiblat, lalu pasukan pertama berdiri di belakangnya dan pasukan yang kedua berjaga-jaga menghadapi musuh. Kemudian imam shalat bersama pasukan yang pertama satu raka'at lalu mereka menyempurnakan raka'at yang kedua sendiri-sendiri dan menggantikan posisi pasukan yang kedua yang berjaga-jaga menghadapi musuh. Kemudian pasukan yang kedua shalat bersama imam satu raka'at yang raka'at ini merupakan raka'at kedua bagi imam, kemudian mereka menyempurnakan raka'at yang kedua sendiri-sendiri. Abu Isa berkata, [Muhammad bin Basysyar] berkata, saya bertanya kepada [Yahya bin Sa'id] tentang hadits ini, maka dia menceritakan kepadaku dari [Syu'bah] dari [Abdurrahman bin Al Qasim] dari [ayahnya] dari [Shalih bin Khawwat] dari [Sahl bin Abu Hatsmah] dari Nabi Shallallaahu 'alaihi wasallam sama seperti hadits Yahya bin Sa'id Al Anshary. Yahya berkata kepadaku, tulislah hadits ini disamping hadits Yahya bin Sa'id, walaupun saya tidak hafal haditsnya, akan tetapi hadits ini sama seperti hadits Yahya bin Sa'id. Abu 'Isa berkata, hadits ini adalah hasan shahih, tetapi Yahya bin Sa'id tidak memarfu'kannya dari Qasim bin Muhammad. Sahabat-sahabat Yahya bin Sa'id juga meriwayatkan hadits ini secara mauquf. Sedangkan Syu'bah meriwayatkannya secara marfu' dari Abdurrahman bin Al Qasim bin Muhammad. Hadits ini juga diriwayatkan oleh [Malik bin Anas] dari [Yazid bin Ruman] dari [Shalih bin Khawwat] dari [seorang] yang pernah shalat khauf bersama Nabi Shalallahu 'alaihi wa salam lalu dia menyebutkan hadits semisalnya. Abu 'Isa berkata, ini adalah hadits hasan shahih, demikian juga pendapat Malik, Syafi'i, Ahmad dan Ishaq. Dan diriwayatkan juga oleh lebih dari satu orang, bahwasannya Nabi Shalallahu 'alaihi wa salam mengerjakan shalat dengan salah satu pasukan satu raka'at- satu raka'at, dengan demikian Nabi Shalallahu 'alaihi wa salam berjama'ah sebanyak dua raka'at, sedangkan mereka hanya satu raka'at- satu raka'at. Abu 'Isa berkata, Abu 'Ayyasy Al Zuraqi bernama Zaid bin Shamit"
    },
    {
        "number": 519,
        "arab": "حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ عَنْ عُمَرَ الدِّمَشْقِيِّ عَنْ أُمِّ الدَّرْدَاءِ عَنْ أَبِي الدَّرْدَاءِ قَالَسَجَدْتُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِحْدَى عَشْرَةَ سَجْدَةً مِنْهَا الَّتِي فِي النَّجْمِحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ صَالِحٍ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ عَنْ خَالِدِ بْنِ يَزِيدَ عَنْ سَعِيدِ بْنِ أَبِي هِلَالٍ عَنْ عُمَرَ وَهُوَ ابْنُ حَيَّانَ الدِّمَشْقِيُّ قَال سَمِعْتُ مُخْبِرًا يُخْبِرُ عَنْ أُمِّ الدَّرْدَاءِ عَنْ أَبِي الدَّرْدَاءِ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ بِلَفْظِهِ قَالَ أَبُو عِيسَى وَهَذَا أَصَحُّ مِنْ حَدِيثِ سُفْيَانَ بْنِ وَكِيعٍ عَنْ عَبْدِ اللَّهِ بْنِ وَهْبٍ قَالَ وَفِي الْبَاب عَنْ عَلِيٍّ وَابْنِ عَبَّاسٍ وَأَبِي هُرَيْرَةَ وَابْنِ مَسْعُودٍ وَزَيْدِ بْنِ ثَابِتٍ وَعَمْرِو بْنِ الْعَاصِ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي الدَّرْدَاءِ حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ سَعِيدِ بْنِ أَبِي هِلَالٍ عَنْ عُمَرَ الدِّمَشْقِيِّ",
        "id": "Telah menceritakan kepada kami [Sufyan bin Waki'] telah menceritakan kepada kami [Abdullah bin Wahb] dari [Amru bin Al Harits] dari [Sa'id bin Abu Hilal] dari [Umar Ad Dimasyqi] dari [Ummi Darda'] dari [Abu Darda'] dia berkata, saya pernah sujud (tilawah) bersama Rasulullah Sallallaahu 'alaihi wasallam sebanyak sebelas kali, diantaranya ayat yang ada dalam surat An Najm. Telah menceritakan kepada kami [Abdullah bin Abdurrahman] telah mengabarkan kepada kami [Abdullah bin Shalih] telah menceritakan kepada kami [Al Laits bin Sa'ad] dari [Khalid bin Yazid] dari [Sa'id bin Abu Hilal] dari [Umar] (yaitu Ibnu Hayyan Al Dimasyqi) dia berkata, saya mendengar [seseorang] mengabarkan dari [Ummi Darda'] dari [Abu Darda'] dari Nabi Sallallaahu 'alaihi wasallam seperti hadits diatas dengan lafadz yang sama. Abu 'Isa berkata, riwayat ini lebih shahih dari riwayat Sufyan bin Waki'. (perawi) berkata, dan dalam bab ini (ada juga riwayat -pent) dari Ali, Abu Hurairah, Ibnu Mas'ud, Zaid bin Tsabit, dan Amru bin Ash. Abu 'Isa berkata, hadits Abu Darda' adalah hadits gharib, tidak kami ketahui kecuali dari riwayat Sa'id bin Abu Hilal dari Umar Al Dimasyqi."
    },
    {
        "number": 520,
        "arab": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ حَدَّثَنَا عِيسَى بْنُ يُونُسَ عَنْ الْأَعْمَشِ عَنْ مُجَاهِدٍ قَالَكُنَّا عِنْدَ ابْنِ عُمَرَ فَقَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ائْذَنُوا لِلنِّسَاءِ بِاللَّيْلِ إِلَى الْمَسَاجِدِفَقَالَ ابْنُهُ وَاللَّهِ لَا نَأْذَنُ لَهُنَّ يَتَّخِذْنَهُ دَغَلًا فَقَالَ فَعَلَ اللَّهُ بِكَ وَفَعَلَ أَقُولُ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَتَقُولُ لَا نَأْذَنُ لَهُنَّ قَالَ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ وَزَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ وَزَيْدِ بْنِ خَالِدٍ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Nashr bin Ali] telah menceritakan kepada kami ['Isa bin Yunus] dari [Al A'masy] dari [Mujahid] dia berkata, ketika kami bersama [Ibnu Umar] dia berkata, Rasulullah Shalallahu 'alaihi wa salam bersabda: \"Izinkanlah para wanita untuk pergi ke masjid pada malam hari.\" lalu berkata anaknya (Bilal), demi Allah tidak akan kami izinkan mereka pergi ke masjid, karena mereka akan mengambil kesempatan ini untuk berbuat buruk. Lantas Ibnu Umar mencelanya tiga kali dengan berkata, (semoga Allah melaknatmu), saya berkata, Rasulullah Shalallahu 'alaihi wa salam telah bersabda sedangkan kamu malah berkata, sekali-kali kami tidak akan mengizinkan mereka. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Abu Hurairah, Zainab istri Abdullah bin Mas'ud dan Zaid bin Khalid. Abu 'Isa berkata, hadits Ibnu Umar adalah hasan shahih."
    },
    {
        "number": 521,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ سُفْيَانَ عَنْ مَنْصُورٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ طَارِقِ بْنِ عَبْدِ اللَّهِ الْمُحَارِبِيِّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كُنْتَ فِي الصَّلَاةِ فَلَا تَبْزُقْ عَنْ يَمِينِكَ وَلَكِنْ خَلْفَكَ أَوْ تِلْقَاءَ شِمَالِكَ أَوْ تَحْتَ قَدَمِكَ الْيُسْرَىقَالَ وَفِي الْبَاب عَنْ أَبِي سَعِيدٍ وَابْنِ عُمَرَ وَأَنَسٍ وَأَبِي هُرَيْرَةَ قَالَ أَبُو عِيسَى وَحَدِيثُ طَارِقٍ حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ قَالَ و سَمِعْت الْجَارُودَ يَقُولُ سَمِعْتُ وَكِيعًا يَقُولُ لَمْ يَكْذِبْ رِبْعِيُّ بْنُ حِرَاشٍ فِي الْإِسْلَامِ كَذْبَةً قَالَ و قَالَ عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ أَثْبَتُ أَهْلِ الْكُوفَةِ مَنْصُورُ بْنُ الْمُعْتَمِرِ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Yahya bin Sa'id] dari [Sufyan] dari [Manshur] dari [Rab'i bin Hirasy] dari [Thariq bin Abdullah Al Muharibi] dia berkata, Rasulullah Sallallaahu 'alaihi wasallam bersabda: \"Jika kamu sedang shalat, maka janganlah meludah ke samping kanan, akan tetapi meludahlah ke belakangmu atau ke samping kirimu atau di bawah telapak kaki kiri.\" Abu 'Isa berkata, hadits semakna juga diriwayatkan dari Abu Sa'id, Ibnu Umar, Anas, Abu Hurairah. Abu 'Isa berkata, hadits Thariq merupakan hadits hasan shahih dan diamalkan oleh para ahli ilmu. Dia (perawi) berkata, saya telah mendengar Al Jarud berkata, saya telah mendengar Waki' berkata, Rib'i bin Hirasy tidak pernah berdusta. Abu 'Isa berkata, berkata Abdurrahman bin Mahdi, Manshur bin Al Mu'tamir merupakan penduduk Kufah yang paling terpercaya."
    },
    {
        "number": 522,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ قَتَادَةَ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْبُزَاقُ فِي الْمَسْجِدِ خَطِيئَةٌ وَكَفَّارَتُهَا دَفْنُهَاقَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abu 'Awanah] dari [Qatadah] dari [Anas bin Malik] dia berkata, Rasulullah Sallallaahu 'alaihi wasallam bersabda: \"Meludah didalam masjid merupakan perbuatan dosa dan Kaffarahnya ialah dengan menguburnya.\" Abu 'Isa berkata, hadits ini hadits hasan shahih."
    },
    {
        "number": 523,
        "arab": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ أَيُّوبَ بْنِ مُوسَى عَنْ عَطَاءِ بْنِ مِينَاءٍ عَنْ أَبِي هُرَيْرَةَ قَالَسَجَدْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي اقْرَأْ بِاسْمِ رَبِّكَ وَإِذَا السَّمَاءُ انْشَقَّتْحَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ يَحْيَى بْنِ سَعِيدٍ عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدٍ هُوَ ابْنُ عَمْرِو بْنِ حَزْمٍ عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِثْلَهُ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ يَرَوْنَ السُّجُودَ فِي إِذَا السَّمَاءُ انْشَقَّتْ وَاقْرَأْ بِاسْمِ رَبِّكَ وَفِي هَذَا الْحَدِيثِ أَرْبَعَةٌ مِنْ التَّابِعِينَ بَعْضُهُمْ عَنْ بَعْضٍ",
        "id": "Telah menceritakan kepada kami [Qutaibah bin Sa'id] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Ayyub bin Musa] dari ['Atha' bin Mina'] dari [Abu Hurairah] dia berkata, saya telah sujud (tilawah) bersama Rasulullah Sallallaahu 'alaihi wasallam pada surat IQRA' BISMIRABBIK (Al Alaq) dan surat WAIDZAS SAMAAUN SYAQQAT (Al Insyiqaq). Telah mengabarkan kepada kami [Qutaibah] telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Yahya bin Sa'id] dari [Abu Bakr bin Muhammad bin Amru bin Hazm] dari [Umar bin Abdul Aziz] dari [Abu Bakr bin Abdurraham bin Al Harits bin Hisyam] dari [Abu Hurairah] dari Nabi Sallallaahu 'alaihi wasallam seperti hadits diatas. Abu 'Isa berkata, hadits Abu Hurairah ialah hadits hasan shahih dan para ahlul ilmi juga mengamalkannya, mereka berpendapat adanya sujud tilawah pada surat WAIDZAS SAMAAUN SYAQQAT (Al Insyiqaq) dan IQRA' BISMIRABBIK (Al Alaq), dalam hadits ini empat orang dari tabi'in sebagian mereka dari sebagian yang lain."
    },
    {
        "number": 524,
        "arab": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ الْبَزَّازُ الْبَغْدَادِيُّ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ حَدَّثَنَا أَبِي عَنْ أَيُّوبَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَسَجَدَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا يَعْنِي النَّجْمَ وَالْمُسْلِمُونَ وَالْمُشْرِكُونَ وَالْجِنُّ وَالْإِنْسُقَالَ وَفِي الْبَاب عَنْ ابْنِ مَسْعُودٍ وَأَبِي هُرَيْرَةَ قَالَ أَبُو عِيسَى حَدِيثُ ابْنِ عَبَّاسٍ حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ يَرَوْنَ السُّجُودَ فِي سُورَةِ النَّجْمِ و قَالَ بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ لَيْسَ فِي الْمُفَصَّلِ سَجْدَةٌ وَهُوَ قَوْلُ مَالِكِ بْنِ أَنَسٍ وَالْقَوْلُ الْأَوَّلُ أَصَحُّ وَبِهِ يَقُولُ الثَّوْرِيُّ وَابْنُ الْمُبَارَكِ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَقُ",
        "id": "Telah menceritakan kepada kami [Harun bin Abdullah Al Bazaz Al Baghdadi] telah menceritakan kepada kami [Abdush Shamad bin Abdul Warits] telah menceritakan kepada kami [ayahku] dari [Ayyub] dari ['Ikrimah] dari [Ibnu 'Abbas] dia berkata, Rasulullah Sallallahu 'alaihi wasallam sujud tilawah pada surat An Najm, demikian juga kaum muslimin, orang-orang kafir Quraisy, jin dan manusia (Ketika Rasul masih di Makkah. Pent) (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Ibnu Mas'ud dan Abu Hurairah. Abu 'Isa berkata, Hadits Ibnu Abbas ialah hadits hasan shahih dan diamalkan oleh ahli ilmu, mereka berpendapat adanya sujud tilawah dalam surat An najm. Sedangkan sebagian ahli ilmu dari para sahabat Nabi shallallahu 'alaihi wasallam berpendapat tidak adanya sujud tilawah pada Al Mufashsal (dari surat Qaf sampai akhir mushaf. Pent) demikian juga pendapat Malik bin Anas. Namun pendapat yang pertama lebih kuat, ini merupakan pendapatnya Ats Tsaury, Ibnu Al Mubarak, Syafi'i, Ahmad dan Ishaq."
    },
    {
        "number": 525,
        "arab": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى حَدَّثَنَا وَكِيعٌ عَنْ ابْنِ أَبِي ذِئْبٍ عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ قُسَيْطٍ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ زَيْدِ بْنِ ثَابِتٍ قَالَقَرَأْتُ عَلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّجْمَ فَلَمْ يَسْجُدْ فِيهَاقَالَ أَبُو عِيسَى حَدِيثُ زَيْدِ بْنِ ثَابِتٍ حَدِيثٌ حَسَنٌ صَحِيحٌ وَتَأَوَّلَ بَعْضُ أَهْلِ الْعِلْمِ هَذَا الْحَدِيثَ فَقَالَ إِنَّمَا تَرَكَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ السُّجُودَ لِأَنَّ زَيْدَ بْنَ ثَابِتٍ حِينَ قَرَأَ فَلَمْ يَسْجُدْ لَمْ يَسْجُدْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَالُوا السَّجْدَةُ وَاجِبَةٌ عَلَى مَنْ سَمِعَهَا فَلَمْ يُرَخِّصُوا فِي تَرْكِهَا وَقَالُوا إِنْ سَمِعَ الرَّجُلُ وَهُوَ عَلَى غَيْرِ وُضُوءٍ فَإِذَا تَوَضَّأَ سَجَدَ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَأَهْلِ الْكُوفَةِ وَبِهِ يَقُولُ إِسْحَقُ و قَالَ بَعْضُ أَهْلِ الْعِلْمِ إِنَّمَا السَّجْدَةُ عَلَى مَنْ أَرَادَ أَنْ يَسْجُدَ فِيهَا وَالْتَمَسَ فَضْلَهَا وَرَخَّصُوا فِي تَرْكِهَا إِنْ أَرَادَ ذَلِكَ وَاحْتَجُّوا بِالْحَدِيثِ الْمَرْفُوعِ حَدِيثِ زَيْدِ بْنِ ثَابِتٍ حَيْثُ قَالَ قَرَأْتُ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ النَّجْمَ فَلَمْ يَسْجُدْ فِيهَا فَقَالُوا لَوْ كَانَتْ السَّجْدَةُ وَاجِبَةً لَمْ يَتْرُكْ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَيْدًا حَتَّى كَانَ يَسْجُدَ وَيَسْجُدَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاحْتَجُّوا بِحَدِيثِ عُمَرَ أَنَّهُ قَرَأَ سَجْدَةً عَلَى الْمِنْبَرِ فَنَزَلَ فَسَجَدَ ثُمَّ قَرَأَهَا فِي الْجُمُعَةِ الثَّانِيَةَ فَتَهَيَّأَ النَّاسُ لِلسُّجُودِ فَقَالَ إِنَّهَا لَمْ تُكْتَبْ عَلَيْنَا إِلَّا أَنْ نَشَاءَ فَلَمْ يَسْجُدْ وَلَمْ يَسْجُدُوا فَذَهَبَ بَعْضُ أَهْلِ الْعِلْمِ إِلَى هَذَا وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ",
        "id": "Telah menceritakan kepada kami [Yahya bin Musa] telah menceritakan kepada kami [Waki'] dari [Ibnu Abu Dzi'b] dari [Yazid bin Abdullah bin Qusaith] dari ['Atha' bin Yasar] dari [Zaid bin Tsabit] dia berkata, saya membaca surat An najm dihadapan Rasulullah Sallallahu 'alaihi wasallam, namun beliau tidak sujud (tilawah). Abu 'Isa berkata, hadits Zaid bin Tsabit adalah hadits hasan shahih. sebagian ahlul ilmi memberikan penjelasan tentang hadits ini bahwa tidak sujudnya Nabi Shalallahu 'alaihi wa salam dikarenakan Zaid bin Tsabit, selaku qari' tidak sujud, mereka juga berpendapat bahwa sujud tilawah hukumnya wajib bagi siapa saja yang mendengar tanpa memberikan rukhshah didalamnya, bahkan mereka berkata, jika seseorang mendengarnya dalam keadaan tidak berwudlu' kemudian berwudlu, maka wajib baginya bersujud, perkataan ini merupakan pendapat Sufyan Ats Tsauri dan Ahli Kufah serta Ishaq. Sebagian dari ahlul ilmi berpendapat sujud tilawah disyare'atkan bagi siapa yang ingin bersujud dan mengharapkan keutamaan serta boleh juga untuk tidak dikerjakan. Mereka berhujjah dengan hadits shahih yaitu hadits Zaid bin Tsabit yang berkata, saya membaca surat An najm dihadapan Rasulullah Sallallahu 'alaihi wasallam, namun beliau tidak sujud (tilawah). Mereka juga berhujjah dengan hadits yang diriwayatkan oleh Umar, bahwasanya beliau membaca ayat As Sajdah di atas mimbar, lalu beliau turun dan langsung bersujud, kemudian membacanya lagi pada Jum'at berikutnya tatkala orang-orang bersiap-siap untuk bersujud, beliau bersabda: \"Sesungguhnya sujud tilawah tidak diwajibkan atas kita, hanya bagi siapa yang ingin melakukannya.\" Pada waktu itu beliau tidak sujud, demikian juga dengan orang-orang. Oleh karena itu sebagian ahlul ilmi berpegang pada pendapat ini, juga merupakan pendapatnya Syafi'i dan Ahmad."
    },
    {
        "number": 526,
        "arab": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ عَنْ أَيُّوبَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَرَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْجُدُ فِي ص قَالَ ابْنُ عَبَّاسٍ وَلَيْسَتْ مِنْ عَزَائِمِ السُّجُودِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِي ذَلِكَ فَرَأَى بَعْضُ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ أَنْ يَسْجُدَ فِيهَا وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَابْنِ الْمُبَارَكِ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَقَ و قَالَ بَعْضُهُمْ إِنَّهَا تَوْبَةُ نَبِيٍّ وَلَمْ يَرَوْا السُّجُودَ فِيهَا",
        "id": "Telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan] dari [Ayyub] dari [Ikrimah] dari [Ibnu Abbas] dia berkata, saya telah melihat Rasulullah Sallallahu 'alaihi wasallam sujud tilawah pada surat Shad. Ibnu Abbas berkata, namun tidak termasuk dari ayat-ayat yang ditekankan untuk sujud. Abu 'Isa berkata, ini adalah hadits hasan shahih. Para ahlul ilmi telah berselisih pendapat dalam surat ini. sebagian ahlil ilmi dari kalangan sahabat Nabi Shalallahu 'alaihi wa salam berpendapat adanya sujud tilawah dalam surat, ini juga merupakan pendapat Sufyan ats Tsauri, Ibnul Mubarak, Syafi'i, Ahmad dan Ishaq. Dan sebagian dari mereka berpendapat itu merupakan taubatnya seorang nabi dengan berpendapat tidak adanya sujud tilawah dalam surat tersebut."
    },
    {
        "number": 527,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا ابْنُ لَهِيعَةَ عَنْ مِشْرَحِ بْنِ هَاعَانَ عَنْ عُقْبَةَ بْنِ عَامِرٍ قَالَقُلْتُ يَا رَسُولَ اللَّهِ فُضِّلَتْ سُورَةُ الْحَجِّ بِأَنَّ فِيهَا سَجْدَتَيْنِ قَالَ نَعَمْ وَمَنْ لَمْ يَسْجُدْهُمَا فَلَا يَقْرَأْهُمَاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَيْسَ إِسْنَادُهُ بِذَاكَ الْقَوِيِّ وَاخْتَلَفَ أَهْلُ الْعِلْمِ فِي هَذَا فَرُوِيَ عَنْ عُمَرَ بْنِ الْخَطَّابِ وَابْنِ عُمَرَ أَنَّهُمَا قَالَا فُضِّلَتْ سُورَةُ الْحَجِّ بِأَنَّ فِيهَا سَجْدَتَيْنِ وَبِهِ يَقُولُ ابْنُ الْمُبَارَكِ وَالشَّافِعِيُّ وَأَحْمَدُ وَإِسْحَقُ وَرَأَى بَعْضُهُمْ فِيهَا سَجْدَةً وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَمَالِكٍ وَأَهْلِ الْكُوفَةِ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Ibnu Lahi'ah] dari [Misyrah bin Ha'an] dari ['Uqbah bin 'Amir] dia berkata, saya berkata, wahai Rasulullah Surat Al Haj diberi keutamaan karena di dalamnya terdapat dua ayat sajdah, beliau menjawab: \"Iya, dan siapa yang tidak sujud pada keduanya maka hendaknya jangan membaca keduanya.\" Abu 'Isa berkata, sanad hadits ini tidak sekuat hadits sebelumnya. Ahlul ilmi berselisih pendapat dalam hal ini, diriwayatkan dari Umar bin Khatthab dan Ibnu Umar keduanya berkata, surat Al Haj diberi keutamaan karena di dalamnya terdapat dua ayat sajdah, demikian juga pendapat Ibnul Mubarak, Ahmad, Ishaq. Sedangkan sebagian dari mereka seperti Sufyan Ats Tsauri, Malik dan Ahlul Kufah berpendapat bahwa di dalamnya hanya ada satu ayat sajdah."
    },
    {
        "number": 528,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا مُحَمَّدُ بْنُ يَزِيدَ بْنِ خُنَيْسٍ حَدَّثَنَا الْحَسَنُ بْنُ مُحَمَّدِ بْنِ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ قَالَ قَالَ لِي ابْنُ جُرَيْجٍ يَا حَسَنُ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ عَنْ ابْنِ عَبَّاسٍ قَالَجَاءَ رَجُلٌ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي رَأَيْتُنِي اللَّيْلَةَ وَأَنَا نَائِمٌ كَأَنِّي أُصَلِّي خَلْفَ شَجَرَةٍ فَسَجَدْتُ فَسَجَدَتْ الشَّجَرَةُ لِسُجُودِي فَسَمِعْتُهَا وَهِيَ تَقُولُ اللَّهُمَّ اكْتُبْ لِي بِهَا عِنْدَكَ أَجْرًا وَضَعْ عَنِّي بِهَا وِزْرًا وَاجْعَلْهَا لِي عِنْدَكَ ذُخْرًا وَتَقَبَّلْهَا مِنِّي كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ قَالَ الْحَسَنُ قَالَ لِيَ ابْنُ جُرَيْجٍ قَالَ لِي جَدُّكَ قَالَ ابْنُ عَبَّاسٍ فَقَرَأَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَجْدَةً ثُمَّ سَجَدَ قَالَ فَقَالَ ابْنُ عَبَّاسٍ فَسَمِعْتُهُ وَهُوَ يَقُولُ مِثْلَ مَا أَخْبَرَهُ الرَّجُلُ عَنْ قَوْلِ الشَّجَرَةِقَالَ وَفِي الْبَاب عَنْ أَبِي سَعِيدٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ حَدِيثِ ابْنِ عَبَّاسٍ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Muhammad bin Yazid bin Khunais] telah menceritakan kepada kami [Al Hasan bin Muhammad bin Ubaidullah bin Abu Yazid] dia berkata, [Ibnu Juraij] berkata kepadaku, wahai Hasan, ['Ubaidullah bin Abu Yazid] telah mengabarkan kepadaku, dari [Ibnu Abbas] dia berkata, seorang laki-laki datang kepada Rasulullah Sallallahu 'alaihi wasallam seraya berkata, wahai Rasulullah, semalam saya bermimpi sepertinya saya shalat di belakang sebatang pohon, lalu saya sujud maka pohon itupun ikut sujud dan saya mendengar dia mengucapkan, Ya Allah tuliskanlah untukku pahala dan hapuskanlah dosa atas sujudku ini dan jadikanlah ia sebagai tabungan amal shaleh di sisi-Mu serta terimalah ia sebagai amal shaleh sebagaimana Engkau menerimanya dari hamba-Mu Dawud. Hasan berkata, Ibnu Juraij telah berkata kepadaku, kakekmu telah berkata kepadaku, Ibnu Abbas berkata, Lalu Nabi Shalallahu 'alaihi wa salam membaca Ayat sajdah, maka beliau sujud. Dia (Ibnu Juraij) berkata, Ibnu Abbas berkata, saya mendengar beliau mengucapkan seperti apa yang diucapkan pohon tersebut, sebagaimana dikabarkan laki-laki tadi. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Abu sa'id. Abu Isa berkata, hadits Ibnu Abbas adalah hasan gharib dan Tidak kami ketahui kecuali dari jalur ini."
    },
    {
        "number": 529,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ حَدَّثَنَا خَالِدٌ الْحَذَّاءُ عَنْ أَبِي الْعَالِيَةِ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي سُجُودِ الْقُرْآنِ بِاللَّيْلِ سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ وَشَقَّ سَمْعَهُ وَبَصَرَهُ بِحَوْلِهِ وَقُوَّتِهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Abdul Wahab At Tsaqafi] telah menceritakan kepada kami [Khalid Al Khadza'] dari [Abu Al Aliyah] dari ['Aisyah] dia berkata, adalah Rasulullah Sallallahu 'alaihi wasallam jika sujud Al Qur'an (tilawah) pada malam hari, beliau berdo'a, Wajahku bersujud kepada Dzat yang menciptakannya dan menjadikan untuknya pendengaran dan penglihatan dengan kekuasaan dan kekuatan-Nya. Abu 'Isa berkata, hadits ini ialah hasan shahih."
    },
    {
        "number": 530,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو صَفْوَانَ عَنْ يُونُسَ بْنِ يَزِيدَ عَنْ ابْنِ شِهَابٍ الزُّهْرِيِّ أَنَّ السَّائِبَ بْنَ يَزِيدَ وَعُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ أَخْبَرَاهُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدٍ الْقَارِيِّ قَال سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ يَقُولُقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ نَامَ عَنْ حِزْبِهِ أَوْ عَنْ شَيْءٍ مِنْهُ فَقَرَأَهُ مَا بَيْنَ صَلَاةِ الْفَجْرِ وَصَلَاةِ الظُّهْرِ كُتِبَ لَهُ كَأَنَّمَا قَرَأَهُ مِنْ اللَّيْلِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ قَالَ وَأَبُو صَفْوَانَ اسْمُهُ عَبْدُ اللَّهِ بْنُ سَعِيدٍ الْمَكِّيُّ وَرَوَى عَنْهُ الْحُمَيْدِيُّ وَكِبَارُ النَّاسِ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abu Shafwan] dari [Yunus bin Yazid] dari [Ibnu Syihab Az Zuhri] bahwasannya [As Sa'ib bin Yazid] dan ['Ubaidullah bin Abdullah bin 'Utbah bin Mas'ud] telah mengabarkan kepadanya, dari [Abdurrahman bin Abd Al Qari] dia berkata, saya mendengar [Umar bin Al Khaththab] berkata, Rasulullah Sallallahu 'alaihi wasallam bersabda: \"Barang siapa yang tidur dengan membaca Hizbnya (wiridnya) atau sebagian darinya serta membacanya diantara shalat Shubuh dan Zhuhur, niscaya dituliskan baginya seakan dia membacanya pada malam hari.\" Abu 'Isa berkata, ini adalah hadits hasan shahih, nama Abu Shufyan adalah Abdullah bin Sa'id Al Makky."
    },
    {
        "number": 531,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ مُحَمَّدِ بْنِ زِيَادٍ وَهُوَ أَبُو الْحَارِثِ الْبَصْرِيُّ ثِقَةٌ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ مُحَمَّدٌ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَا يَخْشَى الَّذِي يَرْفَعُ رَأْسَهُ قَبْلَ الْإِمَامِ أَنْ يُحَوِّلَ اللَّهُ رَأْسَهُ رَأْسَ حِمَارٍقَالَ قُتَيْبَةُ قَالَ حَمَّادٌ قَالَ لِي مُحَمَّدُ بْنُ زِيَادٍ وَإِنَّمَا قَالَ أَمَا يَخْشَى قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَمُحَمَّدُ بْنُ زِيَادٍ هُوَ بَصْرِيٌّ ثِقَةٌ وَيُكْنَى أَبَا الْحَارِثِ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Hammad bin Zaid] dari [Muhammad bin Ziyad] dia adalah Abu Harits Al Bashri seorang yang tsiqah, dari [Abu Hurairah] dia berkata, Muhammad Sallallahu 'alaihi wasallam bersabda: \"Tidakkah takut orang yang mengangkat kepalanya sebelum Imam, Allah akan merubah kepalanya menjadi kepala keledai?\". Qutaibah berkata, Hammad berkata, telah berkata kepadaku Muhammad bin Ziyad, adapun sabda beliau \"tidakkah takut\" (berupa ancaman atau terjadi di Barzakh atau di neraka. Pent.). Abu 'Isa berkata, hadits ini hasan shahih dan Muhammad bin Ziyad adalah orang Bashrah yang tsiqah dan memiliki kunyah Abul Harits."
    },
    {
        "number": 532,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ عَنْ عَمْرِو بْنِ دِينَارٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ مُعَاذَ بْنَ جَبَلٍ كَانَ يُصَلِّي مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَغْرِبَ ثُمَّ يَرْجِعُ إِلَى قَوْمِهِ فَيَؤُمُّهُمْقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَصْحَابِنَا الشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَقَ قَالُوا إِذَا أَمَّ الرَّجُلُ الْقَوْمَ فِي الْمَكْتُوبَةِ وَقَدْ كَانَ صَلَّاهَا قَبْلَ ذَلِكَ أَنَّ صَلَاةَ مَنْ ائْتَمَّ بِهِ جَائِزَةٌ وَاحْتَجُّوا بِحَدِيثِ جَابِرٍ فِي قِصَّةِ مُعَاذٍ وَهُوَ حَدِيثٌ صَحِيحٌ وَقَدْ رُوِيَ مِنْ غَيْرِ وَجْهٍ عَنْ جَابِرٍ وَرُوِي عَنْ أَبِي الدَّرْدَاءِ أَنَّهُ سُئِلَ عَنْ رَجُلٍ دَخَلَ الْمَسْجِدَ وَالْقَوْمُ فِي صَلَاةِ الْعَصْرِ وَهُوَ يَحْسِبُ أَنَّهَا صَلَاةُ الظُّهْرِ فَائْتَمَّ بِهِمْ قَالَ صَلَاتُهُ جَائِزَةٌ وَقَدْ قَالَ قَوْمٌ مِنْ أَهْلِ الْكُوفَةِ إِذَا ائْتَمَّ قَوْمٌ بِإِمَامٍ وَهُوَ يُصَلِّي الْعَصْرَ وَهُمْ يَحْسِبُونَ أَنَّهَا الظُّهْرُ فَصَلَّى بِهِمْ وَاقْتَدَوْا بِهِ فَإِنَّ صَلَاةَ الْمُقْتَدِي فَاسِدَةٌ إِذْ اخْتَلَفَ نِيَّةُ الْإِمَامِ وَنِيَّةُ الْمَأْمُومِ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Hammad bin Zaid] dari [Amru bin Dinar] dari [Jabir bin Abdullah] bahwasannya Mu'adz bin Jabal pernah shalat maghrib bersama Rasulullah Sallallahu 'alaihi wasallam, kemudian dia pulang kepada kaumnya dan mengimami mereka. Abu 'Isa berkata, Ini adalah hadits hasan shahih dan diamalkan oleh sahabat-sahabat kami seperti Syafi'i, Ahmad dan Ishaq, mereka semuanya berkata, jika seseorang mengimami suatu kaum dalam shalat fardlu, padahal dia sudah shalat sebelumnya, maka shalat orang yang bermakmum kepadanya hukumnya sah. Mereka berhujjah dengan hadits Abu Darda' tentang shalatnya Mu'adz, itu adalah hadits shahih serta diriwayatkan dari Abu Darda' melalui lebih dari satu sanad. Diriwayatkan bahwa Abu Darda pernah ditanya, apabila seseorang masuk masjid lalu mendapati orang-orang sedang shalat ashar sedangkan dia mengira mereka sedang shalat zhuhur lantas shalat bersama mereka, dia menjawab, shalatnya sah. Para penduduk Kufah (ulama madzhab hanafi. Pent.) berpendapat, jika suatu kaum bermakmum kepada seseorang yang sedang shalat Ashar, sementara mereka mengira dia shalat zhuhur, maka shalat mereka tidak sah karena berbedanya niat Imam dan makmum."
    },
    {
        "number": 533,
        "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنِي غَالِبٌ الْقَطَّانُ عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ الْمُزَنِيِّ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَكُنَّا إِذَا صَلَّيْنَا خَلْفَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِالظَّهَائِرِ سَجَدْنَا عَلَى ثِيَابِنَا اتِّقَاءَ الْحَرِّقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ قَالَ وَفِي الْبَاب عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ وَابْنِ عَبَّاسٍ وَقَدْ رَوَى وَكِيعٌ هَذَا الْحَدِيثَ عَنْ خَالِدِ بْنِ عَبْدِ الرَّحْمَنِ",
        "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad] telah menceritakan kepada kami [Abdullah bin Al Mubarak] telah mengabarkan kepada kami [Khalid bin Abdurrahman] dia berkata, telah menceritakan kepadaku [Ghalib Al Qaththan] dari [Bakr bin Abdullah Al Muzanni] dari [Anas bin Malik] dia berkata, kami pernah shalat dibelakang Nabi Shalallahu 'alaihi wa salam di bawah terik matahari yang sangat panas dan kami sujud di atas baju kami karena khawatir terkena panasnya tanah. Abu 'Isa berkata, ini adalah hadits hasan shahih. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Jabir bin Abdullah dan Ibnu Abbas. [Waki'] juga pernah meriwayatkan hadits ini dari [Khalid bin Abdurrahman]."
    },
    {
        "number": 534,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ سِمَاكِ بْنِ حَرْبٍ عَنْ جَابِرِ بْنِ سَمُرَةَ قَالَكَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا صَلَّى الْفَجْرَ قَعَدَ فِي مُصَلَّاهُ حَتَّى تَطْلُعَ الشَّمْسُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Abu Al Ahwash] dari [Simak bin Harb] dari [Jabir bin Samrah] dia berkata, Apabila Rasulullah Sallallahu 'alaihi wasallam selesai shalat fajar (shubuh), beliau duduk di tempat beliau shalat sampai matahari terbit (untuk berdzikir -Pent). Abu 'Isa berkata, hadits ini adalah hadits hasan shahih."
    },
    {
        "number": 535,
        "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُعَاوِيَةَ الْجُمَحِيُّ الْبَصْرِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُسْلِمٍ حَدَّثَنَا أَبُو ظِلَالٍ عَنْ أَنَسِ بْنِ مَالِكٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَنْ صَلَّى الْغَدَاةَ فِي جَمَاعَةٍ ثُمَّ قَعَدَ يَذْكُرُ اللَّهَ حَتَّى تَطْلُعَ الشَّمْسُ ثُمَّ صَلَّى رَكْعَتَيْنِ كَانَتْ لَهُ كَأَجْرِ حَجَّةٍ وَعُمْرَةٍ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَامَّةٍ تَامَّةٍ تَامَّةٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ قَالَ وَسَأَلْتُ مُحَمَّدَ بْنَ إِسْمَعِيلَ عَنْ أَبِي ظِلَالٍ فَقَالَ هُوَ مُقَارِبُ الْحَدِيثِ قَالَ مُحَمَّدٌ وَاسْمُهُ هِلَالٌ",
        "id": "Telah menceritakan kepada kami [Abdullah bin Mu'awiyah Al Jumahi Al Bashri] telah menceritakan kepada kami [Abdul 'Aziz bin Muslim] telah menceritakan kepada kami [Abu Zhilal] dari [Anas bin Malik] dia berkata, Rasulullah Sallallahu 'alaihi wasallam bersabda: \"Barang siapa yang shalat subuh berjama'ah kemudian duduk berdzikir sampai matahari terbit yang dilanjutkan dengan shalat dua raka'at, maka dia mendapatkan pahala seperti pahala haji dan umrah.\" dia (Anas radliallahu 'anhu) berkata, Rasulullah bersabda: \"Sempurna, sempurna, sempurna.\" dia (Abu 'Isa) berkata, ini adalah hadits hasan gharib, saya bertanya kepada Muhammad bin Isma'il tentang Abu Zhilal, dia menjawab, dia muqaribul hadits (termasuk lafazh ta'dil. Pent), dia juga berkata, namanya adalah Hilal."
    },
    {
        "number": 536,
        "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي هِنْدٍ عَنْ ثَوْرِ بْنِ زَيْدٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَلْحَظُ فِي الصَّلَاةِ يَمِينًا وَشِمَالًا وَلَا يَلْوِي عُنُقَهُ خَلْفَ ظَهْرِهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ وَقَدْ خَالَفَ وَكِيعٌ الْفَضْلَ بْنَ مُوسَى فِي رِوَايَتِهِ حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا وَكِيعٌ عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي هِنْدٍ عَنْ بَعْضِ أَصْحَابِ عِكْرِمَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَلْحَظُ فِي الصَّلَاةِ فَذَكَرَ نَحْوَهُ قَالَ وَفِي الْبَاب عَنْ أَنَسٍ وَعَائِشَةَ",
        "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] dan yang lainnya, mereka berkata, telah menceritakan kepada kami [Al Fadll bin Musa] dari [Abdullah bin Sa'id bin Abu Hindi] dari [Tsaur bin Zaid] dari [Ikrimah] dari [Ibnu Abbas] adalah Rasulullah Sallallahu 'alaihi wasallam waktu shalat melirikkan matanya ke kanan dan ke kiri tanpa menengokkan lehernya kebelakang. Abu 'Isa berkata, ini adalah hadits gharib, dan waki' berbeda dengan Fadll bin Musa dalam periwayatannya yaitu, telah menceritakan kepada kami [Mahmud bin Ghailan], telah menceritakan kepada kami [Waki'] dari [Abdullah bin Sa'id bin Abu Hindun] dari [sebagian sahabat 'Ikrimah], bahwasannya Nabi Sallallahu 'alaihi wasallam apabila shalat, beliau melirikkan (matanya), kemudian dia menuturkan seperti hadits di atas. (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Anas dan 'Aisyah."
    },
    {
        "number": 537,
        "arab": "حَدَّثَنَا أَبُو حَاتِمٍ مُسْلِمُ بْنُ حَاتِمٍ الْبَصْرِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْأَنْصَارِيُّ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ زَيْدٍ عَنْ سَعِيدِ بْنِ الْمُسَيِّبِ قَالَ قَالَ أَنَسُ بْنُ مَالِكٍقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَا بُنَيَّ إِيَّاكَ وَالِالْتِفَاتَ فِي الصَّلَاةِ فَإِنَّ الِالْتِفَاتَ فِي الصَّلَاةِ هَلَكَةٌ فَإِنْ كَانَ لَا بُدَّ فَفِي التَّطَوُّعِ لَا فِي الْفَرِيضَةِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami [Abu Hatim Muslim bin Hatim Al Bashri] telah menceritakan kepada kami [Muhammad bin Abdullah Al Anshari] dari [ayahnya] dari [Ali bin Zaid] dari [Sa'id bin Al Musayyib] dia berkata, [Anas bin Malik] berkata, Rasulullah Shalallahu 'alaihi wa salam bersabda kepadaku: \"Wahai anakku, janganlah kamu menoleh dalam shalat, karena menoleh dalam shalat adalah penyebab kebinasaan, jika kamu terpaksa untuk menoleh dalam shalat, maka lakukanlah dalam shalat sunnah, tidak dalam shalat fardlu'. Abu 'Isa berkata, Ini adalah hadits hasan gharib."
    },
    {
        "number": 538,
        "arab": "حَدَّثَنَا صَالِحُ بْنُ عَبْدِ اللَّهِ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ عَنْ أَبِيهِ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَ قَالَتْسَأَلْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ الِالْتِفَاتِ فِي الصَّلَاةِ قَالَ هُوَ اخْتِلَاسٌ يَخْتَلِسُهُ الشَّيْطَانُ مِنْ صَلَاةِ الرَّجُلِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami [Shalih] telah menceritakan kepada kami [Abu Al Ahwash] dari [Asy'ats bin Abu Asy Sya'tsa'] dari [ayahnya] dari [Masruq] dari ['Aisyah] dia berkata, saya bertanya kepada Rasulullah Sallallahu 'alaihi wasallam tentang menoleh dalam shalat, maka beliau bersabda: \"Menoleh dalam shalat adalah godaan syetan yang memalingkan seseorang dari shalatnya.\" Abu 'Isa berkata, ini adalah hadits hasan gharib."
    },
    {
        "number": 539,
        "arab": "حَدَّثَنَا هِشَامُ بْنُ يُونُسَ الْكُوفِيُّ حَدَّثَنَا الْمُحَارِبِيُّ عَنْ الْحَجَّاجِ بْنِ أَرْطَاةَ عَنْ أَبِي إِسْحَقَ عَنْ هُبَيْرَةَ بْنِ يَرِيمَ عَنْ عَلِيٍّ وَعَنْ عَمْرِو بْنِ مُرَّةَ عَنْ ابْنِ أَبِي لَيْلَى عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَاقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَتَى أَحَدُكُمْ الصَّلَاةَ وَالْإِمَامُ عَلَى حَالٍ فَلْيَصْنَعْ كَمَا يَصْنَعُ الْإِمَامُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْلَمُ أَحَدًا أَسْنَدَهُ إِلَّا مَا رُوِيَ مِنْ هَذَا الْوَجْهِ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ قَالُوا إِذَا جَاءَ الرَّجُلُ وَالْإِمَامُ سَاجِدٌ فَلْيَسْجُدْ وَلَا تُجْزِئُهُ تِلْكَ الرَّكْعَةُ إِذَا فَاتَهُ الرُّكُوعُ مَعَ الْإِمَامِ وَاخْتَارَ عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَنْ يَسْجُدَ مَعَ الْإِمَامِ وَذَكَرَ عَنْ بَعْضِهِمْ فَقَالَ لَعَلَّهُ لَا يَرْفَعُ رَأْسَهُ فِي تِلْكَ السَّجْدَةِ حَتَّى يُغْفَرَ لَهُ",
        "id": "Telah menceritakan kepada kami [Hisyam bin Yunus Al Kufi] telah menceritakan kepada kami [Al Muharibi] dari [Al Hajjaj bin Arthah] dari [Abu Ishaq] dari [Hubairah bin Maryam] dari [Ali] dan dari [Amru bin Murrah] dari [Ibnu Abu Laila] dari [Mu'adz bin Jabal] Rasulullah Sallallahu 'alaihi wasallam bersabda: \"Jika seseorang diantara kalian pergi ke masjid untuk shalat berjama'ah lalu kalian mendapati imam sedang melakukan suatu gerakan dalam shalat, hendaknya ia langsung mengikuti gerakan imam.\" Abu 'Isa berkata, ini adalah hadits gharib, tidak ada seorangpun yang memaushulkan sanadnya kecuali melalui sanad ini, hadits ini juga diamalkan oleh ahlul ilmi, mereka berkata, jika seseorang mendapati imam sedang sujud, hendaknya ia sujud, hal itu tidak dihitung satu raka'at jika tertinggal ruku' bersama imam. Demikian juga Abdullah bin Mubarak lebih memilih untuk sujud bersama imam, sambil menyebutkan perkataan sebagian ulama, Mudah-mudahan Allah mengampuninya sebelum dia mengangkat kepalanya dari sujud tersebut."
    },
    {
        "number": 540,
        "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ أَخْبَرَنَا مَعْمَرٌ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أُقِيمَتْ الصَّلَاةُ فَلَا تَقُومُوا حَتَّى تَرَوْنِي خَرَجْتُقَالَ وَفِي الْبَاب عَنْ أَنَسٍ وَحَدِيثُ أَنَسٍ غَيْرُ مَحْفُوظٍ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي قَتَادَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ كَرِهَ قَوْمٌ مِنْ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ أَنْ يَنْتَظِرَ النَّاسُ الْإِمَامَ وَهُمْ قِيَامٌ و قَالَ بَعْضُهُمْ إِذَا كَانَ الْإِمَامُ فِي الْمَسْجِدِ فَأُقِيمَتْ الصَّلَاةُ فَإِنَّمَا يَقُومُونَ إِذَا قَالَ الْمُؤَذِّنُ قَدْ قَامَتْ الصَّلَاةُ قَدْ قَامَتْ الصَّلَاةُ وَهُوَ قَوْلُ ابْنِ الْمُبَارَكِ",
        "id": "Telah menceritakan kepada kami [Ahmad bin Muhammad] telah mengabarkan kepada kami [Abdullah bin Al Mubarak] telah menceritakan kepada kami [Ma'mar] dari [Yahya bin Abu Katsir] dari [Abdullah bin Abu Qatadah] dari [ayahnya] dia berkata Rasulullah Sallallahu 'alaihi wasallam bersabda: \" Jika Iqamat telah dikumandangkan, janganlah kalian berdiri sebelum melihatku keluar (dari rumah).\" (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari dari Anas. Adapun hadits Anas tidak mahfuzh. Abu 'Isa berkata, hadits Abu Qatadah ialah hadits hasan shahih. Sebagian ahlul ilmi dari kalangan sahabat nabi membenci jika para makmum menunggu imam sambil berdiri. Sebagian dari mereka berkata, Jika Iqamat dikumandangkan dan Imam berada di masjid, maka para makmum berdiri apabila muadzdzin mengucapkan qad qaamatish shalah, ini juga merupakan pendapatnya Abdullah bin Al Mubarak."
    },
    {
        "number": 541,
        "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ عَنْ عَاصِمٍ عَنْ زِرٍّ عَنْ عَبْدِ اللَّهِ قَالَكُنْتُ أُصَلِّي وَالنَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ وَعُمَرُ مَعَهُ فَلَمَّا جَلَسْتُ بَدَأْتُ بِالثَّنَاءِ عَلَى اللَّهِ ثُمَّ الصَّلَاةِ عَلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ دَعَوْتُ لِنَفْسِي فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَلْ تُعْطَهْ سَلْ تُعْطَهْقَالَ وَفِي الْبَاب عَنْ فَضَالَةَ بْنِ عُبَيْدٍ قَالَ أَبُو عِيسَى حَدِيثُ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ حَدِيثٌ حَسَنٌ صَحِيحٌ قَالَ أَبُو عِيسَى هَذَا الْحَدِيثُ رَوَاهُ أَحْمَدُ بْنُ حَنْبَلٍ عَنْ يَحْيَى بْنِ آدَمَ مُخْتَصَرًا",
        "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Yahya bin Adam] telah menceritakan kepada kami [Abu Bakr bin Ayyasy] dari ['Ashim] dari [Zirr] dari [Abdullah] dia berkata, saya pernah shalat bersama Rasulullah Sallallahu 'alaihi wasallam sedangkan Abu bakar dan Umar sedang bersamanya, tatkala saya duduk dan mulai memuji kepada Allah serta shalawat atas Nabi Shalallahu 'alaihi wa salam, kemudian saya berdo'a untuk diriku, maka Nabi Shalallahu 'alaihi wa salam bersabda: \"Mintalah kepada Allah niscaya kamu akan diberi, mintalah kepada Allah niscaya kamu akan diberi.\" (perawi) berkata, dalam bab ini (ada juga riwayat -pent) dari Fudlalah bin 'Ubaid. Abu 'Isa berkata, hadits Abdullah bin Mas'ud merupakan hadits hasan shahih, hadits ini juga diriwayatkan oleh [Ahmad bin Hanbal] dari [Yahya bin Adam] secara ringkas."
    },
    {
        "number": 542,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ الْمُؤَدِّبُ الْبَغْدَادِيُّ الْبَصْرِيُّ حَدَّثَنَا عَامِرُ بْنُ صَالِحٍ الزُّبَيْرِيُّ هُوَ مِنْ وَلَدِ الزُّبَيْرِ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ قَالَتْأَمَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِبِنَاءِ الْمَسَاجِدِ فِي الدُّورِ وَأَنْ تُنَظَّفَ وَتُطَيَّبَحَدَّثَنَا هَنَّادٌ حَدَّثَنَا عَبْدَةُ وَوَكِيعٌ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ فَذَكَرَ نَحْوَهُ قَالَ أَبُو عِيسَى وَهَذَا أَصَحُّ مِنْ الْحَدِيثِ الْأَوَّلِ حَدَّثَنَا ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ عَنْ أَبِيهِ أَنْ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَمَرَ فَذَكَرَ نَحْوَهُ و قَالَ سُفْيَانُ قَوْلُهُ بِبِنَاءِ الْمَسَاجِدِ فِي الدُّورِ يَعْنِي الْقَبَائِلَ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Hatim Al Muaddab Al Baghdadi Al Bashri] telah menceritakan kepada kami ['Amir bin Shalih Az Zubairi], dia merupakan salah satu anaknya Az Zubair telah menceritakan kepada kami [Hisyam bin 'Urwah] dari [ayahnya] dari ['Aisyah] dia berkata, Rasulullah Sallallahu 'alaihi wasallam memerintahkan supaya masjid dibangun di setiap kabilah, selalu dibersihkan dan diberi wewangian. Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami ['Abdah] dan [Waki'] dari [Hisyam bin 'Urwah] dari [ayahnya], Sesungguhnya Nabi Sallallahu 'alaihi wasallam memerintahkan seperti yang dituturkan pada hadits sebelumnya. Abu 'Isa berkata, riwayat ini lebih shahih dari riwayat hadits yang pertama. Telah menceritakan kepada kami [Ibnu Abu Umar] telah menceritakan kepada kami [Sufyan bin'Uyainah] dari [Hisyam bin 'Urwah] dari [ayahnya] bahwasannya Rasulullah Sallallahu 'alaihi wasallam memerintahkan sebagaimana dalam hadits pertama. Sufyan berkata, maksud sabda Nabi \"bi binaail masjid fid duur\" ialah kabilah-kabilah."
    },
    {
        "number": 543,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا شُعْبَةُ عَنْ يَعْلَى بْنِ عَطَاءٍ عَنْ عَلِيٍّ الْأَزْدِيِّ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ اللَّيْلِ وَالنَّهَارِ مَثْنَى مَثْنَىقَالَ أَبُو عِيسَى اخْتَلَفَ أَصْحَابُ شُعْبَةَ فِي حَدِيثِ ابْنِ عُمَرَ فَرَفَعَهُ بَعْضُهُمْ وَأَوْقَفَهُ بَعْضُهُمْ وَرُوِي عَنْ عَبْدِ اللَّهِ الْعُمَرِيِّ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوُ هَذَا وَالصَّحِيحُ مَا رُوِيَ عَنْ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى وَرَوَى الثِّقَاتُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَذْكُرُوا فِيهِ صَلَاةَ النَّهَارِ وَقَدْ رُوِيَ عَنْ عُبَيْدِ اللَّهِ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَ أَنَّهُ كَانَ يُصَلِّي بِاللَّيْلِ مَثْنَى مَثْنَى وَبِالنَّهَارِ أَرْبَعًا وَقَدْ اخْتَلَفَ أَهْلُ الْعِلْمِ فِي ذَلِكَ فَرَأَى بَعْضُهُمْ أَنَّ صَلَاةَ اللَّيْلِ وَالنَّهَارِ مَثْنَى مَثْنَى وَهُوَ قَوْلُ الشَّافِعِيِّ وَأَحْمَدَ و قَالَ بَعْضُهُمْ صَلَاةُ اللَّيْلِ مَثْنَى مَثْنَى وَرَأَوْا صَلَاةَ التَّطَوُّعِ بِالنَّهَارِ أَرْبَعًا مِثْلَ الْأَرْبَعِ قَبْلَ الظُّهْرِ وَغَيْرِهَا مِنْ صَلَاةِ التَّطَوُّعِ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَابْنِ الْمُبَارَكِ وَإِسْحَقَ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Syu'bah] dari [Ya'la bin 'Atha'] dari [Ali Al Azdi] dari [Ibnu Umar] dari Nabi Shalallahu 'alaihi wa salam beliau bersabda: \" Shalat sunnah di waktu malam dan siang hari dilakukan sebanyak dua raka'at- dua raka'at.\" Abu 'Isa berkata, Para sahabat Syu'bah berselisih pendapat mengenai hadits Ibnu Umar, sebagian dari mereka memarfu'kannya dan sebagian lagi memauqufkannya. Diriwayatkan dari [Abdullah Al Umary] dari [Nafi'] dari [Ibnu Umar] dari Nabi Sallallahu 'alaihi wasallam seperti lafazh hadits diatas. Riwayat yang paling shahih ialah riwayat dari Ibnu Umar sesungguhnya Nabi Sallallahu 'alaihi wasallam bersabda: \"Shalat sunnah pada malam hari dilakukan sebanyak dua raka'at-dua raka'at.\" Dan para perawi yang tsiqah meriwayatkan hadits ini dari Ibnu Umar dari Nabi Sallallahu 'alaihi wasallam tanpa menyebut Shalat Nahar (pada siang hari). Dan telah diriwayatkan dari Ubaidullah dari Naf'i dari Ibu Umar bahwasanya beliau shalat sunnah pada malam hari dua raka'at-dua raka'at dan pada siang hari empat raka'at-empat raka'at. Oleh karena itu para ahlul ilmi berselisih pendapat dalam masalah ini, Imam Syafi'i dan Ahmad berpendapat bahwa shalat sunnah pada waktu malam ataupun siang hari sebanyak dua raka'at-dua raka'at, sedangkan Imam Sufyan Ats Tsauri, Ibnu Al Mubarak dan Ishaq berpendapat bahwa shalat sunnah pada malam hari dua raka'at-dua raka'at dan pada siang hari empat raka'at-empat raka'at seperti shalat sunnah empat raka'at sebelum zhuhur maupun shalat sunnah yang lainnya."
    },
    {
        "number": 544,
        "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ قَالَسَأَلْنَا عَلِيًّا عَنْ صَلَاةِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ النَّهَارِ فَقَالَ إِنَّكُمْ لَا تُطِيقُونَ ذَاكَ فَقُلْنَا مَنْ أَطَاقَ ذَاكَ مِنَّا فَقَالَ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا كَانَتْ الشَّمْسُ مِنْ هَاهُنَا كَهَيْئَتِهَا مِنْ هَاهُنَا عِنْدَ الْعَصْرِ صَلَّى رَكْعَتَيْنِ وَإِذَا كَانَتْ الشَّمْسُ مِنْ هَاهُنَا كَهَيْئَتِهَا مِنْ هَاهُنَا عِنْدَ الظُّهْرِ صَلَّى أَرْبَعًا وَصَلَّى أَرْبَعًا قَبْلَ الظُّهْرِ وَبَعْدَهَا رَكْعَتَيْنِ وَقَبْلَ الْعَصْرِ أَرْبَعًا يَفْصِلُ بَيْنَ كُلِّ رَكْعَتَيْنِ بِالتَّسْلِيمِ عَلَى الْمَلَائِكَةِ الْمُقَرَّبِينَ وَالنَّبِيِّينَ وَالْمُرْسَلِينَ وَمَنْ تَبِعَهُمْ مِنْ الْمُؤْمِنِينَ وَالْمُسْلِمِينَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ عَنْ أَبِي إِسْحَقَ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ و قَالَ إِسْحَقُ بْنُ إِبْرَاهِيمَ أَحْسَنُ شَيْءٍ رُوِيَ فِي تَطَوُّعِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي النَّهَارِ هَذَا وَرُوِي عَنْ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ أَنَّهُ كَانَ يُضَعِّفُ هَذَا الْحَدِيثَ وَإِنَّمَا ضَعَّفَهُ عِنْدَنَا وَاللَّهُ أَعْلَمُ لِأَنَّهُ لَا يُرْوَى مِثْلُ هَذَا عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَّا مِنْ هَذَا الْوَجْهِ عَنْ عَاصِمِ بْنِ ضَمْرَةَ عَنْ عَلِيٍّ وَعَاصِمُ بْنُ ضَمْرَةَ هُوَ ثِقَةٌ عِنْدَ بَعْضِ أَهْلِ الْعِلْمِ قَالَ عَلِيُّ بْنُ الْمَدِينِيِّ قَالَ يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ قَالَ سُفْيَانُ كُنَّا نَعْرِفُ فَضْلَ حَدِيثِ عَاصِمِ بْنِ ضَمْرَةَ عَلَى حَدِيثِ الْحَارِثِ",
        "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Wahb bin Jarir] telah menceritakan kepada kami [Syu'bah] dari [Abu Ishaq] dari ['Ashim bin Dlamrah] dia berkata, kami bertanya kepada [Ali] tentang shalatnya Rasulullah Sallallahu 'alaihi wasallam pada siang hari?, dia menjawab, sungguh kalian tidak sanggup untuk melakukannya, kami bertanya, lantas siapa diantara kami yang sanggup melakukannya? Dia menjawab, adalah Rasulullah Sallallahu 'alaihi wasallam apabila matahari terbit dari timur seperti waktu terbenamnya di waktu ashar beliau shalat dua raka'at, dan apabila matahari terbit dari timur pada waktu zhuhur shalat empat raka'at kemudian shalat empat raka'at sebelum shalat zhuhur, setelahnya dua raka'at kemudian shalat empat raka'at sebelum ashar, setiap selesai dua raka'at senantiasa mengucapkan salam kepada para malaikat muqarrabin, para Nabi dan mursalin dan siapa saja yang menempuh jalan mereka dari kaum mukminin dan muslimin. Telah menceritakan kepada kami [Muhammad bin Al Mutsanna] telah menceritakan kepada kami [Muhammad bin Ja'far] telah menceritakan kepada kami [Syu'bah] dari [Abi Ishaq] dari ['Ashim bin Dlamrah] dari [Ali] dari Nabi Sallallahu 'alaihi wasallam seperti hadits di atas. Abu 'Isa berkata, ini adalah hadits hasan. Ishaq bin Ibrahim berkata, ini adalah sebaik-baik hadits yang berbicara tentang tathawwu'nya (shalat sunnah) Nabi Sallallahu 'alaihi wasallam pada waktu siang. Diriwayatkan dari Abdullah bin Mubarak, bahwasanya beliau melemahkan hadits ini, hal itu dikarenakan -wallahu 'alam- karena hadits ini hanya diriwayatkan melalui jalur ini saja yaitu dari 'Ashim bin Dlamrah dari Ali, padahal 'Ashim bin Dlamrah seorang yang tsiqah menurut sebagian ahlul ilmu. Ali bin Al Madini berkata, Yahya bin Sa'id Al Qaththan berkata, Sufyan berkata, kami mengetahui hadits 'Ashim bin Dlamrah lebih utama dari hadits Harits."
    },
    {
        "number": 545,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ عَنْ أَشْعَثَ وَهُوَ ابْنُ عَبْدِ الْمَلِكِ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ عَنْ عَائِشَةَ قَالَتْكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُصَلِّي فِي لُحُفِ نِسَائِهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رُخْصَةٌ فِي ذَلِكَ",
        "id": "Telah menceritakan kepada kami [Mahammad bin Abdul A'la] telah menceritakan kepada kami [Khalid bin Harits] dari [Asy'ats dia adalah Ibnu Abdul Malik] dari [Muhammad bin Sirin] dari [Abdullah bin Syaqiq] dari ['Aisyah] dia berkata, Rasulullah sallallahu 'alaihi wasallam tidak pernah shalat dengan mengenakan pakaian istri-istrinya. Abu 'Isa berkata, ini adalah hadits hasan shahih. Telah diriwayatkan dari Nabi sallallahu 'alaihi wasallam akan keringanan untuk mengenakannya."
    },
    {
        "number": 546,
        "arab": "حَدَّثَنَا أَبُو سَلَمَةَ يَحْيَى بْنُ خَلَفٍ حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ عَنْ بُرْدِ بْنِ سِنَانٍ عَنْ الزُّهْرِيِّ عَنْ عُرْوَةَ عَنْ عَائِشَةَ قَالَتْجِئْتُ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي فِي الْبَيْتِ وَالْبَابُ عَلَيْهِ مُغْلَقٌ فَمَشَى حَتَّى فَتَحَ لِي ثُمَّ رَجَعَ إِلَى مَكَانِهِ وَوَصَفَتْ الْبَابَ فِي الْقِبْلَةِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami [Abu salamah Yahya bin Khalaf] telah menceritakan kepada kami [Bisyr bin Al Mufadldlal] dari [Burd bin Sinan] dari [Az Zuhri] dari ['Urwah] dari ['Aisyah] dia berkata, saya menemui Rasulullah Shalallahu 'alaihi wa salam ketika beliau sedang shalat dan pintu rumah tertutup, kemudian beliau berjalan membukakan pintu lalu kembali ke tempatnya semula. (Diriwayatkan) bahwa 'Aisyah mensifati pintunya di arah qiblat. Abu 'Isa berkata, ini adalah hadits hasan gharib."
    },
    {
        "number": 547,
        "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ الْأَعْمَشِ قَال سَمِعْتُ أَبَا وَائِلٍ قَالَسَأَلَ رَجُلٌ عَبْدَ اللَّهِ عَنْ هَذَا الْحَرْفِ{ غَيْرِ آسِنٍ }أَوْ{ يَاسِنٍ }قَالَ كُلَّ الْقُرْآنِ قَرَأْتَ غَيْرَ هَذَا الْحَرْفِ قَالَ نَعَمْ قَالَ إِنَّ قَوْمًا يَقْرَءُونَهُ يَنْثُرُونَهُ نَثْرَ الدَّقَلِ لَا يُجَاوِزُ تَرَاقِيَهُمْ إِنِّي لَأَعْرِفُ السُّوَرَ النَّظَائِرَ الَّتِي كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرُنُ بَيْنَهُنَّ قَالَ فَأَمَرْنَا عَلْقَمَةَ فَسَأَلَهُ فَقَالَ عِشْرُونَ سُورَةً مِنْ الْمُفَصَّلِ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقْرُنُ بَيْنَ كُلِّ سُورَتَيْنِ فِي رَكْعَةٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Daud] dia berkata, telah memberitakan kepada kami [Syu'bah] dari [Al A'masy] dia berkata, saya mendengar [Abu Wa`il] berkata, seorang lelaki bertanya kepada [Abdullah bin Mas'ud] tentang satu kata dalam Al Qur'an yaitu Ghairu aasin atau Ghoiru yaasin, dia (Ibnu Mas'ud) balik bertanya, apakah isi Al Qur'an selain kata ini sudah kau baca semua? Dia menjawab, iya. Lantas (Ibnu Mas'ud) berkata, sesungguhnya ada suatu kaum yang membaca Al Quran tanpa bertadabbur dan tidak menghayatinya, bacaan mereka tidak sampai melewati tenggorokan mereka (tidak masuk ke dalam hati), dan sungguh saya mengetahui surat-surat Al Qur'an yang semisal (baik dalam makna, hukum, peringatan, dan kisah-kisahnya. Pent) yang Rasulullah Shalallahu 'alaihi wa salam sering menggabungkan surat-surat tersebut dalam shalat, Abu wail berkata, lalu kami menyuruh 'Alqamah untuk bertanya, dia (Ibnu Mas'ud) menjawab, Jumlahnya dua puluh surat dari golongan Al Mufashsal (dari surat Qaf sampai akhir surat) Nabi sallallahu 'alaihi wasallam sering membaca dua surat dalam satu raka'at. Abu 'Isa berkata, ini adalah hadits hasan shahih."
    },
    {
        "number": 548,
        "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ الْأَعْمَشِ سَمِعَ ذَكْوَانَ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ إِذَا تَوَضَّأَ الرَّجُلُ فَأَحْسَنَ الْوُضُوءَ ثُمَّ خَرَجَ إِلَى الصَّلَاةِ لَا يُخْرِجُهُ أَوْ قَالَ لَا يَنْهَزُهُ إِلَّا إِيَّاهَا لَمْ يَخْطُ خُطْوَةً إِلَّا رَفَعَهُ اللَّهُ بِهَا دَرَجَةً أَوْ حَطَّ عَنْهُ بِهَا خَطِيئَةًقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan] telah menceritakan kepada kami [Abu Daud] dia berkata, telah memberitakan kepada kami [Syu'bah] dari [Al A'masy] dia mendengar [Dzakwan] dari [Abu Hurairah] dari Nabi sallallahu 'alaihi wasallam beliau bersabda: \"Jika seseorang berwudlu' dengan menyempurnakan wudlu'nya kemudian keluar untuk shalat dan tidak ada niatan lain kecuali untuk melaksanakan shalat, maka Allah akan mengangkat derajatnya di sisiNya atau menghapuskan satu dosa darinya.\" Abu 'Isa berkata, ini adalah hadits hasan shahih."
    },
    {
        "number": 549,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا إِبْرَاهِيمُ بْنُ أَبِي الْوَزِيرِ الْبَصْرِيُّ ثِقَة حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى عَنْ سَعْدِ بْنِ إِسْحَقَ بْنِ كَعْبِ بْنِ عُجْرَةَ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَصَلَّى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي مَسْجِدِ بَنِي عَبْدِ الْأَشْهَلِ الْمَغْرِبَ فَقَامَ نَاسٌ يَتَنَفَّلُونَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْكُمْ بِهَذِهِ الصَّلَاةِ فِي الْبُيُوتِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ مِنْ حَدِيثِ كَعْبِ بْنِ عُجْرَةَ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَالصَّحِيحُ مَا رُوِيَ عَنْ ابْنِ عُمَرَ قَالَ كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي الرَّكْعَتَيْنِ بَعْدَ الْمَغْرِبِ فِي بَيْتِهِ قَالَ أَبُو عِيسَى وَقَدْ رُوِيَ عَنْ حُذَيْفَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الْمَغْرِبَ فَمَا زَالَ يُصَلِّي فِي الْمَسْجِدِ حَتَّى صَلَّى الْعِشَاءَ الْآخِرَةَ فَفِي الْحَدِيثِ دِلَالَةٌ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَّى الرَّكْعَتَيْنِ بَعْدَ الْمَغْرِبِ فِي الْمَسْجِدِ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Ibrahim bin Abu Wazir Al Bashri] dia adalah seorang yang tsiqah, telah menceritakan kepada kami [Muhammad bin Musa] dari [Sa'ad bin Ishaq bin Ka'ab bin 'Ujrah] dari [ayahnya] dari [kakeknya] dia berkata, suatu ketika Nabi sallallahu 'alaihi wasallam shalat maghrib di masjid Bani Asyhal, setelah selesai orang-orang berdiri untuk melaksanakan shalat nafilah, maka Nabi Shalallahu 'alaihi wa salam bersabda: \"Hendaknya kalian mengerjakan shalat nafilah ini di rumah kalian.\" Abu 'Isa berkata, ini adalah hadits gharib karena tidak diriwayatkan kecuali dari sanad ini. Yang lebih shahih ialah hadits yang diriwayatkan dari Ibnu Umar, beliau berkata, Rasulullah sallallahu 'alaihi wasallam senantiasa shalat dua raka'at setelah maghrib di rumahnya. Abu 'Isa berkata, telah diriwayatkan dari Hudzaifah, sesungguhnya Nabi Shallallaahu 'alaihi wasallam shalat maghrib dan masih terus melakukan shalat sampai selesai melakukan shalat isya'. Hadits diatas dengan jelas menunjukan bahwa Nabi Shallallaahu 'alaihi wasallam mengerjakan shalat dua raka'at setelah maghrib di masjid."
    },
    {
        "number": 550,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ الْأَغَرِّ بْنِ الصَّبَّاحِ عَنْ خَلِيفَةَ بْنِ حُصَيْنٍ عَنْ قَيْسِ بْنِ عَاصِمٍأَنَّهُ أَسْلَمَ فَأَمَرَهُ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَغْتَسِلَ بِمَاءٍ وَسِدْرٍقَالَ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَالْعَمَلُ عَلَيْهِ عِنْدَ أَهْلِ الْعِلْمِ يَسْتَحِبُّونَ لِلرَّجُلِ إِذَا أَسْلَمَ أَنْ يَغْتَسِلَ وَيَغْسِلَ ثِيَابَهُ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Abdurrahman bin Mahdi] telah menceritakan kepada kami [Sufyan] dari [Al Agharr bin As Shabbah] dari [Khalifah bin Hushain] dari [Qais bin 'Ashim] setelah dia masuk Islam, Nabi Shalallahu 'alaihi wa salam menyuruhnya untuk mandi dengan air dan daun bidara. Abu 'Isa berkata, hadits semakna juga diriwayatkan dari Abu Hurairah dan ini adalah hadits hasan, kami tidak mengetahuinya kecuali dari jalur ini. Ahlul ilmi mengamalkannya dengan berpendapat sunnah bagi orang yang baru masuk Islam untuk mandi dan mencuci pakaiannya."
    },
    {
        "number": 551,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ حَدَّثَنَا الْحَكَمُ بْنُ بَشِيرِ بْنِ سَلْمَانَ حَدَّثَنَا خَلَّادٌ الصَّفَّارُ عَنْ الْحَكَمِ بْنِ عَبْدِ اللَّهِ النَّصْرِيِّ عَنْ أَبِي إِسْحَقَ عَنْ أَبِي جُحَيْفَةَ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ سَتْرُ مَا بَيْنَ أَعْيُنِ الْجِنِّ وَعَوْرَاتِ بَنِي آدَمَ إِذَا دَخَلَ أَحَدُهُمْ الْخَلَاءَ أَنْ يَقُولَ بِسْمِ اللَّهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَإِسْنَادُهُ لَيْسَ بِذَاكَ الْقَوِيِّ وَقَدْ رُوِيَ عَنْ أَنَسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَشْيَاءُ فِي هَذَا",
        "id": "Telah menceritakan kepada kami [Muhammad bin Humaid Ar Razi] telah menceritakan kepada kami [Al Hakam bin Basyir bin Sulaiman] telah menceritakan kepada kami [Khallad As Shafar] dari [Al Hakam bin Abdullah An Nashri] dari [Abu Ishaq] dari [Abu Juhaifah] dari [Ali bin Abu Thalib radliallahu 'anhu] bahwasannya Rasulullah Shallallaahu 'alaihi wasallam bersabda: \"Penghalang antara pandangan mata jin dan aurat bani Adam ketika salah seorang kalian masuk ke toilet ialah dia membaca Bismillah.\" Abu 'Isa berkata, ini adalah hadits gharib yang tidak kami ketahui kecuali dari jalur ini dan sanadnya juga tidak kuat. Telah diriwayatkan dari Anas dari Nabi Shallallaahu 'alaihi wasallam beberapa hadits dalam masalah ini."
    },
    {
        "number": 552,
        "arab": "حَدَّثَنَا أَبُو الْوَلِيدِ أَحْمَدُ بْنُ بَكَّارٍ الدِّمَشْقِيُّ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ قَالَ قَالَ صَفْوَانُ بْنُ عَمْرٍو أَخْبَرَنِي يَزِيدُ بْنُ خُمَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ أُمَّتِي يَوْمَ الْقِيَامَةِ غُرٌّ مِنْ السُّجُودِ مُحَجَّلُونَ مِنْ الْوُضُوءِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ عَبْدِ اللَّهِ بْنِ بُسْرٍ",
        "id": "Telah menceritakan kepada kami [Abu Al Walid Ahmad bin Bakkar Ad Dimasyqi] telah menceritakan kepada kami [Al Walid bin Muslim] dia berkata, [Shafwan bin Amru] berkata, telah mengabarkan kepadaku [Yazid bin Khumair] dari [Abdullah bin Busr] dari Nabi Shalallahu 'alaihi wa salam beliau bersabda: \"Ummatku akan datang hari kiamat kelak wajah mereka putih bersinar dari bekas sujud dan putih bersinar dari bekas wudlu'.\" Abu 'Isa berkata, ini adalah hadits hasan shahih gharib dari riwayat ini dari hadits Abdullah bin Busr."
    },
    {
        "number": 553,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو الْأَحْوَصِ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ عَنْ أَبِيهِ عَنْ مَسْرُوقٍ عَنْ عَائِشَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يُحِبُّ التَّيَمُّنَ فِي طُهُورِهِ إِذَا تَطَهَّرَ وَفِي تَرَجُّلِهِ إِذَا تَرَجَّلَ وَفِي انْتِعَالِهِ إِذَا انْتَعَلَقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَأَبُو الشَّعْثَاءِ اسْمُهُ سُلَيْمُ بْنُ أَسْوَدَ الْمُحَارِبِيُّ",
        "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Abu Al Ahwash] dari [Asy'ats bin Abu Asy Sya'tsa'] dari [ayahnya] dari [Masruq] dari ['Aisyah] bahwasannya Rasulullah Shallallaahu 'alaihi wasallam suka tayammun (mendahulukan anggota badan sebelah kanan) baik ketika bersuci, menyisir rambut atau jenggot maupun memakai sandal.\" Abu 'Isa berkata, ini adalah hadits hasan shahih dan Abu Sy'atsa' namanya ialah Sulaim bin Aswad Al Muharibi."
    },
    {
        "number": 554,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا وَكِيعٌ عَنْ شَرِيكٍ عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى عَنْ ابْنِ جَبْرٍ عَنْ أَنَسِ بْنِ مَالِكٍأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ يُجْزِئُ فِي الْوُضُوءِ رِطْلَانِ مِنْ مَاءٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ شَرِيكٍ عَلَى هَذَا اللَّفْظِ وَرَوَى شُعْبَةُ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ جَبْرٍ عَنْ أَنَسِ بْنِ مَالِكٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَوَضَّأُ بِالْمَكُّوكِ وَيَغْتَسِلُ بِخَمْسَةِ مَكَاكِيَّ وَرُوِي عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى عَنْ عَبْدِ اللَّهِ بْنِ جَبْرٍ عَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَوَضَّأُ بِالْمُدِّ وَيَغْتَسِلُ بِالصَّاعِ وَهَذَا أَصَحُّ مِنْ حَدِيثِ شَرِيكٍ",
        "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Waki'] dari [Syarik] dari [Abdullah bin 'Isa] dari [Ibnu Jabr] dari [Anas bin Malik] bahwasannya Rasulullah Shallallaahu 'alaihi wasallam bersabda: \"Wudlu itu cukup dengan dua liter air.\" Abu 'Isa berkata, ini adalah hadits gharib, tidak kami ketahui hadits ini dengan lafazh diatas kecuali dari riwayat Syarik. [Syu'bah] meriwayatkan dari [Abdullah bin Abdullah bin Jabr] dari [Anas bin Malik] bahwasannya Rasulullah Shallallaahu 'alaihi wasallam berwudlu' dengan satu mud air (kira-kira 600 ml. Pent) dan mandi dengan lima mud air. Diriwayatkan dari [Sufyan Ats Tsauri] dari [Abdullah bin 'Isa] dari [Abdullah bin Jabr] dari [Anas bin Malik] bahwasannya Nabi Shallallaahu 'alaihi wasallam berwudlu dengan satu mud air dan mandi dengan satu sha' air, hadits ini lebih shahih daripada hadits riwayat Syarik."
    },
    {
        "number": 555,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ حَدَّثَنِي أَبِي عَنْ قَتَادَةَ عَنْ أَبِي حَرْبِ بْنِ أَبِي الْأَسْوَدِ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي بَوْلِ الْغُلَامِ الرَّضِيعِ يُنْضَحُ بَوْلُ الْغُلَامِ وَيُغْسَلُ بَوْلُ الْجَارِيَةِقَالَ قَتَادَةُ وَهَذَا مَا لَمْ يَطْعَمَا فَإِذَا طَعِمَا غُسِلَا جَمِيعًا قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ رَفَعَ هِشَامٌ الدَّسْتُوَائِيُّ هَذَا الْحَدِيثَ عَنْ قَتَادَةَ وَأَوْقَفَهُ سَعِيدُ بْنُ أَبِي عَرُوبَةَ عَنْ قَتَادَةَ وَلَمْ يَرْفَعْهُ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar] telah menceritakan kepada kami [Mu'adz bin Hisyam] telah meceritakan kepadaku [ayahku] dari [Qatadah] dari [Abu Harb bin Abu Al Aswad] dari [ayahnya] dari [Ali bin Abu Thalib] radliallahu 'anhu bahwasannya Rasulullah Shallallaahu 'alaihi wasallam bersabda mengenai air kencing bayi yang masih menyusu: \" Pakaian yang terkena air kencing bayi laki-laki cukup diperciki air sedangkan jika terkena air kencing bayi perempuan maka harus dicuci.\" Qatadah berkata, hal ini jika keduanya belum memakan makanan, jika sudah memakan makanan maka keduanya harus dicuci. Abu 'Isa berkata, ini adalah hadits hasan shahih, Hisyam Al Dustuwani memarfu'kan hadits ini dari Qatadah, sedangkan Sa'id bin Abu 'Uwanah memauqufkannya kepada Qatadah."
    },
    {
        "number": 556,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا خَالِدُ بْنُ زِيَادٍ عَنْ مُقَاتِلِ بْنِ حَيَّانَ عَنْ شَهْرِ بْنِ حَوْشَبٍ قَالَرَأَيْتُ جَرِيرَ بْنَ عَبْدِ اللَّهِ تَوَضَّأَ وَمَسَحَ عَلَى خُفَّيْهِ قَالَ فَقُلْتُ لَهُ فِي ذَلِكَ فَقَالَ رَأَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَوَضَّأَ فَمَسَحَ عَلَى خُفَّيْهِ فَقُلْتُ لَهُ أَقَبْلَ الْمَائِدَةِ أَمْ بَعْدَ الْمَائِدَةِ قَالَ مَا أَسْلَمْتُ إِلَّا بَعْدَ الْمَائِدَةِحَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ قَالَ حَدَّثَنَا نُعَيْمُ بْنُ مَيْسَرَةَ النَّحْوِيُّ عَنْ خَالِدِ بْنِ زِيَادٍ نَحْوَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ مِثْلَ هَذَا إِلَّا مِنْ حَدِيثِ مُقَاتِلِ بْنِ حَيَّانَ عَنْ شَهْرِ بْنِ حَوْشَبٍ",
        "id": "Telah menceritakan kepada kami [Qutaibah] telah menceritakan kepada kami [Khalid bin Ziyad] dari [Muqatil bin Hayyan] dari [Syahr bin Hausyab] dia berkata, saya melihat [Jarir bin Abdullah] berwudlu' lalu dia mengusap kedua sandalnya, dia (Syahr radliallahu 'anhu) berkata, saya bertanya kepadanya mengenai hal itu, dia menjawab, saya telah melihat Nabi Shallallaahu 'alaihi wasallam berwudlu lalu mengusap kedua sandalnya, saya bertanya kepadanya, sebelum turun surat Al Maidah ataukah sesudahnya? Dia menjawab, tidaklah saya masuk Islam kecuali setelah turunnya surat Al Maidah. Telah menceritakan kepada kami [Muhammad bin Humaid Al Razi] dia berkata, telah menceritakan kepada kami [Nu'aim bin Maisarah Al Nahwi] dari [Khalid bin Ziyad] seperti hadits diatas. Abu 'Isa berkata, ini adalah hadits gharib, kami tidak mengetahui yang semisal dengan ini kecuali dari haditsnya Muqatil bin Hayyan dari Syahr bin Hausyab."
    },
    {
        "number": 557,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا قَبِيصَةُ عَنْ حَمَّادِ بْنِ سَلَمَةَ عَنْ عَطَاءٍ الْخُرَاسَانِيِّ عَنْ يَحْيَى بْنِ يَعْمَرَ عَنْ عَمَّارٍأَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ رَخَّصَ لِلْجُنُبِ إِذَا أَرَادَ أَنْ يَأْكُلَ أَوْ يَشْرَبَ أَوْ يَنَامَ أَنْ يَتَوَضَّأَ وُضُوءَهُ لِلصَّلَاةِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Hannad] telah menceritakan kepada kami [Qabishah] dari [Hammad bin Salamah] dari ['Atha' Al Khurasani] dari [Yahya bin Ya'mar] dari ['Ammar] bahwasannya Nabi Shallallaahu 'alaihi wasallam memberi keringanan bagi orang yang junub, jika ingin makan dan minum atau tidur hendaknya ia berwudlu' seperti wudlu' untuk shalat. Abu 'Isa berkata, ini merupakan hadits hasan shahih."
    },
    {
        "number": 558,
        "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي زِيَادٍ الْقَطَوَانِيُّ الْكُوفِيُّ حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى حَدَّثَنَا غَالِبٌ أَبُو بِشْرٍ عَنْ أَيُّوبَ بْنِ عَائِذٍ الطَّائِيِّ عَنْ قَيْسِ بْنِ مُسْلِمٍ عَنْ طَارِقِ بْنِ شِهَابٍ عَنْ كَعْبِ بْنِ عُجْرَةَ قَالَقَالَ لِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أُعِيذُكَ بِاللَّهِ يَا كَعْبَ بْنَ عُجْرَةَ مِنْ أُمَرَاءَ يَكُونُونَ مِنْ بَعْدِي فَمَنْ غَشِيَ أَبْوَابَهُمْ فَصَدَّقَهُمْ فِي كَذِبِهِمْ وَأَعَانَهُمْ عَلَى ظُلْمِهِمْ فَلَيْسَ مِنِّي وَلَسْتُ مِنْهُ وَلَا يَرِدُ عَلَيَّ الْحَوْضَ وَمَنْ غَشِيَ أَبْوَابَهُمْ أَوْ لَمْ يَغْشَ فَلَمْ يُصَدِّقْهُمْ فِي كَذِبِهِمْ وَلَمْ يُعِنْهُمْ عَلَى ظُلْمِهِمْ فَهُوَ مِنِّي وَأَنَا مِنْهُ وَسَيَرِدُ عَلَيَّ الْحَوْضَ يَا كَعْبَ بْنَ عُجْرَةَ الصَّلَاةُ بُرْهَانٌ وَالصَّوْمُ جُنَّةٌ حَصِينَةٌ وَالصَّدَقَةُ تُطْفِئُ الْخَطِيئَةَ كَمَا يُطْفِئُ الْمَاءُ النَّارَ يَا كَعْبَ بْنَ عُجْرَةَ إِنَّهُ لَا يَرْبُو لَحْمٌ نَبَتَ مِنْ سُحْتٍ إِلَّا كَانَتْ النَّارُ أَوْلَى بِهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ عُبَيْدِ اللَّهِ بْنِ مُوسَى وَأَيُّوبُ بْنُ عَائِذٍ الطَّائِيُّ يُضَعَّفُ وَيُقَالُ كَانَ يَرَى رَأْيَ الْإِرْجَاءِ وَسَأَلْتُ مُحَمَّدًا عَنْ هَذَا الْحَدِيثِ فَلَمْ يَعْرِفْهُ إِلَّا مِنْ حَدِيثِ عُبَيْدِ اللَّهِ بْنِ مُوسَى وَاسْتَغْرَبَهُ جِدًّا و قَالَ مُحَمَّدٌ حَدَّثَنَا ابْنُ نُمَيْرٍ عَنْ عُبَيْدِ اللَّهِ بْنِ مُوسَى عَنْ غَالِبٍ بِهَذَا",
        "id": "Telah menceritakan kepada kami [Abdullah bin Abu Ziyad Al Qathawani Al Kufi] telah menceritakan kepada kami ['Ubaidullah bin Musa] telah menceritakan kepada kami [Ghalib Abu Bisyr] dari [Ayyub bin 'A`idz Ath Tha'i] dari [Qais bin Muslim] dari [Thariq bin Syihab] dari [Ka'ab bin 'Ujrah] dia berkata, Rasulullah Shallallaahu 'alaihi wasallam bersabda kepadaku: \"Wahai Ka'ab, saya memohon perlindungan kepada Allah untukmu dari perbuatan para penguasa setelahku. Barang siapa yang mendatangi mereka lalu mempercayai kedustaan mereka serta membantu mereka dalam berbuat dlalim, maka dia bukan dari golonganku juga tidak dapat melewati Haudlku (telaga) kelak. Dan barang siapa yang mendatangi mereka atau tidak mendatangi mereka dan tidak membenarkan kedustaan mereka juga tidak membantu mereka dalam berbuat dlalim, maka dia termasuk dari golonganku dan saya termasuk dari golongannya serta dapat mendatangi Haudku (telaga) kelak. Wahai Ka'ab bin 'Ujrah, shalat merupakan tanda keimanan, puasa ialah tameng yang kokoh, serta sedekah dapat menghapuskan dosa sebagaimana air memadamkan api. Wahai Ka'ab bin 'Ujrah, tidaklah daging manusia tumbuh dari barang yang haram kecuali Neraka lebih berhak atasnya.\" Abu 'Isa berkata, hadits ini gharib melalui sanad ini dan tidak kami ketahui kecuali dari haditsnya Ubaidullah bin Musa dan Ayyub bin 'A`idz Ath Thai' dilemahkan bahkan dikabarkan dia menganut paham Murji`ah. Saya bertanya kepada Muhammad, akan tetapi dia tidak mengetahuinya kecuali dari hadits Ubaidullah bin Musa, bahkan hadits ini terasa asing baginya. [Muhammad] juga berkata, telah menceritakan kepada kami [Ibnu Numair] dari [Ubaidullah bin Musa] dari [Ghalib] seperti hadits di atas."
    },
    {
        "number": 559,
        "arab": "حَدَّثَنَا مُوسَى بْنُ عَبْدِ الرَّحْمَنِ الْكِنْدِيُّ الْكُوفِيُّ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ أَخْبَرَنَا مُعَاوِيَةُ بْنُ صَالِحٍ حَدَّثَنِي سُلَيمُ بْنُ عَامِرٍ قَال سَمِعْتُ أَبَا أُمَامَةَ يَقُولُسَمِعْتَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ فِي حَجَّةِ الْوَدَاعِ فَقَالَ اتَّقُوا اللَّهَ رَبَّكُمْ وَصَلُّوا خَمْسَكُمْ وَصُومُوا شَهْرَكُمْ وَأَدُّوا زَكَاةَ أَمْوَالِكُمْ وَأَطِيعُوا ذَا أَمْرِكُمْ تَدْخُلُوا جَنَّةَ رَبِّكُمْقَالَ فَقُلْتُ لِأَبِي أُمَامَةَ مُنْذُ كَمْ سَمِعْتَ مِنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذَا الْحَدِيثِ قَالَ سَمِعْتُهُ وَأَنَا ابْنُ ثَلَاثِينَ سَنَةً قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Musa bin Abdurrahman Al Kindi Al Kufi] telah menceritakan kepada kami [Zaid bin Al Khubab] telah mengabarkan kepada kami [Mu'awiyah bin Shalih] telah meceritakan kepadaku [Sulaim bin 'Amir] dia berkata, saya mendengar [Abu Umamah] berkata, saya telah mendengar khutbah Rasulullah Shallallaahu 'alaihi wasallam ketika haji wada', beliau bersabda: \"Bertakwalah kepada Allah Rabb kalian, kerjakanlah shalat lima waktu, berpuasalah di bulan Ramadlan, tunaikanlah zakat mal kalian, dan taatilah pemimpin kalian, niscaya kalian masuk surga Rabb kalian.\" Dia (Sulaim bin 'Amir) berkata, saya bertanya kepada Abu 'Umamah, sejak kapan kamu mendengarnya dari Rasulullah? Dia menjawab, saya mendengarnya ketika berumur tiga puluh tahun. Abu 'Isa berkata, ini adalah hadits hasan shahih."
    }
  ]
}