{
    "kategori": "Kitab Penyembelihan",
  "hadits": [
    {
        "number": 1392,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى الْقُطَعِيُّ حَدَّثَنَا عَبْدُ الْأَعْلَى عَنْ سَعِيدٍ عَنْ قَتَادَةَ عَنْ الشَّعْبِيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِأَنَّ رَجُلًا مِنْ قَوْمِهِ صَادَ أَرْنَبًا أَوْ اثْنَيْنِ فَذَبَحَهُمَا بِمَرْوَةٍ فَعَلَّقَهُمَا حَتَّى لَقِيَ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلَهُ فَأَمَرَهُ بِأَكْلِهِمَاقَالَ وَفِي الْبَاب عَنْ مُحَمَّدِ بْنِ صَفْوَانَ وَرَافِعٍ وَعَدِيِّ بْنِ حَاتِمٍ قَالَ أَبُو عِيسَى وَقَدْ رَخَّصَ بَعْضُ أَهْلِ الْعِلْمِ أَنْ يُذَكِّيَ بِمَرْوَةٍ وَلَمْ يَرَوْا بِأَكْلِ الْأَرْنَبِ بَأْسًا وَهُوَ قَوْلُ أَكْثَرِ أَهْلِ الْعِلْمِ وَقَدْ كَرِهَ بَعْضُهُمْ أَكْلَ الْأَرْنَبِ وَقَدْ اخْتَلَفَ أَصْحَابُ الشَّعْبِيِّ فِي رِوَايَةِ هَذَا الْحَدِيثِ فَرَوَى دَاوُدُ بْنُ أَبِي هِنْدٍ عَنْ الشَّعْبِيِّ عَنْ مُحَمَّدِ بْنِ صَفْوَانَ وَرَوَى عَاصِمٌ الْأَحْوَلُ عَنْ الشَّعْبِيِّ عَنْ صَفْوَانَ بْنِ مُحَمَّدٍ أَوْ مُحَمَّدِ بْنِ صَفْوَانَ وَمُحَمَّدُ بْنُ صَفْوَانَ أَصَحُّ وَرَوَى جَابِرٌ الْجُعْفِيُّ عَنْ الشَّعْبِيِّ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ نَحْوَ حَدِيثِ قَتَادَةَ عَنْ الشَّعْبِيِّ وَيُحْتَمَلُ أَنَّ رِوَايَةَ الشَّعْبِيِّ عَنْهُمَا قَالَ مُحَمَّدٌ حَدِيثُ الشَّعْبِيِّ عَنْ جَابِرٍ غَيْرُ مَحْفُوظٍ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Yahya Al Qutha'i], telah menceritakan kepada kami [Abdul A'la] dari [Sa'id] dari [Qatadah] dari [Asy Sya'bi] dari [Jabir bin Abdullah] bahwa ada seseorang dari kaumnya berburu satu atau dua kelinci lalu menyembelihnya di Marwah dan menggantungkannya hingga ia menemui Rasulullah shallallahu 'alaihi wasallam dan menanyakan tentangnya. Maka beliau menyuruh untuk memakannya. Ia mengatakan; Dalam hal ini ada hadits serupa dari Muhammad bin Shafwan, Rafi' dan 'Adi bin Hatim. Abu Isa berkata; Sebagian ulama membolehkan untuk menyembelih di Marwah dan membolehkan memakan daging kelinci, ini menjadi pendapat kebanyakan ulama, namun sebagian mereka memakruhkan makan daging kelinci. Para sahabat Asy Sya'bi berselisih dalam periwayatan hadits ini, [Daud bin Abu Hind] meriwayatkan dari [Asy Sya'bi] dari [Muhammad bin Shafwan] dan ['Ashim Al Ahwal] meriwayatkan dari [Asy Sya'bi] dari [Shafwan bin Muhammad] atau Muhammad bin Shafwan, Muhammad bin Shafwan lebih shahih. [Jabir Al Ju'fi] meriwayatkan dari [Asy Sya'bi] dari [Jabir bin Abdullah] seperti Hadits Qatadah dari Asy Sya'bi dan kemungkinan riwayat Asy Sya'bi dari keduanya. Muhammad berkata; Hadits Asy Sya'bi dari Jabir tidak terjaga."
    },
    {
        "number": 1393,
        "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ عَنْ أَبِي أَيُّوبَ الْأَفْرِيقِيِّ عَنْ صَفْوَانَ بْنِ سُلَيْمٍ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ عَنْ أَبِي الدَّرْدَاءِ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ أَكْلِ الْمُجَثَّمَةِ وَهِيَ الَّتِي تُصْبَرُ بِالنَّبْلِقَالَ وَفِي الْبَاب عَنْ عِرْبَاضِ بْنِ سَارِيَةَ وَأَنَسٍ وَابْنِ عُمَرَ وَابْنِ عَبَّاسٍ وَجَابِرٍ وَأَبِي هُرَيْرَةَ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي الدَّرْدَاءِ حَدِيثٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami [Abu Kuraib], telah menceritakan kepada kami [Abdurrahim bin Sulaiman] dari [Abu Ayyub Al Afriqi] dari [Shafwan bin Sulaim] dari [Sa'id bin Al Musayyab] dari [Abu Ad Darda`] ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang memakan mujatstsamah yaitu hewan yang diundi dan dilempari dengan batu atau panah agar mati (tidak dengan disembelih). Ia mengatakan; Dalam hal ini ada hadits serupa dari 'Irbadl bin Sariyah, Anas, Ibnu Umar, Ibnu Abbas, Jabir dan Abu Hurairah. Abu Isa berkata; Hadits Abu Ad Darda` adalah hadits gharib."
    },
    {
        "number": 1394,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا أَبُو عَاصِمٍ عَنْ وَهْبٍ أَبِي خَالِدٍ قَالَ حَدَّثَتْنِي أُمُّ حَبِيبَةَ بِنْتُ الْعِرْبَاضِ وَهُوَ ابْنُ سَارِيَةَ عَنْ أَبِيهَاأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَهَى يَوْمَ خَيْبَرَ عَنْ لُحُومِ كُلِّ ذِي نَابٍ مِنْ السَّبُعِ وَعَنْ كُلِّ ذِي مِخْلَبٍ مِنْ الطَّيْرِ وَعَنْ لُحُومِ الْحُمُرِ الْأَهْلِيَّةِ وَعَنْ الْمُجَثَّمَةِ وَعَنْ الْخَلِيسَةِ وَأَنْ تُوطَأَ الْحَبَالَى حَتَّى يَضَعْنَ مَا فِي بُطُونِهِنَّقَالَ مُحَمَّدُ بْنُ يَحْيَى الْقُطَعِيُّ سُئِلَ أَبُو عَاصِمٍ عَنْ الْمُجَثَّمَةِ قَالَ أَنْ يُنْصَبَ الطَّيْرُ أَوْ الشَّيْءُ فَيُرْمَى وَسُئِلَ عَنْ الْخَلِيسَةِ فَقَالَ الذِّئْبُ أَوْ السَّبُعُ يُدْرِكُهُ الرَّجُلُ فَيَأْخُذُهُ مِنْهُ فَيَمُوتُ فِي يَدِهِ قَبْلَ أَنْ يُذَكِّيَهَا",
        "id": "Telah menceritakan kepada kami [Muhammad bin Yahya] dan yang lainnya mereka berkata; Rasulullah shallallahu 'alaihi wasallam [Abu 'Ashim] dari [Wahb Abu Khalid] ia berkata; Telah menceritakan kepadaku [Ummu Habibah bintu Al 'Irbadl], ia adalah Ibnu Sariyah dari [ayahnya] bahwa pada hari Khaibar Rasulullah shallallahu 'alaihi wasallam melarang daging setiap binatang buas yang bertaring, setiap burung yang memiliki cakar, daging keledai jinak, hewan sebagai sasaran tembak dan hewan dari gigitan binatang buas. Beliau juga melarang menggauli wanita hamil hingga melahirkan apa yang ada diperutnya. Muhammad bin Yahya Al Qutha'i berkata; Abu 'Ashim ditanya tentang mujatstsamah, ia menjawab; Burung atau hewan yang dijadikan undian lalu dilempari (agar mati tidak disembelih). Ia juga ditanya tentang khalisah, ia menjawab; Serigala atau binatang buas yang ditangkap oleh seseorang, ia mengambil hewan yang ditangkapnya lalu mati ditangannya sebelum disembelih."
    },
    {
        "number": 1395,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى حَدَّثَنَا عَبْدُ الرَّزَّاقِ عَنْ الثَّوْرِيِّ عَنْ سِمَاكٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يُتَّخَذَ شَيْءٌ فِيهِ الرُّوحُ غَرَضًاقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَالْعَمَلُ عَلَيْهِ عِنْدَ أَهْلِ الْعِلْمِ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Abdul A'la], telah menceritakan kepada kami [Abdurrazaq] dari [Ats Tsauri] dari [Simak] dari [Ikrimah] dari [Ibnu Abbas] ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang menjadikan sesuatu yang bernyawa untuk dijadikan sasaran tembak. Abu Isa berkata; Hadits ini hasan shahih dan menjadi pedoman amal menurut para ulama."
    },
    {
        "number": 1396,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ عَنْ مُجَالِدٍ ح قَالَ حَدَّثَنَا سُفْيَانُ بْنُ وَكِيعٍ حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ عَنْ مُجَالِدٍ عَنْ أَبِي الْوَدَّاكِ عَنْ أَبِي سَعِيدٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ ذَكَاةُ الْجَنِينِ ذَكَاةُ أُمِّهِقَالَ وَفِي الْبَاب عَنْ جَابِرٍ وَأَبِي أُمَامَةَ وَأَبِي الدَّرْدَاءِ وَأَبِي هُرَيْرَةَ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رُوِيَ مِنْ غَيْرِ هَذَا الْوَجْهِ عَنْ أَبِي سَعِيدٍ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ وَهُوَ قَوْلُ سُفْيَانَ الثَّوْرِيِّ وَابْنِ الْمُبَارَكِ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَقَ وَأَبُو الْوَدَّاكِ اسْمُهُ جَبْرُ بْنُ نَوْفٍ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar], telah menceritakan kepada kami [Yahya bin Sa'id] dari [Mujalid], hadits diriwayatkan dari jalur lain, ia berkata; Telah menceritakan kepada kami [Sufyan bin Waki'] telah menceritakan kepada kami [Hafsh bin Ghiyats] dari [Mujalid] dari [Abu Al Waddak] dari [Abu Sa'id] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Penyembelihan janin mengikuti penyembelihan induknya (menyembelih janin yang ada di dalam kandungan induknya cukup dengan menyembelih induknya).\" Ia mengatakan; Dalam hal ini ada hadits serupa dari Jabir, Abu Umamah, Abu Ad Darda` dan Abu Hurairah. Abu Isa berkata; Hadits ini hasan shahih dan telah diriwayatkan dari jalur lain dari Abu Sa'id. Hadits ini menjadi pedoman amal menurut para ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka, ini menjadi pendapat Sufyan Ats Tsauri, Ibnu Al Mubarak, Asy Syafi'i, Ahmad dan Ishaq. Abu Al Waddak bernama Jubr bin Nauf."
    },
    {
        "number": 1397,
        "arab": "حَدَّثَنَا أَحْمَدُ بْنُ الْحَسَنِ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ عَنْ مَالِكِ بْنِ أَنَسٍ عَنْ ابْنِ شِهَابٍ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ قَالَنَهَى رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ كُلِّ ذِي نَابٍ مِنْ السِّبَاعِحَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ وَغَيْرُ وَاحِدٍ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ أَبِي إِدْرِيسَ الْخَوْلَانِيِّ نَحْوَهُ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَأَبُو إِدْرِيسَ الْخَوْلَانِيُّ اسْمُهُ عَائِذُ اللَّهِ بْنُ عَبْدِ اللَّهِ",
        "id": "Telah menceritakan kepada kami [Ahmad bin Al Hasan], telah menceritakan kepada kami [Abdullah bin Maslamah] dari [Malik bin Anas] dari [Ibnu Syihab] dari [Abu Idris Al Khaulani] dari [Abu Tsa'labah Al Khusyani] ia berkata; Rasulullah shallallahu 'alaihi wasallam melarang memakan setiap binatang buas yang bertaring. Telah menceritakan kepada kami [Sa'id bin Abdurrahman Al Makhzumi] dan selainnya, mereka mengatakan; Telah menceritakan kepada kami [Sufyan bin Uyainah] dari [Az Zuhri] dari [Abu Idris Al Khaulani] seperti itu. Abu Isa berkata; Hadits ini hasan shahih. Abu Idris Al Khaulani bernama 'A`idzullah bin Abdullah."
    },
    {
        "number": 1398,
        "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو النَّضْرِ هَاشِمُ بْنُ الْقَاسِمِ حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ عَنْ جَابِرٍ قَالَحَرَّمَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَعْنِي يَوْمَ خَيْبَرَ الْحُمُرَ الْإِنْسِيَّةَ وَلُحُومَ الْبِغَالِ وَكُلَّ ذِي نَابٍ مِنْ السِّبَاعِ وَذِي مِخْلَبٍ مِنْ الطَّيْرِقَالَ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ وَعِرْبَاضِ بْنِ سَارِيَةَ وَابْنِ عَبَّاسٍ قَالَ أَبُو عِيسَى حَدِيثُ جَابِرٍ حَدِيثٌ حَسَنٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan], telah menceritakan kepada kami [Abu An Nadlr Hasyim bin Al Qasim], telah menceritakan kepada kami [Ikrimah bin Ammar] dari [Yahya bin Abu Katsir] dari [Abu Salamah] dari [Jabir] ia berkata; Rasulullah shallallahu 'alaihi wasallam yakni pada hari Khaibar mengharamkan daging keledai tunggangan, daging bighal, setiap binatang buas yang bertaring, dan burung yang memiliki cakar. Ia mengatakan; Dalam hal ini ada hadits serupa dari Abu Hurairah, 'Irbadl bin Sariyah dan Ibnu Abbas. Abu Isa berkata; Hadits Jabir adalah hadits hasan gharib."
    },
    {
        "number": 1399,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَأَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَرَّمَ كُلَّ ذِي نَابٍ مِنْ السِّبَاعِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ وَهُوَ قَوْلُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ وَالشَّافِعِيِّ وَأَحْمَدَ وَإِسْحَقَ",
        "id": "Telah menceritakan kepada kami [Qutaibah], telah menceritakan kepada kami [Abdul Aziz bin Muhammad] dari [Muhammad bin Amru] dari [Abu Salamah] dari [Abu Hurairah] bahwa Rasulullah shallallahu 'alaihi wasallam mengharamkan setiap binatang buas yang bertaring. Abu Isa berkata; Hadits ini hasan dan menjadi pedoman amal menurut kebanyakan ulama dari kalangan sahabat Nabi shallallahu 'alaihi wasallam dan selain mereka, ini menjadi pendapat Abdullah bin Al Mubarak, Asy Syafi'i, Ahmad dan Ishaq."
    },
    {
        "number": 1400,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْأَعْلَى الصَّنْعَانِيُّ حَدَّثَنَا سَلَمَةُ بْنُ رَجَاءٍ قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ دِينَارٍ عَنْ زَيْدِ بْنِ أَسْلَمَ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي وَاقِدٍ اللَّيْثِيِّ قَالَقَدِمَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمَدِينَةَ وَهُمْ يَجُبُّونَ أَسْنِمَةَ الْإِبِلِ وَيَقْطَعُونَ أَلْيَاتِ الْغَنَمِ فَقَالَ مَا قُطِعَ مِنْ الْبَهِيمَةِ وَهِيَ حَيَّةٌ فَهِيَ مَيْتَةٌحَدَّثَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ الْجَوْزَجَانِيُّ حَدَّثَنَا أَبُو النَّضْرِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ بْنِ دِينَارٍ نَحْوَهُ قَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ زَيْدِ بْنِ أَسْلَمَ وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَهْلِ الْعِلْمِ وَأَبُو وَاقِدٍ اللَّيْثِيُّ اسْمُهُ الْحَارِثُ بْنُ عَوْفٍ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Abdul A'la Ash Shan'ani], telah menceritakan kepada kami [Salamah bin Raja`] ia berkata; Telah menceritakan kepada kami [Abdurrahman bin Abdullah bin Dinar] dari [Zaid bin Aslam] dari ['Atha` bin Yasar] dari [Abu Waqid Al Laitsi] ia berkata; Tatkala Nabi shallallahu 'alaihi wasallam datang ke Madinah, orang-orang biasa memotong punuk unta dan bagian dari badan kambing. Maka Nabi shallallahu 'alaihi wasallam bersabda: \"Bagian apa saja yang diambil dari binatang yang masih dalam keadaan hidup, maka itu adalah bangkai.\" Telah menceritakan kepada kami [Ibrahim bin Ya'qub Al Jauzajani] telah menceritakan kepada kami [Abu An Nadlr] dari [Abdurrahman bin Abdullah bin Dinar] seperti itu. Abu Isa berkata; Hadits ini gharib tidak kami ketahui kecuali dari Hadits Zaid bin Aslam dan menjadi pedoman amal menurut para ulama. Abu Waqid Al Laitsi bernama Harits bin Auf."
    },
    {
        "number": 1401,
        "arab": "حَدَّثَنَا هَنَّادٌ وَمُحَمَّدُ بْنُ الْعَلَاءِ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ حَمَّادِ بْنِ سَلَمَةَ ح و حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ أَنْبَأَنَا حَمَّادُ بْنُ سَلَمَةَ عَنْ أَبِي الْعُشَرَاءِ عَنْ أَبِيهِ قَالَقُلْتُ يَا رَسُولَ اللَّهِ أَمَا تَكُونُ الذَّكَاةُ إِلَّا فِي الْحَلْقِ وَاللَّبَّةِ قَالَ لَوْ طَعَنْتَ فِي فَخِذِهَا لَأَجْزَأَ عَنْكَقَالَ أَحْمَدُ بْنُ مَنِيعٍ قَالَ يَزِيدُ بْنُ هَارُونَ هَذَا فِي الضَّرُورَةِ قَالَ وَفِي الْبَاب عَنْ رَافِعِ بْنِ خَدِيجٍ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ حَمَّادِ بْنِ سَلَمَةَ وَلَا نَعْرِفُ لِأَبِي الْعُشَرَاءِ عَنْ أَبِيهِ غَيْرَ هَذَا الْحَدِيثِ وَاخْتَلَفُوا فِي اسْمِ أَبِي الْعُشَرَاءِ فَقَالَ بَعْضُهُمْ اسْمُهُ أُسَامَةُ بْنُ قِهْطِمٍ وَيُقَالُ اسْمُهُ يَسَارُ بْنُ بَرْزٍ وَيُقَالُ ابْنُ بَلْزٍ وَيُقَالُ اسْمُهُ عُطَارِدٌ نُسِبَ إِلَى جَدِّهِ",
        "id": "Telah menceritakan kepada kami [Hannad] dan [Muhammad bin Al 'Ala] keduanya berkata; telah menceritakan kepada kami [Waki'] dari [Hammad bin Salamah]. (Dalam jalur lain disebutkan) Telah menceritakan kepada kami [Ahmad bin Mani'] berkata, telah menceritakan kepada kami [Yazid bin Harun] berkata, telah memberitakan kepada kami [Hammad bin Salamah] dari [Abul 'Usyara] dari [Bapaknya] ia berkata; Aku bertanya; Wahai Rasulullah, bukankah tempat penyembelihan hewan itu pada kerongkongan dan labbah (tempat kalung)?\" beliau menjawab: \"Jika engkau tikam pahanya pun telah cukup bagimu.\" Ahmad bin Mani' berkata; Yazid bin Harun berkata, \"Hal ini jika dalam kondisi darurat.\" Ia berkata, \"Dalam bab ini juga ada hadits dari Rafi' bin Khadij.\" Abu Isa berkata, \"Ini adalah hadits gharib, kami tidak mengetahuinya kecuali dari hadits Hammad bin Salamah, dan kami tidak mengetahui riwayat Abul Usyara dari bapaknya, kecuali hadits ini. Namun para ulama berselisih pendapat tentang nama Abul Usyara; sebagian mengatakan bahwa namanya adalah Usamah bin Qihthim, ada yang menyebut Yasar bin Baraz, ada yang menyebut Ibnu Balz dan ada yang menyebut namanya dengan Utharid yang disandarkan kepada nama kakeknya.\""
    }
  ]
}