{
    "kategori": "Kitab Qodar",
  "hadits": [
    {
        "number": 2059,
        "arab": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُعَاوِيَةَ الْجُمَحِيُّ الْبَصْرِيُّ حَدَّثَنَا صَالِحٌ الْمُرِّيُّ عَنْ هِشَامِ بْنِ حَسَّانَ عَنْ مُحَمَّدِ بْنِ سِيرِينَ عَنْ أَبِي هُرَيْرَةَ قَالَخَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَنَحْنُ نَتَنَازَعُ فِي الْقَدَرِ فَغَضِبَ حَتَّى احْمَرَّ وَجْهُهُ حَتَّى كَأَنَّمَا فُقِئَ فِي وَجْنَتَيْهِ الرُّمَّانُ فَقَالَ أَبِهَذَا أُمِرْتُمْ أَمْ بِهَذَا أُرْسِلْتُ إِلَيْكُمْ إِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ حِينَ تَنَازَعُوا فِي هَذَا الْأَمْرِ عَزَمْتُ عَلَيْكُمْ أَلَّا تَتَنَازَعُوا فِيهِقَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ عُمَرَ وَعَائِشَةَ وَأَنَسٍ وَهَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ صَالِحٍ الْمُرِّيِّ وَصَالِحٌ الْمُرِّيُّ لَهُ غَرَائِبُ يَنْفَرِدُ بِهَا لَا يُتَابَعُ عَلَيْهَا",
        "id": "Telah menceritakan kepada kami ['Abdullah bin Mu'awiyah Al Jumahi Al Bashri]; telah menceritakan kepada kami [Shalih Al Murri]; dari [Hisyam bin Hassan] dari [Muhammad bin Sirin] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam keluar menemui kami sementara kami sedang berselisih dalam masalah taqdir, kemudian beliau marah hingga wajahnya menjadi merah sampai seakan akan pipinya seperti buah delima yang dibelah, lalu beliau bertanya \"Apakah kalian diperintahkan seperti ini atau apakah aku diutus kepada kalian untuk masalah ini? Sesungguhnya binasanya orang-orang sebelum kalian adalah lantaran perselisihan mereka dalam perkara ini. Karena itu, aku tekankan pada kalian untuk tidak berselisih dalam masalah ini.\" Abu Isa berkata; Hadits semakna juga diriwayatkan dari dari Umar, A'isyah dan Anas. Dan hadits ini adalah Gharib, kami tidak mengetahuinya kecuali dari jalur sanad ini dari hadits Shalih Al Murri, sedangkan Shalih Al Murri memiliki hadits hadits Gharib yang dia riwayatkan dengan sendirian dan tidak ada yang mengikutinya."
    },
    {
        "number": 2060,
        "arab": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ حَدَّثَنَا أَبِي عَنْ سُلَيْمَانَ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ احْتَجَّ آدَمُ وَمُوسَى فَقَالَ مُوسَى يَا آدَمُ أَنْتَ الَّذِي خَلَقَكَ اللَّهُ بِيَدِهِ وَنَفَخَ فِيكَ مِنْ رُوحِهِ أَغْوَيْتَ النَّاسَ وَأَخْرَجْتَهُمْ مِنْ الْجَنَّةِ قَالَ فَقَالَ آدَمُ وَأَنْتَ مُوسَى الَّذِي اصْطَفَاكَ اللَّهُ بِكَلَامِهِ أَتَلُومُنِي عَلَى عَمَلٍ عَمِلْتُهُ كَتَبَهُ اللَّهُ عَلَيَّ قَبْلَ أَنْ يَخْلُقَ السَّمَوَاتِ وَالْأَرْضَ قَالَ فَحَجَّ آدَمُ مُوسَىقَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ عُمَرَ وَجُنْدَبٍ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ مِنْ حَدِيثِ سُلَيْمَانَ التَّيْمِيِّ عَنْ الْأَعْمَشِ وَقَدْ رَوَى بَعْضُ أَصْحَابِ الْأَعْمَشِ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ و قَالَ بَعْضُهُمْ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي سَعِيدٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ مِنْ غَيْرِ وَجْهٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
        "id": "Telah menceritakan kepada kami [Yahya bin Habib bin 'Arabi]; telah menceritakan kepada kami [Al Mu'tamir bin Sulaiman]; [bapakku] telah menceritakan kepada kami dari [Sulaiman Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam, beliau bersabda: \"Nabi Adam dan Musa bersilat lidah. Berkatalah Musa, 'Wahai Adam, kamulah yang telah diciptakan Allah, dan meniupkan padamu bagian dari ruh-Nya. Namun kamu menyesatkan manusia dan mengeluarkan manusia dari surga.' Kemudian Adam balas berkata, 'Wahai Musa, kamu telah disucikan Allah dengan Kalam-Nya, apakah kamu mencelaku akan suatu amalan yang telah aku perbuat dan telah pula ditetapkan Allah sebelum Dia menciptakan langit dan bumi? ' Maka Nabi Adam pun berdalih atas Musa.\" Abu Isa berkata; Hadits semakna juga diriwayatkan dari Umar dan Jundub. Dan ini adalah hadits hasan shahih gharib bila ditinjau dari jalur ini, yakni dari haditsnya Sulaiman At Tamimi dari Al A'masy. Sebagian sahabat A'masy telah meriwayatkan dari A'masy dari Abu Shalih dari Abu Hurairah dari Nabi shallallahu 'alaihi wasallam dengan hadits semisalnya. Dan sebagian lagi menyebutkan dari [Al A'masy] dari [Abu Shalih] dari [Abu Sa'id] dari Nabi shallallahu 'alaihi wasallam. Dan hadits ini telah diriwayatkan lebih dari satu jalur dari Abu Hurairah, dari Nabi shallallahu 'alaihi wasallam."
    },
    {
        "number": 2061,
        "arab": "حَدَّثَنَا بُنْدَارٌ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا شُعْبَةُ عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ قَال سَمِعْتُ سَالِمَ بْنَ عَبْدِ اللَّهِ يُحَدِّثُ عَنْ أَبِيهِ قَالَقَالَ عُمَرُ يَا رَسُولَ اللَّهِ أَرَأَيْتَ مَا نَعْمَلُ فِيهِ أَمْرٌ مُبْتَدَعٌ أَوْ مُبْتَدَأٌ أَوْ فِيمَا قَدْ فُرِغَ مِنْهُ فَقَالَ فِيمَا قَدْ فُرِغَ مِنْهُ يَا ابْنَ الْخَطَّابِ وَكُلٌّ مُيَسَّرٌ أَمَّا مَنْ كَانَ مِنْ أَهْلِ السَّعَادَةِ فَإِنَّهُ يَعْمَلُ لِلسَّعَادَةِ وَأَمَّا مَنْ كَانَ مِنْ أَهْلِ الشَّقَاءِ فَإِنَّهُ يَعْمَلُ لِلشَّقَاءِقَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ عَلِيٍّ وَحُذَيْفَةَ بْنِ أَسِيدٍ وَأَنَسٍ وَعِمْرَانَ بْنِ حُصَيْنٍ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Bundar]; telah menceritakan kepada kami ['Abdurrahman bin Mahdi]; telah menceritakan kepada kami [Syu'bah] dari ['Ashim bin 'Ubaidullah] dia berkata; aku mendengar [Salim bin 'Abdullah] bercerita dari [bapaknya], dia berkata; Umar pernah bertanya, \"Wahai Rasulullah bagaimana pendapatmu apakah kami melakukan sesuatu yang diada-adakan atau sesuatu yang baru (belum ditentukan takdirnya) atau sesuatu yang sudah ditetapkan takdirnya?\" Maka beliau pun menjawab: \"Sesuatu yang sudah ditetapkan atas takdirnya, wahai Ibnul Khaththab, dan setiap orang akan dimudahkan, adapun orang yang termasuk Ahlu Sa'adah (orang yang berbahagia) maka dia akan beramal untuk kebahagiaan, sedangkan orang yang termasuk ahlu saqa' (orang yang celaka) maka dia akan beramal untuk kecelakaan.\" Abu Isa berkata; Dalam bab ini ada hadits dari Ali, Hudzaifah bin Asid, Anas dan Imran bin Hushain. Dan hadits ini adalah hadits hasan shahih."
    },
    {
        "number": 2062,
        "arab": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ وَوَكِيعٌ عَنْ الْأَعْمَشِ عَنْ سَعْدِ بْنِ عُبَيْدَةَ عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ عَنْ عَلِيٍّ قَالَبَيْنَمَا نَحْنُ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَنْكُتُ فِي الْأَرْضِ إِذْ رَفَعَ رَأْسَهُ إِلَى السَّمَاءِ ثُمَّ قَالَ مَا مِنْكُمْ مِنْ أَحَدٍ إِلَّا قَدْ عُلِمَ وَقَالَ وَكِيعٌ إِلَّا قَدْ كُتِبَ مَقْعَدُهُ مِنْ النَّارِ وَمَقْعَدُهُ مِنْ الْجَنَّةِ قَالُوا أَفَلَا نَتَّكِلُ يَا رَسُولَ اللَّهِ قَالَ لَا اعْمَلُوا فَكُلٌّ مُيَسَّرٌ لِمَا خُلِقَ لَهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Al Hasan bin 'Ali Al Hulwani]; telah menceritakan kepada kami ['Abdullah bin Numair] dan [Waki'] dari [Al A'masy] dari [Sa'd bin 'Ubaidah] dari [Abu 'Abdurrahman As Sulami] dari ['Ali] dia berkata; Ketika kami bersama Rasulullah shallallahu 'alaihi wasallam yang saat itu beliau sedang menunduk ke tanah. Tiba-tiba, beliau mengangkat kepalanya ke arah langit kemudian bersabda: \"Tidak seorang pun dari kalian, kecuali telah diketahui (takdir) -nya.\" Waki' berkata, \"Kecuali telah ditulis tempat duduknya, apakah dari neraka ataukah dari surga.\" Para sahabat kemudian bertanya, \"Kalau begitu, bukankah lebih baik kita bertawakkal saja wahai Rasulullah?\" beliau menjawab: \"Tidak! Beramallah kalian, sebab, setiap orang akan dimudahkan terhadap sesuatu yang telah diciptakan baginya.\" Abu Isa berkata; Ini adalah hadits hasan shahih."
    },
    {
        "number": 2063,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ زَيْدِ بْنِ وَهْبٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَحَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ الصَّادِقُ الْمَصْدُوقُ إِنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِي بَطْنِ أُمِّهِ فِي أَرْبَعِينَ يَوْمًا ثُمَّ يَكُونُ عَلَقَةً مِثْلَ ذَلِكَ ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذَلِكَ ثُمَّ يُرْسِلُ اللَّهُ إِلَيْهِ الْمَلَكَ فَيَنْفُخُ فِيهِ الرُّوحَ وَيُؤْمَرُ بِأَرْبَعٍ يَكْتُبُ رِزْقَهُ وَأَجَلَهُ وَعَمَلَهُ وَشَقِيٌّ أَوْ سَعِيدٌ فَوَالَّذِي لَا إِلَهَ غَيْرُهُ إِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إِلَّا ذِرَاعٌ ثُمَّ يَسْبِقُ عَلَيْهِ الْكِتَابُ فَيُخْتَمُ لَهُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى مَا يَكُونَ بَيْنَهُ وَبَيْنَهَا إِلَّا ذِرَاعٌ ثُمَّ يَسْبِقُ عَلَيْهِ الْكِتَابُ فَيُخْتَمُ لَهُ بِعَمَلِ أَهْلِ الْجَنَّةِ فَيَدْخُلُهَاقَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا الْأَعْمَشُ حَدَّثَنَا زَيْدُ بْنُ وَهْبٍ عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ حَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ مِثْلَهُ قَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ وَأَنَسٍ و سَمِعْت أَحْمَدَ بْنَ الْحَسَنِ قَال سَمِعْتُ أَحْمَدَ بْنَ حَنْبَلٍ يَقُولُ مَا رَأَيْتُ بِعَيْنِي مِثْلَ يَحْيَى بْنِ سَعِيدٍ الْقَطَّانِ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رَوَى شُعْبَةُ وَالثَّوْرِيُّ عَنْ الْأَعْمَشِ نَحْوَهُ حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلَاءِ حَدَّثَنَا وَكِيعٌ عَنْ الْأَعْمَشِ عَنْ زَيْدٍ نَحْوَهُ",
        "id": "Telah menceritakan kepada kami [Hannad]; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Zaid bin Wahb] dari ['Abdullah bin Mas'ud] dia berkata; Rasulullah shallallahu 'alaihi wasallam pernah bercerita kepada kami: \"Sesungguhnya salah seorang di antara kalian, telah dikumpulkan penciptaannya di dalam perut ibunya selama empat puluh hari. Kemudian ia menjadi darah pada empat puluh hari kemudian. Lalu empat puluh hari kemudian segumpal darah. Dan barulah pada saat itu, diutuslah Malaikat untuk meniupkan ruh kepanya. Kemudian ia diperintahkan dengan empat hal. Ditulis rezkinya, ajalnya, amalnya, dan apakah ia akan bahagia ataukah sengsara. Maka demi Dzat yang jiwaku berada di tangan-Nya. Sesungguhnya salah seorang dari kalian ada yang beramal dengan amalan penduduk surga hingga tidak lagi tersisa jarak antara ia dan surga kecuali hanya sejengkal, namun kitab telah mendahuluinya, lalu ia pun ditutup dengan amalan penduduk neraka dan ia pun memasukinya. Dan sungguh, salah seorang dari kalian beramal dengan amalan penduduk neraka hingga tidak ada jarak antara dirinya dengan neraka kecuali hanya sehasta, lalu ia pun didahului oleh kitab, lalu ia pun ditutup dengan amalan penduduk surga, lalu ia memasukinya.\" Abu Isa berkata; Ini adalah hadits hasan shahih. Telah menceritakan kepada kami [Muhammad bin Basysyar]; telah menceritakan kepada kami [Yahya bin Sa'id]; telah menceritakan kepada kami [Al A'masy]; telah menceritakan kepada kami [Zaid bin Wahb] dari ['Abdullah bin Mas'ud] dia berkata; Rasulullah shallallahu 'alaihi wasallam menceritakan kepada kami, dengan hadits semisalnya. Abu Isa berkata; Hadits semakna juga diriwayatkan dari Abu Hurairah dan Anas. Aku mendengar Ahmad bin Al Hasan berkata; Aku mendengar Ahmad bin Hanbal berkata, \"Aku tidak pernah melihat dengan mata kepalaku sendiri seorang seperti Yahya bin Sa'id Al Qaththani. Dan ini adalah hadits Hasan Shahih. [Syu'bah] dan [Ats Tsauri] telah meriwayatkan dari [Al A'masy] semisalnya. Telah menceritakan kepada kami [Muhammad bin Al Ala`] Telah menceritakan kepada kami [Waki'] dari [Al A'masy] dari [Zaid] hadits semisalnya."
    },
    {
        "number": 2064,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى الْقُطَعِيُّ الْبَصْرِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ رَبِيعَةَ الْبُنَانِيُّ حَدَّثَنَا الْأَعْمَشُ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كُلُّ مَوْلُودٍ يُولَدُ عَلَى الْمِلَّةِ فَأَبَوَاهُ يُهَوِّدَانِهِ أَوْ يُنَصِّرَانِهِ أَوْ يُشَرِّكَانِهِ قِيلَ يَا رَسُولَ اللَّهِ فَمَنْ هَلَكَ قَبْلَ ذَلِكَ قَالَ اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ بِهِحَدَّثَنَا أَبُو كُرَيْبٍ وَالْحُسَيْنُ بْنُ حُرَيْثٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ بِمَعْنَاهُ وَقَالَ يُولَدُ عَلَى الْفِطْرَةِ قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ وَقَدْ رَوَاهُ شُعْبَةُ وَغَيْرُهُ عَنْ الْأَعْمَشِ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يُولَدُ عَلَى الْفِطْرَةِ وَفِي الْبَاب عَنْ الْأَسْوَدِ بْنِ سَرِيعٍ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Yahya Al Qutha'i Al Bashri]; telah menceritakan kepada kami ['Abdul 'Aziz bin Rabi'ah Al Bunani]; telah menceritakan kepada kami [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Setiap anak dilahirkan di atas al millah (agama fithrahnya, Islam), namun, kedua orangtuanyalah yang menjadikannya Yahudi atau Nasrani, atau menjadikannya seorang yang musyrik.\" Kemudian ditanyakanlah pada beliau, \"Wahai Rasulullah, lalu bagaimanakah dengan yang binasa sebelum itu?\" belaiu menjawab: \"Allah-lah yang lebih tahu terhadap apa yang mereka kerjakan.\" Telah menceritakan kepada kami [Abu Kuraib] dan [Al Husain bin Huraits] keduanya berdua berkata; telah menceritakan kepada kami [Waki'] dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi shallallahu 'alaihi wasallam sepertinya dan dengan makna yang sama pula dan beliau bersabda: \"Dilahirkan dalam keadaan fithrah.\" Abu Isa berkata; Ini adlah hadits Hasan Shahih. Dan hadits ini telah diriwayatkan pula oleh [Syu'bah] dan selainnya dari [Al A'masy] dari [Abu Shalih] dari [Abu Hurairah] dari Nabi Nabi shallallahu 'alaihi wasallam, ia pun menyebutkan; \"Dilahirkan dalam keadaan fithrah.\" Hadits semakna juga diriwayatkan dari Al Aswad bin Sari'."
    },
    {
        "number": 2065,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ حُمَيْدٍ الرَّازِيُّ وَسَعِيدُ بْنُ يَعْقُوبَ قَالَا حَدَّثَنَا يَحْيَى بْنُ الضُّرَيْسِ عَنْ أَبِي مَوْدُودٍ عَنْ سُلَيْمَانَ التَّيْمِيِّ عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ عَنْ سَلْمَانَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يَرُدُّ الْقَضَاءَ إِلَّا الدُّعَاءُ وَلَا يَزِيدُ فِي الْعُمْرِ إِلَّا الْبِرُّقَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ أَبِي أَسِيدٍ وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ مِنْ حَدِيثِ سَلْمَانَ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ يَحْيَى بْنِ الضُّرَيْسِ وَأَبُو مَوْدُودٍ اثْنَانِ أَحَدُهُمَا يُقَالُ لَهُ فِضَّةُ وَهُوَ الَّذِي رَوَى هَذَا الْحَدِيثَ اسْمُهُ فِضَّةُ بَصْرِيٌّ وَالْآخَرُ عَبْدُ الْعَزِيزِ بْنُ أَبِي سُلَيْمَانَ أَحَدُهُمَا بَصْرِيٌّ وَالْآخَرُ مَدَنِيٌّ وَكَانَا فِي عَصْرٍ وَاحِدٍ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Humaid Ar Razi] dan [Sa'id bin Ya'qub] mereka berdua berkata; telah menceritakan kepada kami [Yahya bin Adh Dhurais] dari [Abu Maudud] dari [Sulaiman At Taimi] dari [Abu 'Utsman An Nahdi] dari [Salman] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidak ada yang dapat mencegah takdir kecuali do'a dan tidak ada yang bisa menambah umur kecuali amal kebajikan.\" Abu Isa berkata; Hadits semakna juga diriwayatkan dari Abu Asid. Hadits ini adalah hasan gharib dari hadits Salman, kami tidak mengetahuinya kecuali dari hadits Yahya bin Ad Durais, adapun Abu Maudud ada dua orang salah satunya yang terkenal dengan sebutan Fiddah yaitu orang yang meriwayatkan hadits ini namanya Fidldlah Bashri, sedangkan yang lainnya bernama Abdul Aziz bin Abu Sulaiman, yang satu orang Bashrah, sedangkan yang lainnya orang Madinah dan keduanya hidup dalam satu masa."
    },
    {
        "number": 2066,
        "arab": "حَدَّثَنَا هَنَّادٌ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ أَنَسٍ قَالَكَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُكْثِرُ أَنْ يَقُولَ يَا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبِي عَلَى دِينِكَ فَقُلْتُ يَا رَسُولَ اللَّهِ آمَنَّا بِكَ وَبِمَا جِئْتَ بِهِ فَهَلْ تَخَافُ عَلَيْنَا قَالَ نَعَمْ إِنَّ الْقُلُوبَ بَيْنَ أُصْبُعَيْنِ مِنْ أَصَابِعِ اللَّهِ يُقَلِّبُهَا كَيْفَ يَشَاءُقَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ النَّوَّاسِ بْنِ سَمْعَانَ وَأُمِّ سَلَمَةَ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَعَائِشَةَ وَهَذَا حَدِيثٌ حَسَنٌ وَهَكَذَا رَوَى غَيْرُ وَاحِدٍ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ أَنَسٍ وَرَوَى بَعْضُهُمْ عَنْ الْأَعْمَشِ عَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَحَدِيثُ أَبِي سُفْيَانَ عَنْ أَنَسٍ أَصَحُّ",
        "id": "Telah menceritakan kepada kami [Hannad]; telah menceritakan kepada kami [Abu Mu'awiyah] dari [Al A'masy] dari [Abu Sufyan] dari [Anas] dia berkata; adalah Rasulullah shallallahu 'alaihi wasallam terbiasa membaca do'a \"YA MUQALLIBAL QULUUB TSABBIT QALBII 'ALAA DIINIKA (wahai Dzat yang membolak balikkan hati teguhkanlah hatiku berada di atas agamamu).\" Kemudian aku pun bertanya, \"Wahai Rasulullah, kami beriman kepadamu dan kepada apa yang Anda bawa. Lalu apakah Anda masih khawatir kepada kami?\" beliau menjawab: \"Ya, karena sesungguhnya hati manusia berada di antara dua genggaman tangan Allah yang Dia bolak-balikkan menurut yang dikehendaki-Nya.\" Abu Isa berkata; Hadits semakna juga diriwayatkan dari An Nawwas bin Sam'an, Ummu Salamah, Abdullah bin Amr dan A'isyah. Dan ini adalah hadits Hasan, demikianlah kebanyakan telah meriwayatkannya dari Al A'masy dari Abu Sufyan dari Anas, dan sebagian yang lainnya telah meriwayatkannya dari [Al A'masy] dari [Abu Sufyan] dari [Jabir] dari Nabi shallallahu 'alaihi wasallam, namun hadits Abu Sufyan dari Anas lebih shahih."
    },
    {
        "number": 2067,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا اللَّيْثُ عَنْ أَبِي قَبِيلٍ عَنْ شُفَيِّ بْنِ مَاتِعٍ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَخَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفِي يَدِهِ كِتَابَانِ فَقَالَ أَتَدْرُونَ مَا هَذَانِ الْكِتَابَانِ فَقُلْنَا لَا يَا رَسُولَ اللَّهِ إِلَّا أَنْ تُخْبِرَنَا فَقَالَ لِلَّذِي فِي يَدِهِ الْيُمْنَى هَذَا كِتَابٌ مِنْ رَبِّ الْعَالَمِينَ فِيهِ أَسْمَاءُ أَهْلِ الْجَنَّةِ وَأَسْمَاءُ آبَائِهِمْ وَقَبَائِلِهِمْ ثُمَّ أُجْمِلَ عَلَى آخِرِهِمْ فَلَا يُزَادُ فِيهِمْ وَلَا يُنْقَصُ مِنْهُمْ أَبَدًا ثُمَّ قَالَ لِلَّذِي فِي شِمَالِهِ هَذَا كِتَابٌ مِنْ رَبِّ الْعَالَمِينَ فِيهِ أَسْمَاءُ أَهْلِ النَّارِ وَأَسْمَاءُ آبَائِهِمْ وَقَبَائِلِهِمْ ثُمَّ أُجْمِلَ عَلَى آخِرِهِمْ فَلَا يُزَادُ فِيهِمْ وَلَا يُنْقَصُ مِنْهُمْ أَبَدًا فَقَالَ أَصْحَابُهُ فَفِيمَ الْعَمَلُ يَا رَسُولَ اللَّهِ إِنْ كَانَ أَمْرٌ قَدْ فُرِغَ مِنْهُ فَقَالَ سَدِّدُوا وَقَارِبُوا فَإِنَّ صَاحِبَ الْجَنَّةِ يُخْتَمُ لَهُ بِعَمَلِ أَهْلِ الْجَنَّةِ وَإِنْ عَمِلَ أَيَّ عَمَلٍ وَإِنَّ صَاحِبَ النَّارِ يُخْتَمُ لَهُ بِعَمَلِ أَهْلِ النَّارِ وَإِنْ عَمِلَ أَيَّ عَمَلٍ ثُمَّ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدَيْهِ فَنَبَذَهُمَا ثُمَّ قَالَ فَرَغَ رَبُّكُمْ مِنْ الْعِبَادِ فَرِيقٌ فِي الْجَنَّةِ وَفَرِيقٌ فِي السَّعِيرِحَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا بَكْرُ بْنُ مُضَرٍ عَنْ أَبِي قَبِيلٍ نَحْوَهُ قَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ ابْنِ عُمَرَ وَهَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ وَأَبُو قَبِيلٍ اسْمُهُ حُيَيُّ بْنُ هَانِئٍ",
        "id": "Telah menceritakan kepada kami [Qutaibah]; telah menceritakan kepada kami [Al Laits] dari [Abu Qabil] dari [Syufayyi bin Mati'] dari ['Abdullah bin 'Amr bin Al 'Ash] dia berkata; Rasulullah shallallahu 'alaihi wasallam keluar menemui kami sementara di tangan beliau terdapat dua kitab. Kemudian beliau pun bertanya: \"Apakah kalian tahu kitab apakah kedua kitab ini?\" Maka kami pun menjawab: \"Tidak wahai Rasulullah, kecuali Anda mengabarkannya pada kami.\" Akhirnya beliau pun bersabda terkait dengan kitab yang berada pada tangan kanannya: \"Ini adalah kitab yang berasal dari Rabb semesta alam. Di dalamnya terdapat nama-nama penduduk surga dan juga nama-nama orang tua serta kabilah mereka. Jumlahnya telah ditutup dengan orang yang terakhir dari mereka, dan tidak akan ditambah dan jumlah mereka tidak pula dikurangi lagi.\" Kemudian beliau bersabda terkait dengan kitab yang berada di tangan kirinya: \"Adapun ini, ia adalah kitab yang juga berasal dari Rabb semesta alam. Di dalamnya telah tercantum nama-nama penghuni neraka, dan juga nama-nama bapak mereka serta kabilah mereka, dan telah dijumlah dengan orang yang terakhir dari mereka. Sehingga jumlah mereka tidak lagi akan bertambah dan tidak pula akan berkurang selama-lamanya.\" Kemudian para sahabat pun berkata, \"Kalau begitu, dimanakah letaknya amalan wahai Rasulullah jika memang perkara sudah habis?\" beliau menjawab: \"Berusahalah dan mendekatlah, karena sesungguhnya penduduk surga akan ditutup dengan amalan penduduk ahli surga, meskipun ia mengamalkan amalan apa saja. Dan sesungguhnya penduduk neraka akan ditutup pula dengan amalan penduduk neraka, meskipun ia mengerjakan amalan apa saja.\" Kemudian Rasulullah shallallahu 'alaihi wasallam bersabda dengan kedua tangannya lalu menghempaskannya dan bersabda: \"Sesungguhnya Allah telah selesai terhadap urusan para hamba-Nya. Satu golongan di dalam surga dan satu kelompok pula di dalam neraka.\" Telah menceritakan kepada kami [Qutaibah]; telah menceritakan kepada kami [Bakr bin Mudhar] dari [Abu Qabil] dengan hadits semisalnya. Abu Isa berkata; Hadits semakna juga diriwayatkan dari Ibnu Umar. Dan hadits ini adalah Hasan Shahih Gharib. Abu Qabil, namanya adalah Huyaiy bin Hani`."
    },
    {
        "number": 2068,
        "arab": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ حَدَّثَنَا إِسْمَعِيلُ بْنُ جَعْفَرٍ عَنْ حُمَيْدٍ عَنْ أَنَسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا أَرَادَ اللَّهُ بِعَبْدٍ خَيْرًا اسْتَعْمَلَهُ فَقِيلَ كَيْفَ يَسْتَعْمِلُهُ يَا رَسُولَ اللَّهِ قَالَ يُوَفِّقُهُ لِعَمَلٍ صَالِحٍ قَبْلَ الْمَوْتِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami ['Ali bin Hujr]; telah menceritakan kepada kami [Isma'il bin Ja'far] dari [Humaid] dari [Anas] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila Allah menghendaki kebaikan bagi seorang hamba, maka Dia akan menggunakannya.\" Lalu ditanyakanlah pada beliau, \"Bagaimanakah Allah menggunakannya wahai Rasulullah?\" beliau menjawab: \"Dia akan memberinya taufiq untuk beramal shalih sebelum dijemput kematian.\" Abu Isa berkata; Ini adalah hadits hasan shahih. "
    },
    {
        "number": 2069,
        "arab": "حَدَّثَنَا بُنْدَارٌ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا سُفْيَانُ عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ حَدَّثَنَا أَبُو زُرْعَةَ بْنُ عَمْرِو بْنِ جَرِيرٍ قَالَ حَدَّثَنَا صَاحِبٌ لَنَا عَنْ ابْنِ مَسْعُودٍ قَالَقَامَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ لَا يُعْدِي شَيْءٌ شَيْئًا فَقَالَ أَعْرَابِيٌّ يَا رَسُولَ اللَّهِ الْبَعِيرُ الْجَرِبُ الْحَشَفَةُ بِذَنَبِهِ فَتَجْرَبُ الْإِبِلُ كُلُّهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَمَنْ أَجْرَبَ الْأَوَّلَ لَا عَدْوَى وَلَا صَفَرَ خَلَقَ اللَّهُ كُلَّ نَفْسٍ وَكَتَبَ حَيَاتَهَا وَرِزْقَهَا وَمَصَائِبَهَاقَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ وَابْنِ عَبَّاسٍ وَأَنَسٍ قَالَ و سَمِعْت مُحَمَّدَ بْنَ عَمْرِو بْنِ صَفْوَانَ الثَّقَفِيَّ الْبَصْرِيَّ قَال سَمِعْتُ عَلِيَّ بْنَ الْمَدِينِيِّ يَقُولُ لَوْ حَلَفْتُ بَيْنَ الرُّكْنِ وَالْمَقَامِ لَحَلَفْتُ أَنِّي لَمْ أَرَ أَحَدًا أَعْلَمَ مِنْ عَبْدِ الرَّحْمَنِ بْنِ مَهْدِيٍّ",
        "id": "Telah menceritakan kepada kami [Bundar]; telah menceritakan kepada kami ['Abdurrahman bin Mahdi]; telah menceritakan kepada kami [Sufyan] dari ['Umarah bin Al Qa'qa']; telah menceritakan kepada kami [Abu Zur'ah bin 'Amr bin Jarir] dia berkata; [seorang sahabat kami] telah menceritakan kepada kami dari [Ibnu Mas'ud] dia berkata; Rasulullah shallallahu 'alaihi wasallam berdiri dihadapan kami lalu bersabda: \"Sesuatu tidak dapat menular kepada sesuatu yang lain.\" Lantas, berkatalah seorang Arab Badui, \"Wahai Rasulullah, bagaimana dengan kemaluan Unta yang berkudis melalui ekornya kemudian menjalar keseluruh Unta?\" Maka Rasulullah shallallahu 'alaihi wasallam pun menjawab: \"Siapakah yang menjadikan kudis pertama? Tidak ada penyakit dan cacing yang menular, Allah telah menciptakan setiap yang bernyawa dan telah mencatat hidupnya, rizkinya, dan musibah musibahnya.\" Abu Isa berkata; Hadits semakna juga diriwayatkan dari Abu Hurairah, Ibnu Abbas dan Anas. Dan aku telah mendengar Muhammad bin Amr bin Sufyan Ats Tsaqafi Al Bashri berkata; Aku mendengar Ali bin Al Madini berkata, \"Seandainya aku bersumpah di antara rukun (Hajar Aswad) dan maqam (maqam Ibrahim) pasti aku akan bersumpah bahwa sesungguhnya aku tidak pernah melihat seseorang yang lebih alim (pandai) dari Abdur Rahman bin Mahdi.\""
    },
    {
        "number": 2070,
        "arab": "حَدَّثَنَا أَبُو الْخَطَّابِ زِيَادُ بْنُ يَحْيَى الْبَصْرِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَيْمُونٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ أَبِيهِ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُؤْمِنُ عَبْدٌ حَتَّى يُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ حَتَّى يَعْلَمَ أَنَّ مَا أَصَابَهُ لَمْ يَكُنْ لِيُخْطِئَهُ وَأَنَّ مَا أَخْطَأَهُ لَمْ يَكُنْ لِيُصِيبَهُقَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ عُبَادَةَ وَجَابِرٍ وَعَبْدِ اللَّهِ بْنِ عَمْرٍو وَهَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ عَبْدِ اللَّهِ بْنِ مَيْمُونٍ وَعَبْدُ اللَّهِ بْنُ مَيْمُونٍ مُنْكَرُ الْحَدِيثِ",
        "id": "Telah menceritakan kepada kami [Abul Khaththab Ziyad bin Yahya Al Bashri]; telah menceritakan kepada kami ['Abdullah bin Maimun] dari [Ja'far bin Muhammad] dari [bapaknya] dari [Jabir bin 'Abdullah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Seorang hamba tidak dikatakan beriman sampai dia mengimani tentang takdir yang baik dan takdir yang buruk, sampai dia mengetahui bahwa apa yang menimpanya tidak mungkin akan meleset darinya, dan sesuatu yang tidak ditetapkan atasnya tidak akan mungkin mengenainya.\" Abu Isa berkata; Hadits semakna juga diriwayatkan dari Ubadah, Jabir dan Abdullah bin Amr, dan ini adalah hadits gharib, kami tidak mengetahuinya kecuali dari hadits Abdullah bin Maymun, sedangkan Abdullah bin Maymun adalah seorang Munkarul Hadits (Hadits haditsnya munkar)."
    },
    {
        "number": 2071,
        "arab": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا أَبُو دَاوُدَ قَالَ أَنْبَأَنَا شُعْبَةُ عَنْ مَنْصُورٍ عَنْ رِبْعِيِّ بْنِ حِرَاشٍ عَنْ عَلِيٍّ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا يُؤْمِنُ عَبْدٌ حَتَّى يُؤْمِنَ بِأَرْبَعٍ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنِّي مُحَمَّدٌ رَسُولُ اللَّهِ بَعَثَنِي بِالْحَقِّ وَيُؤْمِنُ بِالْمَوْتِ وَبِالْبَعْثِ بَعْدَ الْمَوْتِ وَيُؤْمِنُ بِالْقَدَرِحَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ عَنْ شُعْبَةَ نَحْوَهُ إِلَّا أَنَّهُ قَالَ رِبْعِيٌّ عَنْ رَجُلٍ عَنْ عَلِيٍّ قَالَ أَبُو عِيسَى حَدِيثُ أَبِي دَاوُدَ عَنْ شُعْبَةَ عِنْدِي أَصَحُّ مِنْ حَدِيثِ النَّضْرِ وَهَكَذَا رَوَى غَيْرُ وَاحِدٍ عَنْ مَنْصُورٍ عَنْ رِبْعِيٍّ عَنْ عَلِيٍّ حَدَّثَنَا الْجَارُودُ قَال سَمِعْتُ وَكِيعًا يَقُولُ بَلَغَنَا أَنَّ رِبْعِيًّا لَمْ يَكْذِبْ فِي الْإِسْلَامِ كِذْبَةً",
        "id": "Telah menceritakan kepada kami [Mahmud bin Ghailan]; telah menceritakan kepada kami [Abu Dawud]; dia berkata; telah memberitakan kepada kami [Syu'bah] dari [Manshur] dari [Rib'i bin Hirasy] dari ['Ali] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tidaklah beriman seorang hamba sehingga dia mengimani empat hal; Bersaksi bahwasanya tidak ada Ilah (yang berhak disembah) selain Allah dan aku adalah Muhammad utusan Allah yang Dia utus dengan membawa Al Haq (kebenaran), beriman kepada adanya kematian, beriman kepada adanya hari kebangkitan setelah kematian, dan beriman kepada taqdir.\" Telah menceritakan kepada kami [Mahmud bin Ghailan]; telah menceritakan kepada kami [An Nadhr bin Syumail] dari [Syu'bah] dengan hadits semisalnya. Hanya saja ia menyebutkan; Dari [Rib'i] dari [seorang laki-laki] dari [Ali]. Abu Musa berkata; Haditsnya Abu Dawud dari Syu'bah, menurutku adalah lebih shahih daripada hadits An Nadlr. Dan seperti ini pula yang telah diriwayatkan oleh lebih dari satu orang perawi dari [Manshur] dari [Rib'i] dari ['Ali]. Telah menceritakan kepada kami Al Jarud dia berkata; aku mendengar Waki' berkata; telah sampai kepada kami bahwasanya Rib'i tidak berdusta dalam Islam sekali pun."
    },
    {
        "number": 2072,
        "arab": "حَدَّثَنَا بُنْدَارٌ حَدَّثَنَا مُؤَمَّلٌ حَدَّثَنَا سُفْيَانُ عَنْ أَبِي إِسْحَقَ عَنْ مَطَرِ بْنِ عُكَامِسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَضَى اللَّهُ لِعَبْدٍ أَنْ يَمُوتَ بِأَرْضٍ جَعَلَ لَهُ إِلَيْهَا حَاجَةًقَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ أَبِي عَزَّةَ وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ وَلَا يُعْرَفُ لِمَطَرِ بْنِ عُكَامِسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ غَيْرُ هَذَا الْحَدِيثِ حَدَّثَنَا مَحْمُودُ بْنُ غَيْلَانَ حَدَّثَنَا مُؤَمَّلٌ وَأَبُو دَاوُدَ الْحَفَرِيُّ عَنْ سُفْيَانَ نَحْوَهُ",
        "id": "Telah menceritakan kepada kami [Bundar]; telah menceritakan kepada kami [Muammal]; telah menceritakan kepada kami [Sufyan] dari [Abu Ishaq] dari [Mathar bin 'Ukamis] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila Allah telah menetapkan kematian seseorang bertempat di suatu negeri, maka Allah akan menjadikan ia memiliki kebutuhan di negeri itu.\" Abu Isa berkata; Hadits semakna juga diriwayatkan dari Abu 'Azzah. Dan hadits ini adalah Hasan Gharib, dan Mathar bin Ukamis tidak diketahui memiliki periwayatan dari Nabi shallallahu 'alaihi wasallam selain daripada hadits ini. Telah menceritakan kepada kami [Mahmud bin Ghailan]; telah menceritakan kepada kami [Muammmal] dan [Abu Dawud Al Hafari] dari [Sufyan] dengan hadits semisalnya."
    },
    {
        "number": 2073,
        "arab": "حَدَّثَنَا أَحْمَدُ بْنُ مَنِيعٍ وَعَلِيُّ بْنُ حُجْرٍ الْمَعْنَى وَاحِدٌ قَالَا حَدَّثَنَا إِسْمَعِيلُ بْنُ إِبْرَاهِيمَ عَنْ أَيُّوبَ عَنْ أَبِي الْمَلِيحِ بْنِ أُسَامَةَ عَنْ أَبِي عَزَّةَ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَضَى اللَّهُ لِعَبْدٍ أَنْ يَمُوتَ بِأَرْضٍ جَعَلَ لَهُ إِلَيْهَا حَاجَةً أَوْ قَالَ بِهَا حَاجَةًقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ صَحِيحٌ وَأَبُو عَزَّةَ لَهُ صُحْبَةٌ وَاسْمُهُ يَسَارُ بْنُ عَبْدٍ وَأَبُو الْمَلِيحِ اسْمُهُ عَامِرُ بْنُ أُسَامَةَ بْنِ عُمَيْرٍ الْهُذَلِيُّ وَيُقَالُ زَيْدُ بْنُ أُسَامَةَ",
        "id": "Telah menceritakan kepada kami [Ahmad bin Mani'] dan ['Ali bin Hujr] dengan makna yang satu, mereka berdua berkata; telah menceritakan kepada kami [Isma'il bin Ibrahim] dari [Ayyub] dari [Abul Malih bin Usamah] dari [Abu 'Izzah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Apabila Allah telah menetapkan kematian seorang hamba di suatu negeri, maka Allah jadikan dia mempunyai keperluan kepadanya, atau ada keperluan di dalamnya.\" Abu Isa berkata; Hadits ini Shahih, dan Abu 'Azzah pernah bertemu dengan Nabi shallallahu 'alaihi wasallam, namanya adalah Yasar bin Abd. Sedangkan Abul Malih namanya adalah 'Amir bin Usamah bin Umair Al Hudzali dan dinamakan juga Zaid bin Usamah."
    },
    {
        "number": 2074,
        "arab": "حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ الْمَخْزُومِيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ عَنْ الزُّهْرِيِّ عَنْ ابْنِ أَبِي خُزَامَةَ عَنْ أَبِيهِأَنَّ رَجُلًا أَتَى النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ رُقًى نَسْتَرْقِيهَا وَدَوَاءً نَتَدَاوَى بِهِ وَتُقَاةً نَتَّقِيهَا هَلْ تَرُدُّ مِنْ قَدَرِ اللَّهِ شَيْئًا فَقَالَ هِيَ مِنْ قَدَرِ اللَّهِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ الزُّهْرِيِّ وَقَدْ رَوَى غَيْرُ وَاحِدٍ هَذَا عَنْ سُفْيَانَ عَنْ الزُّهْرِيِّ عَنْ أَبِي خُزَامَةَ عَنْ أَبِيهِ وَهَذَا أَصَحُّ هَكَذَا قَالَ غَيْرُ وَاحِدٍ عَنْ الزُّهْرِيِّ عَنْ أَبِي خُزَامَةَ عَنْ أَبِيهِ",
        "id": "Telah menceritakan kepada kami [Sa'id bin 'Abdurrahman Al Makhzumi]; telah menceritakan kepada kami [Sufyan bin 'Uyainah] dari [Az Zuhri] dari [Ibnu Abu Khuzamah] dari [bapaknya] bahwasanya seorang lelaki mendatangi Nabi shallallahu 'alaihi wasallam dan berkata, \"Wahai Rasulullah, bagaimanakah menurut Anda mengenai Ruqyah yang kita gunakan untuk meruqyah dan juga obat yang kita gunakan untuk berobat, dan hal-hal yang kita takuti, apakah semua itu dapat menolak takdir Allah?\" maka beliau menjawab: \"Hal itu juga termasuk takdir Allah.\" Abu Isa berkata; Hadits ini tidak kami ketahui kecuali dari haditsnya Az Zuhri. Dan hadits ini telah diriwayatkan pula oleh lebih dari seorang perawi dari Sufyan dari Az Zuhri, dari Abu Khuzamah, dari bapaknya. Dan ini lebih shahih. Seperti ini pula yang dikatakan oleh lebih dari seorang dari Az Zuhri dari Abu Khuzamah dari bapaknya."
    },
    {
        "number": 2075,
        "arab": "حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الْأَعْلَى الْكُوفِيُّ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ عَنْ الْقَاسِمِ بْنِ حَبِيبٍ وَعَلِيُّ بْنُ نِزَارٍ عَنْ نِزَارٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صِنْفَانِ مِنْ أُمَّتِي لَيْسَ لَهُمَا فِي الْإِسْلَامِ نَصِيبٌ الْمُرْجِئَةُ وَالْقَدَرِيَّةُقَالَ أَبُو عِيسَى وَفِي الْبَاب عَنْ عُمَرَ وَابْنِ عُمَرَ وَرَافِعِ بْنِ خَدِيجٍ وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا سَلَّامُ بْنُ أَبِي عَمْرَةَ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مُحَمَّدُ بْنُ رَافِعٍ وَحَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ حَدَّثَنَا عَلِيُّ بْنُ نِزَارٍ عَنْ نِزَارٍ عَنْ عِكْرِمَةَ عَنْ ابْنِ عَبَّاسٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَحْوَهُ",
        "id": "Telah menceritakan kepada kami [Washil bin 'Abdul A'la Al Kufi]; telah menceritakan kepada kami [Muhammad bin Fudhail] dari [Al Qasim bin Habib] dan ['Ali bin Nizar] dari [Nizar] dari ['Ikrimah] dari [Ibnu 'Abbas] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Dua kelompok dari ummatku yang keduanya tidak termasuk bagian dari Islam yaitu Al Qadariyah dan Murji'ah.\" Abu Isa berkata; Hadits semakna juga diriwayatkan dari Umar, Ibnu Umar dan Rafi' bin Khadij, dan hadits ini hasan gharib. Telah menceritakan kepada kami [Muhammad bin Rafi']; telah menceritakan kepada kami [Muhammad bin Bisyr]; telah menceritakan kepada kami [Sallam bin Abu 'Amrah] dari ['Ikrimah] dari [Ibnu 'Abbas] dari Nabi shallallahu 'alaihi wasallam. [Muhammad bin Rafi'] berkata; dan telah menceritakan kepada kami [Muhammad bin Bisyr]; telah menceritakan kepada kami ['Ali bin Nizar] dari [Nizar] dari ['Ikrimah] dari [Ibnu 'Abbas] dari Nabi shallallahu 'alaihi wasallam semisalnya."
    },
    {
        "number": 2076,
        "arab": "حَدَّثَنَا أَبُو هُرَيْرَةَ مُحَمَّدُ بْنُ فِرَاسٍ الْبَصْرِيُّ حَدَّثَنَا أَبُو قُتَيْبَةَ حَدَّثَنَا أَبُو الْعَوَّامِ عَنْ قَتَادَةَ عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ أَبِيهِعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ مُثِّلَ ابْنُ آدَمَ وَإِلَى جَنْبِهِ تِسْعٌ وَتِسْعُونَ مَنِيَّةً إِنْ أَخْطَأَتْهُ الْمَنَايَا وَقَعَ فِي الْهَرَمِ حَتَّى يَمُوتَقَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ هَذَا الْوَجْهِ وَأَبُو الْعَوَّامِ هُوَ عِمْرَانُ وَهُوَ ابْنُ دَاوَرَ الْقَطَّانُ",
        "id": "Telah menceritakan kepada kami [Abu Hurairah Muhammad bin Firaz Al Bashri]; telah menceritakan kepada kami [Abu Qutaibah]; telah menceritakan kepada kami [Abul 'Awwam] dari [Qatadah] dari [Mutharrif bin 'Abdullah bin Asy Syikhkhir] dari [bapaknya] dari Nabi shallallahu 'alaihi wasallam, beliau berkata: \"Anak keturunan adam diciptakan sementara di sisinya (menghadang) sembilan puluh sembilan Maniyyah (sebab sebab kematian), jika selamat dari Maniyyah itu, maka dia akan terkena pada penyakit pikun sampai meninggal.\" Abu Isa berkata; Hadits ini hasan gharib, kami tidak mengetahuinya kecuali dari jalur sanad ini, adapun Abul 'Awwam dia adalah Imran dan dia adalah anaknya Daud Al Qaththan."
    },
    {
        "number": 2077,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَامِرٍ عَنْ مُحَمَّدِ بْنِ أَبِي حُمَيْدٍ عَنْ إِسْمَعِيلَ بْنِ مُحَمَّدِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنْ أَبِيهِ عَنْ سَعْدٍ قَالَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ سَعَادَةِ ابْنِ آدَمَ رِضَاهُ بِمَا قَضَى اللَّهُ لَهُ وَمِنْ شَقَاوَةِ ابْنِ آدَمَ تَرْكُهُ اسْتِخَارَةَ اللَّهِ وَمِنْ شَقَاوَةِ ابْنِ آدَمَ سَخَطُهُ بِمَا قَضَى اللَّهُ لَهُقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ غَرِيبٌ لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ مُحَمَّدِ بْنِ أَبِي حُمَيْدٍ وَيُقَالُ لَهُ أَيْضًا حَمَّادُ بْنُ أَبِي حُمَيْدٍ وَهُوَ أَبُو إِبْرَاهِيمَ الْمَدَنِيُّ وَلَيْسَ هُوَ بِالْقَوِيِّ عِنْدَ أَهْلِ الْحَدِيثِ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar]; telah menceritakan kepada kami [Abu 'Amir] dari [Muhammad bin Abu Humaid] dari [Isma'il bin Muhammad bin Sa'd bin Abi Waqqash] dari [bapaknya] dari [Sa'd] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Termasuk di antara kebahagiaan anak Adam, adalah rasa ridhanya terhadap apa yang telah Allah tetapkan baginya. Dan termasuk kesengsaraan seorang anak Adam, adalah bila ia meninggalkan istikharah kepada Allah. Dan termasuk kesusahan Ibnu Adam, adalah rasa benci dan tidak menerima terhap apa yang telah Allah tetapkan baginya.\" Abu Isa berkata; Ini adalah hadits gharib, kami tidak mengetahuinya kecuali dari haditsnya Muhammad bin Abu Humaid, dan dipanggil pula Hammad bin Abu Humaid, dan ia dalah Abu Ibrahim Al Madini, dan ia bukanlah seorang rawi yang kuat menurut Ahli hadits."
    },
    {
        "number": 2078,
        "arab": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ حَدَّثَنَا أَبُو عَاصِمٍ حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ أَخْبَرَنِي أَبُو صَخْرٍ قَالَ حَدَّثَنِي نَافِعٌ أَنَّ ابْنَ عُمَرَجَاءَهُ رَجُلٌ فَقَالَ إِنَّ فُلَانًا يَقْرَأُ عَلَيْكَ السَّلَامَ فَقَالَ لَهُ إِنَّهُ بَلَغَنِي أَنَّهُ قَدْ أَحْدَثَ فَإِنْ كَانَ قَدْ أَحْدَثَ فَلَا تُقْرِئْهُ مِنِّي السَّلَامَ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ يَكُونُ فِي هَذِهِ الْأُمَّةِ أَوْ فِي أُمَّتِي الشَّكُّ مِنْهُ خَسْفٌ أَوْ مَسْخٌ أَوْ قَذْفٌ فِي أَهْلِ الْقَدَرِقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ وَأَبُو صَخْرٍ اسْمُهُ حُمَيْدُ بْنُ زِيَادٍ",
        "id": "Telah menceritakan kepada kami [Muhammad bin Basysyar]; telah menceritakan kepada kami [Abu 'Ashim]; telah menceritakan kepada kami [Haiwah bin Syuraih]; telah mengabarkan kepadaku [Abu Shakhrah] dia berkata; telah menceritakan kepadaku [Nafi'] bahwasanya; [Ibnu Umar] pernah didatangi seorang lelaki kemudian berkata, \"Sesungguhnya si Fulan menyampaikan salam kepadamu.\" Kemudian Ali berkata kepada laki-laki itu, \"Sesungguhnya telah sampai berita kepadaku bahwa dia telah melakukan sesuatu yang baru (mengada-ada dalam urusan agama), jika dia telah melakukan sesuatu yang baru maka jangan sampaikan salamku kepadanya, karena aku telah mendengar Rosulullah shallallahu 'alaihi wasallam bersabda: 'Akan terjadi peristiwa pada ummat ini atau pada ummatku (kata Aw keraguan dari Tirmidzi) berupa dibinasakan, di ganti bentuknya dan tuduhan terhadap orang orang yang mengingkari takdir.'\" Abu Isa berkata; Hadits ini adalah hasan shahih gharib, dan Abu Shakhr namanya Humaid bin Ziyad."
    },
    {
        "number": 2079,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا رِشْدِينُ بْنُ سَعْدٍ عَنْ أَبِي صَخْرٍ حُمَيْدِ بْنِ زِيَادٍ عَنْ نَافِعٍ عَنْ ابْنِ عُمَرَعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَكُونُ فِي أُمَّتِي خَسْفٌ وَمَسْخٌ وَذَلِكَ فِي الْمُكَذِّبِينَ بِالْقَدَرِ",
        "id": "Telah menceritakan kepada kami [Qutaibah]; telah menceritakan kepada kami [Risydin bin Sa'd] dari [Abu Shakhr Humaid bin Ziyad] dari [Nafi'] dari [Ibnu 'Umar] dari Nabi shallallahu 'alaihi wasallam bersabda: \"Akan terjadi pada umatku, yaitu kebinasaan. Dan hal itu akan terjadi pada orang-orang yang mengingkari takdir.\""
    },
    {
        "number": 2080,
        "arab": "حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ زَيْدِ بْنِ أَبِي الْمَوَالِي الْمُزَنِيُّ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ مَوْهَبٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ قَالَتْقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سِتَّةٌ لَعَنْتُهُمْ وَلَعَنَهُمْ اللَّهُ وَكُلُّ نَبِيٍّ كَانَ الزَّائِدُ فِي كِتَابِ اللَّهِ وَالْمُكَذِّبُ بِقَدَرِ اللَّهِ وَالْمُتَسَلِّطُ بِالْجَبَرُوتِ لِيُعِزَّ بِذَلِكَ مَنْ أَذَلَّ اللَّهُ وَيُذِلَّ مَنْ أَعَزَّ اللَّهُ وَالْمُسْتَحِلُّ لِحُرُمِ اللَّهِ وَالْمُسْتَحِلُّ مِنْ عِتْرَتِي مَا حَرَّمَ اللَّهُ وَالتَّارِكُ لِسُنَّتِيقَالَ أَبُو عِيسَى هَكَذَا رَوَى عَبْدُ الرَّحْمَنِ بْنُ أَبِي الْمَوَالِي هَذَا الْحَدِيثَ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ مَوْهَبٍ عَنْ عَمْرَةَ عَنْ عَائِشَةَ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَرَوَاهُ سُفْيَانُ الثَّوْرِيُّ وَحَفْصُ بْنُ غِيَاثٍ وَغَيْرُ وَاحِدٍ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ مَوْهَبٍ عَنْ عَلِيِّ بْنِ حُسَيْنٍ عَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُرْسَلًا وَهَذَا أَصَحُّ",
        "id": "Telah menceritakan kepada kami [Qutaibah]; telah menceritakan kepada kami ['Abdurrahman bin Zaid bin Abul Mawali Al Muzani] dari ['Ubaidullah bin 'Abdurrahman bin Mauhab] dari ['Amrah] dari ['Aisyah] dia berkata; Rasulullah shallallahu 'alaihi wasallam bersabda: \"Tiga orang yang aku, Allah dan setiap Nabi melaknat mereka yaitu orang yang menambah-nambah dalam kitabullah (Al Qur'an), orang yang mengingkari takdir Allah, orang yang berkuasa dengan diktator untuk memuliakan orang yang telah dihinakan oleh Allah dan menghinakan orang yang telah Allah muliakan, orang yang menghalalkan apa apa yang diharamkan Allah, orang yang menghalalkan Ahli Baitku yang telah diharamkan oleh Allah, dan orang yang meninggalkan sunnahku.\" Abu Isa berkata; Demikianlah Abdur Rahman bin Abul Mawali telah meriwayatkan hadits ini dari Ubaidillah bin Abdur Raman bin Mauhab dari 'Amrah dari A'isyah dari Nabi shallallahu 'alaihi wasallam. [Sufyan Ats Tsauri], [Hafs bin Ghiyats] dan yang lainnya telah meriwayatkan dari [Ubaidillah bin Abdur Rahman bin Mauhab] dari [Ali bin Husain] dari Nabi shallallahu 'alaihi wasallam secara mursal, dan ini yang lebih shahih."
    },
    {
        "number": 2081,
        "arab": "حَدَّثَنَا يَحْيَى بْنُ مُوسَى حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ سُلَيْمٍ قَالَقَدِمْتُ مَكَّةَ فَلَقِيتُ عَطَاءَ بْنَ أَبِي رَبَاحٍ فَقُلْتُ لَهُ يَا أَبَا مُحَمَّدٍ إِنَّ أَهْلَ الْبَصْرَةِ يَقُولُونَ فِي الْقَدَرِ قَالَ يَا بُنَيَّ أَتَقْرَأُ الْقُرْآنَ قُلْتُ نَعَمْ قَالَ فَاقْرَأْ الزُّخْرُفَ قَالَ فَقَرَأْتُ{ حم وَالْكِتَابِ الْمُبِينِ إِنَّا جَعَلْنَاهُ قُرْآنًا عَرَبِيًّا لَعَلَّكُمْ تَعْقِلُونَ وَإِنَّهُ فِي أُمِّ الْكِتَابِ لَدَيْنَا لَعَلِيٌّ حَكِيمٌ }فَقَالَ أَتَدْرِي مَا أُمُّ الْكِتَابِ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ قَالَ فَإِنَّهُ كِتَابٌ كَتَبَهُ اللَّهُ قَبْلَ أَنْ يَخْلُقَ السَّمَاوَاتِ وَقَبْلَ أَنْ يَخْلُقَ الْأَرْضَ فِيهِ إِنَّ فِرْعَوْنَ مِنْ أَهْلِ النَّارِ وَفِيهِ{ تَبَّتْ يَدَا أَبِي لَهَبٍ وَتَبَّ }قَالَ عَطَاءٌ فَلَقِيتُ الْوَلِيدَ بْنَ عُبَادَةَ بْنِ الصَّامِتِ صَاحِبَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَأَلْتُهُ مَا كَانَ وَصِيَّةُ أَبِيكَ عِنْدَ الْمَوْتِ قَالَ دَعَانِي أَبِي فَقَالَ لِي يَا بُنَيَّ اتَّقِ اللَّهَ وَاعْلَمْ أَنَّكَ لَنْ تَتَّقِيَ اللَّهَ حَتَّى تُؤْمِنَ بِاللَّهِ وَتُؤْمِنَ بِالْقَدَرِ كُلِّهِ خَيْرِهِ وَشَرِّهِ فَإِنْ مُتَّ عَلَى غَيْرِ هَذَا دَخَلْتَ النَّارَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِنَّ أَوَّلَ مَا خَلَقَ اللَّهُ الْقَلَمَ فَقَالَ اكْتُبْ فَقَالَ مَا أَكْتُبُ قَالَ اكْتُبْ الْقَدَرَ مَا كَانَ وَمَا هُوَ كَائِنٌ إِلَى الْأَبَدِقَالَ أَبُو عِيسَى وَهَذَا حَدِيثٌ غَرِيبٌ مِنْ هَذَا الْوَجْهِ",
        "id": "Telah menceritakan kepada kami [Yahya bin Musa]; telah menceritakan kepada kami [Abu Dawud Ath Thayalisi]; telah menceritakan kepada kami ['Abdul Wahid bin Sulaim]; dia berkata; Aku memasuki Makkah kemudian aku menemui ['Atha bin Abu Rabbah]. Maka aku berkata kepadanya, \"Wahai Abu Muhammad, sesungguhnya penduduk Bashrah memperbincangkan masalah Qadar.\" Lalu Atha' berkata, \"Wahai anakku, apakah kamu membaca Al Qur'an?\" Aku menjawab, \"Ya\" 'Atha` melanjutkan, \"Bacalah surat Az-Zukhruf.\" Abdul Wahid berkata; Maka aku pun membaca, \"HAA MIIM WAL KITAABIL MUBIIN, INNAA JA'ALNAAHU QUR'AANAN 'AROBIYYAN LA'ALLAKUM TA'QILUUN, WA INNAHU FII UMMIL KITAABI LADAINAA LA'ALIYYUN HAKIIM (HAA MIIM, Demi Kitab (Al Qur'an) yang menerangkan. Sesungguhnya Kami menjadikan Al Qur'an dalam bahasa Arab supaya kamu memahami-nya. Dan sesungguhnya Al Qur'an itu dalam induk Al Kitab (Lauhul Mahfudz) di sisi kami, adalah benar benar tinggi (nilainya) dan amat banyak mengandung hikmah).\" Kemudian Atha' bertanya, \" Apakah kamu tahu apa maksudnya Ummul Kitab?\" aku menjawab, \"Hanya Allah dan Rasul-Nya yang lebih tahu.\" Atha' berkata, \"Susungguhnya Ummul Kitab adalah kitab yang ditulis oleh Allah sebelum menciptakan langit dan bumi di dalamnya terdapat ayat yang menyatakan bahwa Fir'aun termasuk penghuni neraka, dan di dalamnya terdapat ayat, 'TABBAT YADAA ABII LAHABIW WATAB (Binasalah kedua tangan Abu Lahab dan sesungguhnya dia akan binasa).'\" Atha' berkata lagi; Aku bertemu dengan [Al Walid bin Ubadah bin Ash Shamith] sahabat Rasulullah shallallahu 'alaihi wasallam, aku tanyakan kepadanya tentang, \"Wasiat apakah yang di wasiatkan bapakmu pada saat saat wafat?\" Dia menjawab; [Bapakku] pernah memanggilku kemudian dia berkata kepadaku, \"Wahai anakku, bertakwalah kepada Allah dan ketahuilah sesungguhnya kamu tidak akan sekali kali bertakwa kepada Allah sehingga kamu beriman kepada Allah dan beriman kepada adanya takdir seluruhnya yang baik maupun yang buruk, jika kamu meninggal tidak berada di atas keimanan ini maka kamu akan masuk neraka, sesungguhnya aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: 'Sesungguhnya yang pertama kali Allah ciptakan adalah Al Qalam kemudian Allah berfirman: 'Tulislah' Maka Al Qalam bertanya, 'Apa yang aku tulis? ' Lalu Allah berfirman: 'Tulislah takdir yang telah terjadi dan yang akan terjadi sepanjang masa.'\" Abu Isa berkata; Hadits ini adalah gharib bila ditinjau dari jalur sanad ini."
    },
    {
        "number": 2082,
        "arab": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُنْذِرِ الْبَاهِلِيُّ الصَّنْعَانِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ حَدَّثَنَا حَيْوَةُ بْنُ شُرَيْحٍ حَدَّثَنِي أَبُو هَانِئٍ الْخَوْلَانِيُّ أَنَّهُ سَمِعَ أَبَا عَبْدِ الرَّحْمَنِ الْحُبُلِيَّ يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَمْرٍو يَقُولُسَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ قَدَّرَ اللَّهُ الْمَقَادِيرَ قَبْلَ أَنْ يَخْلُقَ السَّمَاوَاتِ وَالْأَرْضَ بِخَمْسِينَ أَلْفَ سَنَةٍقَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ",
        "id": "Telah menceritakan kepada kami [Ibrahim bin 'Abdullah bin Al Mundzir Al Bahili Ash Shan'ani]; telah menceritakan kepada kami ['Abdullah bin Yazid Al Muqri']; telah menceritakan kepada kami [Haiwah bin Syuraih]; telah menceritakan kepadaku [Abu Hani' Al Khaulani] bahwasanya dia mendengar [Abu 'Abdurrahman Al Hubuli] berkata; aku mendengar ['Abdullah bin 'Amr] berkata; aku mendengar Rasulullah shallallahu 'alaihi wasallam bersabda: \"Allah telah menentukan takdir segala sesuatu, lima puluh ribu tahun sebelum menciptakan lagit dan bumi.\" Abu Isa berkata; Ini adalah hadits hasan shahih gharib."
    },
    {
        "number": 2083,
        "arab": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ وَمُحَمَّدُ بْنُ بَشَّارٍ قَالَا حَدَّثَنَا وَكِيعٌ عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ زِيَادِ بْنِ إِسْمَعِيلَ عَنْ مُحَمَّدِ بْنِ عَبَّادِ بْنِ جَعْفَرٍ الْمَخْزُومِيِّ عَنْ أَبِي هُرَيْرَةَ قَالَجَاءَ مُشْرِكُو قُرَيْشٍ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُخَاصِمُونَ فِي الْقَدَرِ فَنَزَلَتْ هَذِهِ الْآيَةُ{ يَوْمَ يُسْحَبُونَ فِي النَّارِ عَلَى وُجُوهِهِمْ ذُوقُوا مَسَّ سَقَرَ إِنَّا كُلَّ شَيْءٍ خَلَقْنَاهُ بِقَدَرٍ }قَالَ أَبُو عِيسَى هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
        "id": "Telah menceritakan kepada kami [Abu Kuraib Muhammad bin Al 'Ala] dan [Muhammad bin Basysyar] mereka berdua berkata; telah menceritakan kepada kami [Waki'] dari [Sufyan Ats Tsauri] dari [Ziyad bin Isma'il] dari [Muhammad bin 'Abbad bin Ja'far Al Makhzumi] dari [Abu Hurairah] dia berkata; Orang-orang musyrik Quraisy datang kepada Rasulullah shallallahu 'alaihi wasallam guna memperdebatkan masalah takdir, maka turunlah ayat ini: \"Wajah-wajah mereka tersungkur di dalam neraka. (Dikatakanlah pada mereka) Rasakanlah siksa yang pedih, sesungguhnya segala sesuatu kami ciptakan dengan takdirnya.\" Abu Isa berkata; Ini adalah hadits hasan shahih."
    }
  ]
}